[{"attributes":{"date":"2015-11-12T00:00:00.000Z","title":"Firefly Learning Conference 2015","images":[{"image":"conference-2015-cover.jpg","caption":"Simon, at the Firefly Learning Conference 2015"},{"image":"conference-2015-josh-01.jpg","caption":"The reaction to Josh's cartoons","set":"josh"},{"image":"conference-2015-josh-02.jpg","caption":"Some of Josh's cartoons","set":"josh"},{"image":"conference-2015-team-01.jpg","caption":"The welcome desks","set":"team"},{"image":"conference-2015-team-02.jpg","caption":"Abi and David","set":"team"},{"image":"conference-2015-team-03.jpg","caption":"Fireflies queue for lunch","set":"team"}],"tags":["education","work","firefly"],"id":"54","type":"diary"},"body":"\nBesides [BETT](http://www.bettshow.com/), the Firefly Learning Conference is our biggest UK event of the year. It's a chance for our clients to get together and listen to some fantastic speakers from all areas of Education. \n\nPart of the draw, _we hope_, is to see what's coming next in Firefly. [Joe](https://twitter.com/j0ejack) does his \"Steve Jobs\" and wows the crowd with the top-secret features we've been working on in the preceding months. This year was particularly crowd pleasing as we announced the next major version of our software: Firefly 6.  \n\nWhile a full review of the day itself is no-doubt forthcoming on the [Firefly Blog](http://fireflylearning.com/blog), for me, the conference is chance to reflect on the previous 12 months and celebrate the achievements of my team, and all of the brilliant people I get to work with every day. There are, however, some highlights that particularly stuck out from the day, that I wanted to mention first.\n\n## David Gifford, Graphic Facilitator\n\n[David Gifford](http://inscriptdesign.com), aka Josh, is a good friend of Firefly and an all-round top bloke. He's also an incredible artist. He brought his formidable talents to bear on the day providing sketch notes of all the sessions. Aided by Firefly's own Rachel Anderson, they captured the essence of all the talks in cartoon form. This proved hugely popular, and was one of my highlights of the day.\n\n(gallery set:josh) \n\n## Team time\n\nIt's not often all the Fireflies gather in one place, so when we do there's always a particular buzz in the air. The conference is pretty unique as it's an exciting event anyway, add in a smattering of friend's you've not seen for a while and you've got yourself a pretty fantastic day. We're a bunch of people who genuinely love what we do, and I think that shows. I'm sure our clients would agree!\n\n(gallery set:team) \n\n## Designing Firefly 6\n\nDuring 2014 we cemented our move from part-agency to a full product company. We've really built on that move this year; With an expanded product team and a huge push to make user experience a core part of how we build software. My team, Design, have been instrumental in the development of Firefly 6. We now sit as part of the product team, and along side Development and UX we've undertaken the design of four new iOS apps and the design and front-end build of Firefly on the web.\n\nOver the last few months we've updated almost all our processes, right from the way we've massively increased the amount of research we do with teachers, students and parents; to creating a pattern library for all our front-end code. \n\nI've [said it before](/diary/46/), but it bares repeating: I'm incredibly proud of all we've achieved this year, and can't wait to get Firefly 6 into the hands of our teachers and their students. ","html_body":"<p>Besides <a href=\"http://www.bettshow.com/\">BETT</a>, the Firefly Learning Conference is our biggest UK event of the year. It’s a chance for our clients to get together and listen to some fantastic speakers from all areas of Education. </p>\n<p>Part of the draw, <em>we hope</em>, is to see what’s coming next in Firefly. <a href=\"https://twitter.com/j0ejack\">Joe</a> does his “Steve Jobs” and wows the crowd with the top-secret features we’ve been working on in the preceding months. This year was particularly crowd pleasing as we announced the next major version of our software: Firefly 6.  </p>\n<p>While a full review of the day itself is no-doubt forthcoming on the <a href=\"http://fireflylearning.com/blog\">Firefly Blog</a>, for me, the conference is chance to reflect on the previous 12 months and celebrate the achievements of my team, and all of the brilliant people I get to work with every day. There are, however, some highlights that particularly stuck out from the day, that I wanted to mention first.</p>\n<h2 id=\"david-gifford-graphic-facilitator\">David Gifford, Graphic Facilitator</h2>\n<p><a href=\"http://inscriptdesign.com\">David Gifford</a>, aka Josh, is a good friend of Firefly and an all-round top bloke. He’s also an incredible artist. He brought his formidable talents to bear on the day providing sketch notes of all the sessions. Aided by Firefly’s own Rachel Anderson, they captured the essence of all the talks in cartoon form. This proved hugely popular, and was one of my highlights of the day.</p>\n\n\n    <figure>\n        \n            <img src=\"conference-2015-josh-01.jpg\"/>\n            \n            <figcaption>The reaction to Josh's cartoons</figcaption>\n            \n        \n            <img src=\"conference-2015-josh-02.jpg\"/>\n            \n            <figcaption>Some of Josh's cartoons</figcaption>\n            \n        \n    </figure>\n\n<h2 id=\"team-time\">Team time</h2>\n<p>It’s not often all the Fireflies gather in one place, so when we do there’s always a particular buzz in the air. The conference is pretty unique as it’s an exciting event anyway, add in a smattering of friend’s you’ve not seen for a while and you’ve got yourself a pretty fantastic day. We’re a bunch of people who genuinely love what we do, and I think that shows. I’m sure our clients would agree!</p>\n\n\n    <figure>\n        \n            <img src=\"conference-2015-team-01.jpg\"/>\n            \n            <figcaption>The welcome desks</figcaption>\n            \n        \n            <img src=\"conference-2015-team-02.jpg\"/>\n            \n            <figcaption>Abi and David</figcaption>\n            \n        \n            <img src=\"conference-2015-team-03.jpg\"/>\n            \n            <figcaption>Fireflies queue for lunch</figcaption>\n            \n        \n    </figure>\n\n<h2 id=\"designing-firefly-6\">Designing Firefly 6</h2>\n<p>During 2014 we cemented our move from part-agency to a full product company. We’ve really built on that move this year; With an expanded product team and a huge push to make user experience a core part of how we build software. My team, Design, have been instrumental in the development of Firefly 6. We now sit as part of the product team, and along side Development and UX we’ve undertaken the design of four new iOS apps and the design and front-end build of Firefly on the web.</p>\n<p>Over the last few months we’ve updated almost all our processes, right from the way we’ve massively increased the amount of research we do with teachers, students and parents; to creating a pattern library for all our front-end code. </p>\n<p>I’ve <a href=\"/diary/46/\">said it before</a>, but it bares repeating: I’m incredibly proud of all we’ve achieved this year, and can’t wait to get Firefly 6 into the hands of our teachers and their students. </p>\n","html_snippet":{"s":"<p>Besides <a href=\"http://www.bettshow.com/\">BETT</a>, the Firefly Learning Conference is our biggest UK event of the year. It’s a chance for our clients to get together and listen to some fantastic speakers from all areas of Education. </p><p>Part...</p>","orig":"<p>Besides <a href=\"http://www.bettshow.com/\">BETT</a>, the Firefly Learning Conference is our biggest UK event of the year. It’s a chance for our clients to get together and listen to some fantastic speakers from all areas of Education. </p><p>Part...</p>","length":256}},{"attributes":{"date":"2015-10-22T00:00:00.000Z","title":"The future of technology in the classroom","images":[{"image":"technology-in-the-classroom.jpg","set":"main"}],"id":"53","type":"diary"},"body":"One of the things I spend a lot of time thinking about is education; or, more specifically the use of technology in education. I'm not a teacher, but I do work for a tech company whose goal it is to make education better.\n\nRecently the [<abbr title=\" Organisation for Economic Co-operation and Development\">OECD</abbr> released a report](https://www.tes.com/news/school-news/breaking-news/frequent-use-school-computers-impairs-learning-finds-international) that suggested that the use of technology in the classroom was having a detrimental effect on how well pupils were performing in standardised tests. As an organisation who really takes the time to try and understand education, Firefly certainly had a few thoughts on the report. One of our founders, Joe Mathewson, [shared his thoughts on the report](http://fireflylearning.com/blog/is-technology-good-or-bad-for-schools) on The BBC News Channel. \n\nAs one of the people who designs software  used by hundreds-of-thousands of students, teachers and parents every day I have a responsibility to help build something genuinely useful. What we're hearing loud-and-clear from teachers is that technology is just another tool, and is only useful when used alongside other tools and teaching methods. \n\nAs [Cat Scutt](https://twitter.com/CatScutt), Head of Learning Technology and Innovation at the Girls' Day School Trust, recently commented in her [TES article](https://www.tes.com/news/school-news/breaking-views/yin-and-yang-using-mobile-technology-classroom).\n\n> [E]ven if we focus on [academic achievement] alone, there is a fundamental flaw here in treating ICT as if it is a pedagogical approach in itself.\n\nIt's with this in mind that I'd like to consider what's next for the classroom. Currently, mobile is the disrupter of the technological status quo. With tablets and phones now ubiquitous, computers have entered every part of the school day. But what happens next is anyones guess; the future is up for grabs. Of course there are indicators of what's to come, decisions those in the know are making today that _may_ affect the technology of tomorrow.\n\nRecently, [Facebook brought Oculus Rift](https://www.facebook.com/zuck/posts/10101319050523971) for $2billion. So why did they invest in a technology that seemed to have died on its arse in the mid 1980s? Well, Mark Zuckerberg certainly seems to be convinced <abbr title=\"Virtual Reality\">VR</abbr> is the next big thing in tech:\n\n> We have a lot more to do on mobile, but at this point we feel we're in a position where we can start focusing on what platforms will come next.\n\nOf course, not everyone is thrilled about Facebook's acquisition of Oculus, some even suggesting that billionaire Zuckerberg simply loved the device, so he bought the company. However, it's hard to ignore his vision, and it's pretty clear what a difference VR could make to could make to the world beyond just games.\n\nA world stuffed full of Facebook ads aside, if VR is due to replace the screen, and change the way we interact with our environment, what does this mean for the classroom?\n\n## Early adopters\n\nAn enterprising teacher could, if they wished, start using VR now. Oculus sell [Developer kits](https://www.oculus.com/en-us/dk2/) so those with coding skills can build pretty much any experience they wish.\n\nImagine a physics teacher explaining the structure of an atom to their students by immersing them in a world where she's able to zoom deep into the environment and show the students how the atoms of their desks are arranged. If that sounds far-fetched then have a look at [the tomorrow project](http://tomorrow-projects.com/classroom/), helping school children build their own 3D printable robots.\n\nI imagine some teachers and parents might see this as the ultimate nightmare scenario for the classroom; rows of students, all wearing goggles, hooked into the schools mainframe. No one speaks as information is simply downloaded into the student's brain.\n\nWhat I'm suggesting here is something quite different. Unlike mobile devices, which by their nature prevent real-world social interactions, Virtual Reality simply adds another layer on top. This augmented reality would support real-world interactions in a way that mobile never can. However, I do think that the success of VR used in this way will very much depend on how unobtrusive the VR headsets / glasses / contact lenses can be made.\n\n## Wider integration\n\nI think the mobile revolution has shown us that much of the technology innovation happening in schools is driven by students. Many schools have now adopted one to one or <abbr title=\"Bring Your Own Device\">BYOD</abbr> programmes as a direct kick-back against the tidal wave of devices being brought into school anyway, choosing to utilise technology, rather than have it serve only as a distraction.\n\nAs with anything new, there have been varying levels of success, and the OECD report is evidence of that. Personally, I think we're over the initial hump. Teachers and <abbr title=\"Senior Leadership Teams\">SLTs</abbr> are much more switched on to the potential of mobile computing devices, and their pitfalls. The same will be true of future technology. As VR becomes more prevalent in everyday life, schools will learn how best to integrate it into their classrooms.\n\n## Alternative technologies\n\nAnother technology in its infancy, and one which has huge potential for schools, is smart surfaces. I recently listened to an extremely interesting [podcast from the Royal Society](https://royalsociety.org/stay-in-touch/rss/) called \"seeing clearly\", in which [Dr Dan Credgington](http://www.phy.cam.ac.uk/directory/dr-dan-credgington) gave a brief outline of how we generate light, more specifically how we use <abbr title=\"Light Emitting Diode\">LED</abbr> technology to generate light.\n\nOne of the areas he touched on was future materials, and how LEDs could be used to transform whole surfaces into light producing smart surfaces, and therefore, smart screens. Not only might this improve concentration levels in classrooms (by making the whole ceiling the light we could generate an ambient light level much closer to that of natural sunlight) but we could transform [all surfaces in the classroom into screens](https://en.wikipedia.org/wiki/Holodeck). \n\n## Fanciful imaginings\n\nIts fun to imagine what's next, but for now all of us at Firefly are concentrating on our next set of apps for teachers, students and parents. And, as far as I know, we've no plans to release these for Facebook VR 1.0. At least, not yet anyway.\n","html_body":"<p>One of the things I spend a lot of time thinking about is education; or, more specifically the use of technology in education. I’m not a teacher, but I do work for a tech company whose goal it is to make education better.</p>\n<p>Recently the <a href=\"https://www.tes.com/news/school-news/breaking-news/frequent-use-school-computers-impairs-learning-finds-international\"><abbr title=\" Organisation for Economic Co-operation and Development\">OECD</abbr> released a report</a> that suggested that the use of technology in the classroom was having a detrimental effect on how well pupils were performing in standardised tests. As an organisation who really takes the time to try and understand education, Firefly certainly had a few thoughts on the report. One of our founders, Joe Mathewson, <a href=\"http://fireflylearning.com/blog/is-technology-good-or-bad-for-schools\">shared his thoughts on the report</a> on The BBC News Channel. </p>\n<p>As one of the people who designs software  used by hundreds-of-thousands of students, teachers and parents every day I have a responsibility to help build something genuinely useful. What we’re hearing loud-and-clear from teachers is that technology is just another tool, and is only useful when used alongside other tools and teaching methods. </p>\n<p>As <a href=\"https://twitter.com/CatScutt\">Cat Scutt</a>, Head of Learning Technology and Innovation at the Girls’ Day School Trust, recently commented in her <a href=\"https://www.tes.com/news/school-news/breaking-views/yin-and-yang-using-mobile-technology-classroom\">TES article</a>.</p>\n<blockquote>\n<p>[E]ven if we focus on [academic achievement] alone, there is a fundamental flaw here in treating ICT as if it is a pedagogical approach in itself.</p>\n</blockquote>\n<p>It’s with this in mind that I’d like to consider what’s next for the classroom. Currently, mobile is the disrupter of the technological status quo. With tablets and phones now ubiquitous, computers have entered every part of the school day. But what happens next is anyones guess; the future is up for grabs. Of course there are indicators of what’s to come, decisions those in the know are making today that <em>may</em> affect the technology of tomorrow.</p>\n<p>Recently, <a href=\"https://www.facebook.com/zuck/posts/10101319050523971\">Facebook brought Oculus Rift</a> for $2billion. So why did they invest in a technology that seemed to have died on its arse in the mid 1980s? Well, Mark Zuckerberg certainly seems to be convinced <abbr title=\"Virtual Reality\">VR</abbr> is the next big thing in tech:</p>\n<blockquote>\n<p>We have a lot more to do on mobile, but at this point we feel we’re in a position where we can start focusing on what platforms will come next.</p>\n</blockquote>\n<p>Of course, not everyone is thrilled about Facebook’s acquisition of Oculus, some even suggesting that billionaire Zuckerberg simply loved the device, so he bought the company. However, it’s hard to ignore his vision, and it’s pretty clear what a difference VR could make to could make to the world beyond just games.</p>\n<p>A world stuffed full of Facebook ads aside, if VR is due to replace the screen, and change the way we interact with our environment, what does this mean for the classroom?</p>\n<h2 id=\"early-adopters\">Early adopters</h2>\n<p>An enterprising teacher could, if they wished, start using VR now. Oculus sell <a href=\"https://www.oculus.com/en-us/dk2/\">Developer kits</a> so those with coding skills can build pretty much any experience they wish.</p>\n<p>Imagine a physics teacher explaining the structure of an atom to their students by immersing them in a world where she’s able to zoom deep into the environment and show the students how the atoms of their desks are arranged. If that sounds far-fetched then have a look at <a href=\"http://tomorrow-projects.com/classroom/\">the tomorrow project</a>, helping school children build their own 3D printable robots.</p>\n<p>I imagine some teachers and parents might see this as the ultimate nightmare scenario for the classroom; rows of students, all wearing goggles, hooked into the schools mainframe. No one speaks as information is simply downloaded into the student’s brain.</p>\n<p>What I’m suggesting here is something quite different. Unlike mobile devices, which by their nature prevent real-world social interactions, Virtual Reality simply adds another layer on top. This augmented reality would support real-world interactions in a way that mobile never can. However, I do think that the success of VR used in this way will very much depend on how unobtrusive the VR headsets / glasses / contact lenses can be made.</p>\n<h2 id=\"wider-integration\">Wider integration</h2>\n<p>I think the mobile revolution has shown us that much of the technology innovation happening in schools is driven by students. Many schools have now adopted one to one or <abbr title=\"Bring Your Own Device\">BYOD</abbr> programmes as a direct kick-back against the tidal wave of devices being brought into school anyway, choosing to utilise technology, rather than have it serve only as a distraction.</p>\n<p>As with anything new, there have been varying levels of success, and the OECD report is evidence of that. Personally, I think we’re over the initial hump. Teachers and <abbr title=\"Senior Leadership Teams\">SLTs</abbr> are much more switched on to the potential of mobile computing devices, and their pitfalls. The same will be true of future technology. As VR becomes more prevalent in everyday life, schools will learn how best to integrate it into their classrooms.</p>\n<h2 id=\"alternative-technologies\">Alternative technologies</h2>\n<p>Another technology in its infancy, and one which has huge potential for schools, is smart surfaces. I recently listened to an extremely interesting <a href=\"https://royalsociety.org/stay-in-touch/rss/\">podcast from the Royal Society</a> called “seeing clearly”, in which <a href=\"http://www.phy.cam.ac.uk/directory/dr-dan-credgington\">Dr Dan Credgington</a> gave a brief outline of how we generate light, more specifically how we use <abbr title=\"Light Emitting Diode\">LED</abbr> technology to generate light.</p>\n<p>One of the areas he touched on was future materials, and how LEDs could be used to transform whole surfaces into light producing smart surfaces, and therefore, smart screens. Not only might this improve concentration levels in classrooms (by making the whole ceiling the light we could generate an ambient light level much closer to that of natural sunlight) but we could transform <a href=\"https://en.wikipedia.org/wiki/Holodeck\">all surfaces in the classroom into screens</a>. </p>\n<h2 id=\"fanciful-imaginings\">Fanciful imaginings</h2>\n<p>Its fun to imagine what’s next, but for now all of us at Firefly are concentrating on our next set of apps for teachers, students and parents. And, as far as I know, we’ve no plans to release these for Facebook VR 1.0. At least, not yet anyway.</p>\n","html_snippet":{"s":"<p>One of the things I spend a lot of time thinking about is education; or, more specifically the use of technology in education. I’m not a teacher, but I do work for a tech company whose goal it is to make...</p>","orig":"<p>One of the things I spend a lot of time thinking about is education; or, more specifically the use of technology in education. I’m not a teacher, but I do work for a tech company whose goal it is to make...</p>","length":213}},{"attributes":{"date":"2015-09-05T00:00:00.000Z","title":"Old hobbies die hard","tags":["personal","creative","art"],"images":[{"image":"2015-09-05_001.jpg","caption":"Toonin on a Saturday night","set":"cover"},{"image":"2015-09-05_002.jpg","set":"rabbits"},{"image":"2015-09-05_005.jpg","set":"rabbits"},{"image":"2015-09-05_004.jpg","set":"rabbits"}],"id":"52","type":"diary"},"body":"As I kid I loved to draw cartoons. \n\nLater, when I went off to University, I briefly toyed with the idea of jacking-in my degree to pursue a career as a bohemian cartoon artist. Looking back now I'm glad I didn't; I really wasn't any good. I'd have probably ended up in a gutter in Paris somewhere...\n\n{% include figure.html set=\"cover\" class=\"pull-both\" %}\n\nAt some unknown point after this I stopped cartooning. I'm not sure why, but for some reason I stopped doing something I loved. Recently though, I've had rekindling of passion for drawing. Sure, I've forgotten a lot of the technical skills, like any unpracticed activity I've become rusty. But now, unlike before, I can appreciate it as just a hobby. I don't really have to be any good if I enjoy it.\n\n{% include gallery.html set=\"rabbits\" %} \n\nLast time I visited my parents house I searched high and low for my old portfolio. No such luck, that thing is long gone. This time I'm determined to keep my drawings, maybe my kids would one day like to see the stupid drawing of rabbits their old man used to do in the more heady days of his 'youth'... ","html_body":"<p>As I kid I loved to draw cartoons. </p>\n<p>Later, when I went off to University, I briefly toyed with the idea of jacking-in my degree to pursue a career as a bohemian cartoon artist. Looking back now I’m glad I didn’t; I really wasn’t any good. I’d have probably ended up in a gutter in Paris somewhere…</p>\n<p>{% include figure.html set=”cover” class=”pull-both” %}</p>\n<p>At some unknown point after this I stopped cartooning. I’m not sure why, but for some reason I stopped doing something I loved. Recently though, I’ve had rekindling of passion for drawing. Sure, I’ve forgotten a lot of the technical skills, like any unpracticed activity I’ve become rusty. But now, unlike before, I can appreciate it as just a hobby. I don’t really have to be any good if I enjoy it.</p>\n<p>{% include gallery.html set=”rabbits” %} </p>\n<p>Last time I visited my parents house I searched high and low for my old portfolio. No such luck, that thing is long gone. This time I’m determined to keep my drawings, maybe my kids would one day like to see the stupid drawing of rabbits their old man used to do in the more heady days of his ‘youth’… </p>\n","html_snippet":{"s":"<p>As I kid I loved to draw cartoons. </p><p>Later, when I went off to University, I briefly toyed with the idea of jacking-in my degree to pursue a career as a bohemian cartoon artist. Looking back now I’m glad...</p>","orig":"<p>As I kid I loved to draw cartoons. </p><p>Later, when I went off to University, I briefly toyed with the idea of jacking-in my degree to pursue a career as a bohemian cartoon artist. Looking back now I’m glad...</p>","length":218}},{"attributes":{"date":"2015-08-28T00:00:00.000Z","title":"Jekyll archives without plugins","tags":["code","jekyll"],"images":[{"image":"2015-09-01-artwork.jpg","set":"artwork"},{"image":"2015-09-01-archive-folders.png","set":"folders"}],"id":"51","type":"diary"},"body":"I recently made the switch to [Jekyll](http://jekyllrb.com) as my publishing tool for this website. I love it, not least as it lets me serve content directly from Github. Updating the site is as simple as pushing into my repository. I have no servers to maintain and no extra monthly costs. For a low traffic site it seems, for now at least, like the perfect solution.\n\n(figure set:artwork,class:\"pull-both\")\n\nTo me, one of the most interesting things about writing a blog is the ability to look back, to make old posts new again with an easily navigable archive section. A key part of that is the 'archives for year ...' page. However, hosting with Github pages means that I can't use plugins for Jekyll that you'd normally need to achieve this. Jekyll doesn't really offer much in the way of core functionality for archives, but with a bit of hacking you can create an archive page for every year in a way that doesn't suck.\n\nWe can use the power of [Jekyll collections](http://jekyllrb.com/docs/collections/) to _somewhat_ automatically generate an archive page for each year your site has posts. There's three main parts to the setup:\n\n1. Configure a collection for archives.\n2. Create a post for each year for which you want an archive page.\n3. Create a layout for processing each archive post into <abbr title=\"Hyper Text Markup Language\">HTML</abbr>\n\n## Configure the archives collection\nFirst, we need to tell Jekyll about our new collection. In my site configuration file, (usually `_config.yml`) I added the following:\n\n```\ncollections:\n  archives:\n    output: true\n    permalink: /archives/:path/\n```\n\nThis tells Jekyll that we want a collection called **archives**, that we want it to output an `index.html` for each item in the collection, and we want it to do so under the `/archives` url.\n\n## Create a post per year\nOur new archives collection will read any markdown files in a folder named `_archives`, so we'll have to create a post for each year your site has posts in this folder. This is why I say that this method is only _somewhat_ automatic, however we'll only every have to worry about updating this once per year.\n\nFor example, if we want an archive page for 2015 at `archives/2015` we'd create the post `_archives/2015.md`. The only thing that's really required here is YML front matter, here's a simplified version of my `2015.md`:\n\n```\n---\ntitle: Archives for 2015\nyear: \"2015\"\nlayout: archive-year\n---\n```\n\nDon't forget the quotation marks, the reason for them will shortly become apparent.\n\n(figure set:folders,class:\"u-boxout pull-left\",image_size:small)\n\nHere's a simplified view of my local folder setup showing all the markdown files for each year in the `_archives` collection.\n\nThe `archives` folder contains the `index.html` file for the root of my archives section.\n\n\n## Archive page layout\nNow we need to define a layout that Jekyll will use to output each archive page. I did this in a layout  `_layouts/archive-year.html`. Here's a simplified version of my file:\n\n```\n---\nlayout: default\n---\n<h1>{{ page.title }}</h1>\n<ul>\n{% for post in site.posts %}\n    {% capture post_year %}{{ post.date | date: '%Y' }}{% endcapture %}\n    {% if post_year == page.year %}\n            <li><a href=\"{{ site.baseurl }}{{ post.url }}\">{{ post.title }}</a></li>       \n    {% endif %}\n{% endfor %}\n</ul>\n```\n\nIts all pretty simple really. We're looping though all the posts on the site, and only displaying them if they match the target year. By the way, those quotation marks from earlier are required for matching the `post_year` with `page.year`, which both have to be strings\n\nAnd that's it. A _sort-of_ automatic way to generate an archive page-per-year.\n","html_body":"<p>I recently made the switch to <a href=\"http://jekyllrb.com\">Jekyll</a> as my publishing tool for this website. I love it, not least as it lets me serve content directly from Github. Updating the site is as simple as pushing into my repository. I have no servers to maintain and no extra monthly costs. For a low traffic site it seems, for now at least, like the perfect solution.</p>\n<p>(figure set:artwork,class:”pull-both”)</p>\n<p>To me, one of the most interesting things about writing a blog is the ability to look back, to make old posts new again with an easily navigable archive section. A key part of that is the ‘archives for year …’ page. However, hosting with Github pages means that I can’t use plugins for Jekyll that you’d normally need to achieve this. Jekyll doesn’t really offer much in the way of core functionality for archives, but with a bit of hacking you can create an archive page for every year in a way that doesn’t suck.</p>\n<p>We can use the power of <a href=\"http://jekyllrb.com/docs/collections/\">Jekyll collections</a> to <em>somewhat</em> automatically generate an archive page for each year your site has posts. There’s three main parts to the setup:</p>\n<ol>\n<li>Configure a collection for archives.</li>\n<li>Create a post for each year for which you want an archive page.</li>\n<li>Create a layout for processing each archive post into <abbr title=\"Hyper Text Markup Language\">HTML</abbr></li>\n</ol>\n<h2 id=\"configure-the-archives-collection\">Configure the archives collection</h2>\n<p>First, we need to tell Jekyll about our new collection. In my site configuration file, (usually <code>_config.yml</code>) I added the following:</p>\n<pre><code>collections:\n  archives:\n    output: true\n    permalink: /archives/:path/\n</code></pre><p>This tells Jekyll that we want a collection called <strong>archives</strong>, that we want it to output an <code>index.html</code> for each item in the collection, and we want it to do so under the <code>/archives</code> url.</p>\n<h2 id=\"create-a-post-per-year\">Create a post per year</h2>\n<p>Our new archives collection will read any markdown files in a folder named <code>_archives</code>, so we’ll have to create a post for each year your site has posts in this folder. This is why I say that this method is only <em>somewhat</em> automatic, however we’ll only every have to worry about updating this once per year.</p>\n<p>For example, if we want an archive page for 2015 at <code>archives/2015</code> we’d create the post <code>_archives/2015.md</code>. The only thing that’s really required here is YML front matter, here’s a simplified version of my <code>2015.md</code>:</p>\n<pre><code>---\ntitle: Archives for 2015\nyear: &quot;2015&quot;\nlayout: archive-year\n---\n</code></pre><p>Don’t forget the quotation marks, the reason for them will shortly become apparent.</p>\n<p>(figure set:folders,class:”u-boxout pull-left”,image_size:small)</p>\n<p>Here’s a simplified view of my local folder setup showing all the markdown files for each year in the <code>_archives</code> collection.</p>\n<p>The <code>archives</code> folder contains the <code>index.html</code> file for the root of my archives section.</p>\n<h2 id=\"archive-page-layout\">Archive page layout</h2>\n<p>Now we need to define a layout that Jekyll will use to output each archive page. I did this in a layout  <code>_layouts/archive-year.html</code>. Here’s a simplified version of my file:</p>\n<pre><code>---\nlayout: default\n---\n&lt;h1&gt;{{ page.title }}&lt;/h1&gt;\n&lt;ul&gt;\n{% for post in site.posts %}\n    {% capture post_year %}{{ post.date | date: &#39;%Y&#39; }}{% endcapture %}\n    {% if post_year == page.year %}\n            &lt;li&gt;&lt;a href=&quot;{{ site.baseurl }}{{ post.url }}&quot;&gt;{{ post.title }}&lt;/a&gt;&lt;/li&gt;       \n    {% endif %}\n{% endfor %}\n&lt;/ul&gt;\n</code></pre><p>Its all pretty simple really. We’re looping though all the posts on the site, and only displaying them if they match the target year. By the way, those quotation marks from earlier are required for matching the <code>post_year</code> with <code>page.year</code>, which both have to be strings</p>\n<p>And that’s it. A <em>sort-of</em> automatic way to generate an archive page-per-year.</p>\n","html_snippet":{"s":"<p>I recently made the switch to <a href=\"http://jekyllrb.com\">Jekyll</a> as my publishing tool for this website. I love it, not least as it lets me serve content directly from Github. Updating the site is as simple as pushing into my repository....</p>","orig":"<p>I recently made the switch to <a href=\"http://jekyllrb.com\">Jekyll</a> as my publishing tool for this website. I love it, not least as it lets me serve content directly from Github. Updating the site is as simple as pushing into my repository....</p>","length":253}},{"attributes":{"date":"2015-03-21T00:00:00.000Z","title":"What I talk about when I talk about beards","images":[{"image":"IMG_0184.jpg","caption":"The final product, far from perfect","set":"beard"},{"image":"IMG_0199.jpg","caption":"","set":"shave"},{"image":"IMG_0208.jpg","caption":"","set":"shave"}],"cover":"IMG_0184.jpg","introduction":"_Twiddle, twiddle, scratch, scratch, scratch_. Such has been my life over the past month. That ends this evening; the beard is gone.","id":"50","type":"diary"},"body":"_Twiddle, twiddle, scratch, scratch, scratch_. Such has been my life over the past month. That ends this evening; the beard is gone.\n\nTo share this tale of beard butchery, let me first set the scene: It’s 2015 and in the towns and villages of England the common hipster is alive and well. You’ll see him wherever you go, seeking to fit in with as little of what’s popular as possible. \n\nOne thing this sub-non-culture of  has brought about is the resurgence of the beard. Please, hold the letters explaining how beards were popular long before the hipsters moved in; I know this, but as they’re so common place, down our way, I believe this was the thing that got me thinking about face-rugs. This, and a chap called Marc at work had grown the most impressive beard I’d ever seen on a real-life human man. It was like a Norse god had taken up residence in our office. \n\nIt was, at the start of March, I had the thought of letting my face hair grow, unimpinged for as long as I could stand it. \n\nAfter a couple of weeks it was clear that this wasn't going to be as easy as I’d first thought. Far from the majestic swept back locks that adorn the faces of Hittite statues, mine was more akin to the bush that lines the driveway at the end of our road.\n\nIt was at this point I decided I needed some help. Having heard Marc talking about oiling his beard, I thought “Oh, I should _totally_ do that!”. I, like, _totally_ did too, using some of Katie’s pregnancy belly oil. It was the worst. By the end of the day my face smelled like a dead badger that'd been out in the sun for several days. Google to the rescue, and I found [Percy’s beard oil](http://www.percynobleman.com/product/beard-oil/). Yes, it's probably as hipster as hipster can be, but it’s also a brilliant product. \n\nBeard oil in hand I ploughed on, and was rewarded, even if I do say so myself, with half decent face hair. _Emphasis on the “half”_.\n\n{% include figure.html class=\"pull-both\" set=\"beard\" %}\n\nSo, why the change of heart? Why is the beard no more? Well, to be honest, it was all too much like hard work. Oh sure, I was a prince amongst men, but it all got a little too much. I couldn’t stop playing with it for one, not great if you want a great beard. Also, food would occasionally get stuck in there, and that’s a look that’s not that easy to carry off. The writing was on the wall for el beardo.\n\nOf course, I performed the obligatory shaving-off-into-stupid-styles ceremony, many of which, upon seeing my face, Katie threatened divorce. \n\n{% include gallery.html class=\"pull-both\" set=\"shave\" %}\n\nIf this month has taught me anything, it’s that a good beard is no easy thing. It takes work. It takes the ability to leave it the hell alone. But, most of all, it takes a will of iron to push though the itchy stage. \n\n\n","html_body":"<p><em>Twiddle, twiddle, scratch, scratch, scratch</em>. Such has been my life over the past month. That ends this evening; the beard is gone.</p>\n<p>To share this tale of beard butchery, let me first set the scene: It’s 2015 and in the towns and villages of England the common hipster is alive and well. You’ll see him wherever you go, seeking to fit in with as little of what’s popular as possible. </p>\n<p>One thing this sub-non-culture of  has brought about is the resurgence of the beard. Please, hold the letters explaining how beards were popular long before the hipsters moved in; I know this, but as they’re so common place, down our way, I believe this was the thing that got me thinking about face-rugs. This, and a chap called Marc at work had grown the most impressive beard I’d ever seen on a real-life human man. It was like a Norse god had taken up residence in our office. </p>\n<p>It was, at the start of March, I had the thought of letting my face hair grow, unimpinged for as long as I could stand it. </p>\n<p>After a couple of weeks it was clear that this wasn’t going to be as easy as I’d first thought. Far from the majestic swept back locks that adorn the faces of Hittite statues, mine was more akin to the bush that lines the driveway at the end of our road.</p>\n<p>It was at this point I decided I needed some help. Having heard Marc talking about oiling his beard, I thought “Oh, I should <em>totally</em> do that!”. I, like, <em>totally</em> did too, using some of Katie’s pregnancy belly oil. It was the worst. By the end of the day my face smelled like a dead badger that’d been out in the sun for several days. Google to the rescue, and I found <a href=\"http://www.percynobleman.com/product/beard-oil/\">Percy’s beard oil</a>. Yes, it’s probably as hipster as hipster can be, but it’s also a brilliant product. </p>\n<p>Beard oil in hand I ploughed on, and was rewarded, even if I do say so myself, with half decent face hair. <em>Emphasis on the “half”</em>.</p>\n<p>{% include figure.html class=”pull-both” set=”beard” %}</p>\n<p>So, why the change of heart? Why is the beard no more? Well, to be honest, it was all too much like hard work. Oh sure, I was a prince amongst men, but it all got a little too much. I couldn’t stop playing with it for one, not great if you want a great beard. Also, food would occasionally get stuck in there, and that’s a look that’s not that easy to carry off. The writing was on the wall for el beardo.</p>\n<p>Of course, I performed the obligatory shaving-off-into-stupid-styles ceremony, many of which, upon seeing my face, Katie threatened divorce. </p>\n<p>{% include gallery.html class=”pull-both” set=”shave” %}</p>\n<p>If this month has taught me anything, it’s that a good beard is no easy thing. It takes work. It takes the ability to leave it the hell alone. But, most of all, it takes a will of iron to push though the itchy stage. </p>\n","html_snippet":{"s":"<p><em>Twiddle, twiddle, scratch, scratch, scratch</em>. Such has been my life over the past month. That ends this evening; the beard is gone.</p><p>To share this tale of beard butchery, let me first set the scene: It’s...</p>","orig":"<p><em>Twiddle, twiddle, scratch, scratch, scratch</em>. Such has been my life over the past month. That ends this evening; the beard is gone.</p><p>To share this tale of beard butchery, let me first set the scene: It’s...</p>","length":226}},{"attributes":{"date":"2015-03-20T00:00:00.000Z","title":"Partial Solar Eclipse","images":[{"image":"IMG_9976.jpg","caption":"The \"magical\" solar eclipse over Littlehampton","set":"seafront"},{"image":"IMG_0003.jpg","caption":"Mrs. M was impressed with the morning's events","set":"mrsm"}],"cover":"/assets/blog/covers/IMG_9976.jpg","introduction":"The heady tale of one man's search for a magazine, resulting in him getting sky poop in his eye. All of this and more in my story of today's partial eclipse of the sun.","tags":["littlehampton","Friends"],"id":"49","type":"diary"},"body":"I've spent most of my lunchtimes this week desperately searching newsagents for the _BBC Sky at Night magazine_, hunting for the elusive copy with free solar viewing glasses. As today’s eclipse approached, first E-bay then Amazon’s stocks of the glasses ran dry. Only, I didn’t know this as I hadn’t checked. By the time I did, it was too late. \n\nHaving exhausted shops the length and breadth of Brighton, Hammersmith and around Victoria station I’d given up hope of ever finding them. Then, would you Adam and Eve it? I found the magazine complete with it’s free gift in WHSmiths, in Rustinton, three minutes from my house. Oh, _how_ we laughed… Well, I laughed. A little.\n\nYou see, dear reader, the purpose of this wild goose chase was today’s partial eclipse of the sun.\n\nI remember the last one in August 1999, I was 19 and had a _trés_ cool summer job in the local library. I remember what an impact it had on me, feeling that definite sense of smallness that many others report. So I was, quite understandably, quite excited about this one.\n\nBut the bloody weather conspired against all of us along the south coast of England by merrily blocking our view. Mother nature shat out her fluffy sky diarrhoea all over the sky, and all over my dreams.\n\n{% include figure.html class=\"pull-both\" set=\"seafront\" %}\n\nKatie and I met up with Ellie and Mrs.M. by the big turd on Littlehampton sea-front at half eight this morning, hoping against hope that the sky would clear. Alas, it did not.\n\nThe skies _did_ go a little dark, but nothing spectacular, and nothing like I remember; standing on the grassy knoll outside Bloxwich public library all those years ago.\n\nKatie attempted to cheer me up by letting me buy her a coffee at the local pub. While we sat, sipping our hot beverage of choice, we tried not to get too jealous at the brilliant pictures being posted by friends and family up in the Midlands, where the skies had been gloriously clear.\n\n{% include figure.html class=\"pull-both\" set=\"mrsm\" %}\n\nNext chance to see a decent eclipse is [August 12, 2026](http://en.wikipedia.org/wiki/Solar_eclipse_of_August_12,_2026). Oh well, at least I already have the glasses.","html_body":"<p>I’ve spent most of my lunchtimes this week desperately searching newsagents for the <em>BBC Sky at Night magazine</em>, hunting for the elusive copy with free solar viewing glasses. As today’s eclipse approached, first E-bay then Amazon’s stocks of the glasses ran dry. Only, I didn’t know this as I hadn’t checked. By the time I did, it was too late. </p>\n<p>Having exhausted shops the length and breadth of Brighton, Hammersmith and around Victoria station I’d given up hope of ever finding them. Then, would you Adam and Eve it? I found the magazine complete with it’s free gift in WHSmiths, in Rustinton, three minutes from my house. Oh, <em>how</em> we laughed… Well, I laughed. A little.</p>\n<p>You see, dear reader, the purpose of this wild goose chase was today’s partial eclipse of the sun.</p>\n<p>I remember the last one in August 1999, I was 19 and had a <em>trés</em> cool summer job in the local library. I remember what an impact it had on me, feeling that definite sense of smallness that many others report. So I was, quite understandably, quite excited about this one.</p>\n<p>But the bloody weather conspired against all of us along the south coast of England by merrily blocking our view. Mother nature shat out her fluffy sky diarrhoea all over the sky, and all over my dreams.</p>\n<p>{% include figure.html class=”pull-both” set=”seafront” %}</p>\n<p>Katie and I met up with Ellie and Mrs.M. by the big turd on Littlehampton sea-front at half eight this morning, hoping against hope that the sky would clear. Alas, it did not.</p>\n<p>The skies <em>did</em> go a little dark, but nothing spectacular, and nothing like I remember; standing on the grassy knoll outside Bloxwich public library all those years ago.</p>\n<p>Katie attempted to cheer me up by letting me buy her a coffee at the local pub. While we sat, sipping our hot beverage of choice, we tried not to get too jealous at the brilliant pictures being posted by friends and family up in the Midlands, where the skies had been gloriously clear.</p>\n<p>{% include figure.html class=”pull-both” set=”mrsm” %}</p>\n<p>Next chance to see a decent eclipse is <a href=\"http://en.wikipedia.org/wiki/Solar_eclipse_of_August_12,_2026\">August 12, 2026</a>. Oh well, at least I already have the glasses.</p>\n","html_snippet":{"s":"<p>I’ve spent most of my lunchtimes this week desperately searching newsagents for the <em>BBC Sky at Night magazine</em>, hunting for the elusive copy with free solar viewing glasses. As today’s eclipse approached,...</p>","orig":"<p>I’ve spent most of my lunchtimes this week desperately searching newsagents for the <em>BBC Sky at Night magazine</em>, hunting for the elusive copy with free solar viewing glasses. As today’s eclipse approached,...</p>","length":222}},{"attributes":{"date":"2015-02-12T00:00:00.000Z","title":"Lightpainting with Mary","images":[{"image":"IMG_9243.jpg","caption":"Sheltering from Sparks — 5 seconds at f2.8 / ISO: 400 / Focal Length: 17mm. ","set":"mary1"},{"image":"IMG_9244.jpg","caption":"Ouch!","set":"mary2"},{"image":"IMG_9245.jpg","caption":"Sheltering from Sparks, reprise.","set":"mary2"},{"image":"IMG_9247.jpg","caption":"Mary spins the wool","set":"mary2"},{"image":"IMG_9256.jpg","caption":"Halo","set":"mary2"}],"section":"diary","cover":"/assets/blog/covers/IMG_9243.jpg","introduction":"How I persuaded Mary to stand in the freezing cold while I flung sparks at her is still a mystery. Nonetheless, after the sun went down this evening we ventured to Swanbourne Lake in Arundel. ","tags":["Light Painting","Photography","Friends"],"post_css":"body {\nbackground-color:#211D26;\n}\n.prose h1,\n.prose p {\ncolor:white;\n}\n.prose figure {\nborder-color:white;\n}\n","id":"48","type":"diary"},"body":"How I persuaded Mary to stand in the freezing cold while I flung sparks at her is still a mystery. Nonetheless, after the sun went down this evening we ventured to Swanbourne Lake in Arundel. \n\n{% include figure.html class=\"pull-both\" set=\"mary1\" %}\n\nI'd scouted this location a couple of weeks ago. That evening I'd managed to fire off a few shots in the old boat-house before being chased away by an angry swan. This time we ventured further around the lake and found a spot where several low trees grow out into the lake, their spider-leg branches submerged here and there. \n\nThe goal for tonight was that staple of lightpainting; \"Sheltering from Sparks\". The key to this photo is having a long enough shutter speed to capture the sparks and paint in your subject, but not so long that any movement picked up. Mary was excellent at holding still, but holding an umbrella and yourself perfectly still for ten seconds is almost impossible. In the end we found that an exposure of 5-6 seconds was the longest Mary could manage without moving at all.\n\nThere are probably other ways that this photo could be done, but as there was only two of us, I had to start off the timer, light the wire-wool and spin the sparks. So, rather than painting Mary in separately, I set up two  flashlights just far enough away to gently build-up the light over the course of the exposure.\n\n{% include gallery.html class=\"pull-both\" set=\"mary2\" %}\n\nI'm pretty pleased with the results of this evening's outing, and now that I know I have a willing model I might be calling on her services again for some other photo ideas I have. Lucky her...","html_body":"<p>How I persuaded Mary to stand in the freezing cold while I flung sparks at her is still a mystery. Nonetheless, after the sun went down this evening we ventured to Swanbourne Lake in Arundel. </p>\n<p>{% include figure.html class=”pull-both” set=”mary1” %}</p>\n<p>I’d scouted this location a couple of weeks ago. That evening I’d managed to fire off a few shots in the old boat-house before being chased away by an angry swan. This time we ventured further around the lake and found a spot where several low trees grow out into the lake, their spider-leg branches submerged here and there. </p>\n<p>The goal for tonight was that staple of lightpainting; “Sheltering from Sparks”. The key to this photo is having a long enough shutter speed to capture the sparks and paint in your subject, but not so long that any movement picked up. Mary was excellent at holding still, but holding an umbrella and yourself perfectly still for ten seconds is almost impossible. In the end we found that an exposure of 5-6 seconds was the longest Mary could manage without moving at all.</p>\n<p>There are probably other ways that this photo could be done, but as there was only two of us, I had to start off the timer, light the wire-wool and spin the sparks. So, rather than painting Mary in separately, I set up two  flashlights just far enough away to gently build-up the light over the course of the exposure.</p>\n<p>{% include gallery.html class=”pull-both” set=”mary2” %}</p>\n<p>I’m pretty pleased with the results of this evening’s outing, and now that I know I have a willing model I might be calling on her services again for some other photo ideas I have. Lucky her…</p>\n","html_snippet":{"s":"<p>How I persuaded Mary to stand in the freezing cold while I flung sparks at her is still a mystery. Nonetheless, after the sun went down this evening we ventured to Swanbourne Lake in Arundel. </p><p>{% include...</p>","orig":"<p>How I persuaded Mary to stand in the freezing cold while I flung sparks at her is still a mystery. Nonetheless, after the sun went down this evening we ventured to Swanbourne Lake in Arundel. </p><p>{% include...</p>","length":219}},{"attributes":{"date":"2015-01-12T00:00:00.000Z","title":"Project 365 2015","section":"diary","cover":"/assets/blog/covers/IMG_7388.jpg","images":[{"image":"IMG_7388.jpg","caption":"A good start — Cath, Dave & Katie at Swanbourne Lake — January 1st 2015.","set":"jan"}],"introduction":"When I tried, and failed to write of review of 2014 I was a little disgusted at my poor memory. This year, I'm propping up the crumbling underside of my brain by taking a photo every day...","tags":["Photography"],"id":"47","type":"diary"},"body":"When I tried, and failed to write of review of 2014 I was a little disgusted at my poor memory. What _did_ we do in January 2014? Honestly I have no idea, and aside from the obvious _recovered from the Christmas hangover_ or _decided to loose some weight_ January is a blur.\n\nAll these moments in our lives go by so quickly. I suppose this is one of the reasons that services like Facebook are so popular — they allow you to capture moments in your life and then give you a way to play it back at a later date. It's exactly for this reason I started writing things down and publishing them here.\n\nWhat better way to document 2015, the year we're expecting our first child, than to take a photo every day. I have [tried this before](/gallery/365-2010), but gave up at day 16. I'm hopeful this time will be different and, inspired by [Flix's Project 365](http://mockingbirdcomic.com/comic-365/) rules, I've set myself some guidelines. \n\n- Take at least one photo every day.\n- If you miss a day, don't worry about it. Carry on the next day.\n- Write something about the photo. A paragraph or two will do.\n- Replacing photos is fine, as long as it's just a better shot of what was there before.\n\n{% include figure.html class=\"pull-both\" set=\"jan\" %}\n\nMy ultimate aim is to have a collection of memories from the year. Some will be mundane, most will be badly lit, but there may be a few we’ll print out and put on our walls. Treasured memories from what’s hopefully going to be a fun, scary and pooey nappy filled year.\n\nIf you're interested, you can [view all my Project 365 photos](/365). ","html_body":"<p>When I tried, and failed to write of review of 2014 I was a little disgusted at my poor memory. What <em>did</em> we do in January 2014? Honestly I have no idea, and aside from the obvious <em>recovered from the Christmas hangover</em> or <em>decided to loose some weight</em> January is a blur.</p>\n<p>All these moments in our lives go by so quickly. I suppose this is one of the reasons that services like Facebook are so popular — they allow you to capture moments in your life and then give you a way to play it back at a later date. It’s exactly for this reason I started writing things down and publishing them here.</p>\n<p>What better way to document 2015, the year we’re expecting our first child, than to take a photo every day. I have <a href=\"/gallery/365-2010\">tried this before</a>, but gave up at day 16. I’m hopeful this time will be different and, inspired by <a href=\"http://mockingbirdcomic.com/comic-365/\">Flix’s Project 365</a> rules, I’ve set myself some guidelines. </p>\n<ul>\n<li>Take at least one photo every day.</li>\n<li>If you miss a day, don’t worry about it. Carry on the next day.</li>\n<li>Write something about the photo. A paragraph or two will do.</li>\n<li>Replacing photos is fine, as long as it’s just a better shot of what was there before.</li>\n</ul>\n<p>{% include figure.html class=”pull-both” set=”jan” %}</p>\n<p>My ultimate aim is to have a collection of memories from the year. Some will be mundane, most will be badly lit, but there may be a few we’ll print out and put on our walls. Treasured memories from what’s hopefully going to be a fun, scary and pooey nappy filled year.</p>\n<p>If you’re interested, you can <a href=\"/365\">view all my Project 365 photos</a>. </p>\n","html_snippet":{"s":"<p>When I tried, and failed to write of review of 2014 I was a little disgusted at my poor memory. What <em>did</em> we do in January 2014? Honestly I have no idea, and aside from the obvious <em>recovered from the Christmas...</em></p>","orig":"<p>When I tried, and failed to write of review of 2014 I was a little disgusted at my poor memory. What <em>did</em> we do in January 2014? Honestly I have no idea, and aside from the obvious <em>recovered from the Christmas...</em></p>","length":236}},{"attributes":{"date":"2014-11-13T00:00:00.000Z","title":"Firefly Conference 2014","section":"diary","tags":["firefly","work"],"cover":"/assets/blog/covers/0104 Firefly.jpg","images":[{"image":"0104 Firefly.jpg","caption":"The partners Joe & Simon and (some of) the design team at the Firefly Learning Conference 2014","set":"team"}],"post_css":".device img {\n  max-width:100%;\n  display:block;\n  }\n  \n  .device {\n  background-color: black;\n  padding: 30px;\n  border-radius: 10px;\n  max-width: 720px;\n  margin: 0 auto;\n  }\n","introduction":"Over the last couple of months Firefly's design team have been _extra_ busy. The reason for this flurry of activity was three new themes we'd be working for the big launch at the Firefly Learning Conference.","id":"46","type":"diary"},"body":"Over the last couple of months Firefly's design team have been even busier than usual. The reason for this flurry of activity was three new themes we'd be working for the big launch at the Firefly Learning Conference.\n\nThere's a [full writeup](http://fireflylearning.com/blog/firefly-learning-conference-round-up) on the Firefly blog, but I wanted to share a little about the process of creating the new themes that we hope will give students, teachers and parents an improved experience while using Firefly.\n \nSince the launch of Firefly 5 last year, we've learnt a lot from our clients about what worked for them and what didn't.  We've also worked with some fantastic schools, creating bespoke themes, which gave us a wealth of ideas of the features students and teachers really want.\n\nUsing this feedback, we were able to distill a clear list of the _type_ of themes schools wanted, along with the customisation options that would appeal. We determined to build three new themes: One a playful, friendly theme; Another, clean and succinct; Lastly, a super minimalist theme.\n\nWhen I joined, just over three years ago, Firefly were five people crammed into a small office hidden away in a dark corner of One Lyric Square. The design department consisted of me and a pack of half empty Sharpies. Today we're a forty strong team, with three (soon to be four) designers, with our own office in sunny Brighton. Over the summer holidays we were joined by intern [Adam Marsh](http://www.adammmarsh.com) and, with his help, we set about designing the new themes.\n\n{% include figure.html class=\"pull-both\" set=\"team\" %}\n\nI'm really proud of the hard work the entire team put in creating the new themes. This is just the start, we're planning a number of upgrades to these themes as well as several new themes in the coming months. \n\nYou can see all the Firefly themes at [themes.fireflylearning.com](http://themes.fireflylearning.com).","html_body":"<p>Over the last couple of months Firefly’s design team have been even busier than usual. The reason for this flurry of activity was three new themes we’d be working for the big launch at the Firefly Learning Conference.</p>\n<p>There’s a <a href=\"http://fireflylearning.com/blog/firefly-learning-conference-round-up\">full writeup</a> on the Firefly blog, but I wanted to share a little about the process of creating the new themes that we hope will give students, teachers and parents an improved experience while using Firefly.</p>\n<p>Since the launch of Firefly 5 last year, we’ve learnt a lot from our clients about what worked for them and what didn’t.  We’ve also worked with some fantastic schools, creating bespoke themes, which gave us a wealth of ideas of the features students and teachers really want.</p>\n<p>Using this feedback, we were able to distill a clear list of the <em>type</em> of themes schools wanted, along with the customisation options that would appeal. We determined to build three new themes: One a playful, friendly theme; Another, clean and succinct; Lastly, a super minimalist theme.</p>\n<p>When I joined, just over three years ago, Firefly were five people crammed into a small office hidden away in a dark corner of One Lyric Square. The design department consisted of me and a pack of half empty Sharpies. Today we’re a forty strong team, with three (soon to be four) designers, with our own office in sunny Brighton. Over the summer holidays we were joined by intern <a href=\"http://www.adammmarsh.com\">Adam Marsh</a> and, with his help, we set about designing the new themes.</p>\n<p>{% include figure.html class=”pull-both” set=”team” %}</p>\n<p>I’m really proud of the hard work the entire team put in creating the new themes. This is just the start, we’re planning a number of upgrades to these themes as well as several new themes in the coming months. </p>\n<p>You can see all the Firefly themes at <a href=\"http://themes.fireflylearning.com\">themes.fireflylearning.com</a>.</p>\n","html_snippet":{"s":"<p>Over the last couple of months Firefly’s design team have been even busier than usual. The reason for this flurry of activity was three new themes we’d be working for the big launch at the Firefly Learning...</p>","orig":"<p>Over the last couple of months Firefly’s design team have been even busier than usual. The reason for this flurry of activity was three new themes we’d be working for the big launch at the Firefly Learning...</p>","length":215}},{"attributes":{"date":"2014-10-24T00:00:00.000Z","title":"A brand new Roo","section":"diary","tags":["family"],"cover":"/assets/blog/covers/2048.jpg","images":[{"image":"2048.jpg","caption":"Katie, growing a brand new roo.","set":"the_kid"}],"introduction":"I'm excited and emotional. What's got me into such a tizzy you ask? Well, a few weeks ago Katie and I discovered we we're going to have a baby. A brand new Roo, if you will.","id":"45","type":"diary"},"body":"I'm excited and emotional. What's got me into such a tizzy you ask? Well, a few weeks ago Katie and I discovered we we're going to have a baby. A brand new Roo, if you will.\n\n{% include figure.html class=\"pull-both\" set=\"the_kid\" %}\n\nHow did this little chap (or chapesses) come about? That my friends is a mystery, but suffice to say that Katie tells me that getting a small person to live inside you is quite an involved process requiring me to provide lots of chocolate because \"Baby needs chocolate\".\n\nWhoever you are, if you're reading this — perhaps years later at the behest of a therapist — know this; I love you. I'm not sure how, why or if it's madness to love a smudge on the screen of a hospital scanner, but I do. Just the thought of you is enough to reduce me to tears of joy. Goodness knows what I'll be like when you're actually born.\n\nOne of the brilliant things about living in Britain is the NHS. They ensure that all of your bits and bobs are growing in the right places via the technological marvel of ultrasound. We were able to see you, and hear your heart beat, which is apparently a very health 157 bpm. \n\nParents were suitably delighted, siblings overjoyed and friends a chorus of coos and congratulations. Those friends with children exchange knowing glances and delight in regaling us with their tails of woe.\n\n\"Remember that night\" said one friend to his wife, \"when you were changing him in the middle of the night and I woke up to see a stream of hot lava squirt across the room and onto the wall?\". She laughs. He laughs. We all laugh, oh _how_ we laugh. \n\nSo it's with a mixture of excitement and fear that I share this wondrous news. If you're wondering what to buy me for Christmas then can I suggest a plastic apron and a gas-mask?","html_body":"<p>I’m excited and emotional. What’s got me into such a tizzy you ask? Well, a few weeks ago Katie and I discovered we we’re going to have a baby. A brand new Roo, if you will.</p>\n<p>{% include figure.html class=”pull-both” set=”the_kid” %}</p>\n<p>How did this little chap (or chapesses) come about? That my friends is a mystery, but suffice to say that Katie tells me that getting a small person to live inside you is quite an involved process requiring me to provide lots of chocolate because “Baby needs chocolate”.</p>\n<p>Whoever you are, if you’re reading this — perhaps years later at the behest of a therapist — know this; I love you. I’m not sure how, why or if it’s madness to love a smudge on the screen of a hospital scanner, but I do. Just the thought of you is enough to reduce me to tears of joy. Goodness knows what I’ll be like when you’re actually born.</p>\n<p>One of the brilliant things about living in Britain is the NHS. They ensure that all of your bits and bobs are growing in the right places via the technological marvel of ultrasound. We were able to see you, and hear your heart beat, which is apparently a very health 157 bpm. </p>\n<p>Parents were suitably delighted, siblings overjoyed and friends a chorus of coos and congratulations. Those friends with children exchange knowing glances and delight in regaling us with their tails of woe.</p>\n<p>“Remember that night” said one friend to his wife, “when you were changing him in the middle of the night and I woke up to see a stream of hot lava squirt across the room and onto the wall?”. She laughs. He laughs. We all laugh, oh <em>how</em> we laugh. </p>\n<p>So it’s with a mixture of excitement and fear that I share this wondrous news. If you’re wondering what to buy me for Christmas then can I suggest a plastic apron and a gas-mask?</p>\n","html_snippet":{"s":"<p>I’m excited and emotional. What’s got me into such a tizzy you ask? Well, a few weeks ago Katie and I discovered we we’re going to have a baby. A brand new Roo, if you will.</p><p>{% include figure.html class=”pull-both”...</p>","orig":"<p>I’m excited and emotional. What’s got me into such a tizzy you ask? Well, a few weeks ago Katie and I discovered we we’re going to have a baby. A brand new Roo, if you will.</p><p>{% include figure.html class=”pull-both”...</p>","length":230}},{"attributes":{"date":"2014-08-04T00:00:00.000Z","title":"Rabbit Towers","images":[{"image":"rabs.jpg","caption":"Rabbits","set":"rabs"},{"image":"rabs2.jpg","caption":"Rabbits In their hutch","set":"rabs"},{"image":"rabs3.jpg","caption":"Molly","set":"rabs"},{"image":"building_the_runs_1.jpg","caption":"Laying the foundations","set":"building"},{"image":"building_the_runs_4.jpg","caption":"Building the ramp-box","set":"building"},{"image":"inside_the_hutch.jpg","caption":"Inside the top hutche","set":"building"},{"image":"building_the_runs_5.jpg","caption":"Ramp-box in place with roof fitted","set":"building"},{"image":"building_the_runs_6.jpg","caption":"Completed","set":"building"},{"image":"building_the_runs_7.jpg","caption":"Bella's first decent","set":"building"},{"image":"building_the_runs_8.jpg","caption":"Oi nosey","set":"building"}],"tags":["home","projects"],"cover":"/assets/blog/covers/rabs2.jpg","section":"diary","id":"44","type":"diary"},"body":"It must be something many newly married couples do; Put off the children in favour of a pet. As it was with us, 3 years ago, when we arrived home with a cardboard box containing two small, very frightened rabbits.\n\nThey soon settled in and set about crapping in every corner and chewing all the wires, including clean though the power cable for my brand new Apple laptop. I think they lasted a whole week as house rabbits before we moved them outside to more suitable accommodation.\n\n{% include gallery.html class=\"pull-both\" set=\"rabs\" %}\n\nAs they got older, they grew to hate each other. This was funny at first, watching them hump each-other in a bid for dominance, but pretty soon this turned into some really nasty fights. The lack of rabbit psychologists in the local area meant there was nothing else for it but separate hutches and a time-share of the family run.\n\nIt's now evident that they've been the perfect focus for my hobby of \"building shit in the garden\", as Katie puts it. There is a singular pleasure in picturing something in your head, then knocking a few nails through a few bits of wood and seeing it all 3D like in real-reality.\n\nToday, they've upscaled to a bunny des rez in the shed.  These are large hutches, one stacked on the other. They each have connecting tunnels to the outside, the bottom one leading, via a section of tube, to a run in the garden. The top to a ramp-box which allows a rab to descend into another run.\n\n{% include gallery.html class=\"pull-both\" set=\"building\" %}\n\nOf course they still get a bounce around the garden when we're around to watch them, but it's nice knowing they have access to some outside space and a few toys while we're out at work. \n\nWith the summer coming up I had the idea to fit a warm-air extraction system in the shed — powered by a 12V battery, charged by a solar panel — but we'll wait and see about that one...","html_body":"<p>It must be something many newly married couples do; Put off the children in favour of a pet. As it was with us, 3 years ago, when we arrived home with a cardboard box containing two small, very frightened rabbits.</p>\n<p>They soon settled in and set about crapping in every corner and chewing all the wires, including clean though the power cable for my brand new Apple laptop. I think they lasted a whole week as house rabbits before we moved them outside to more suitable accommodation.</p>\n<p>{% include gallery.html class=”pull-both” set=”rabs” %}</p>\n<p>As they got older, they grew to hate each other. This was funny at first, watching them hump each-other in a bid for dominance, but pretty soon this turned into some really nasty fights. The lack of rabbit psychologists in the local area meant there was nothing else for it but separate hutches and a time-share of the family run.</p>\n<p>It’s now evident that they’ve been the perfect focus for my hobby of “building shit in the garden”, as Katie puts it. There is a singular pleasure in picturing something in your head, then knocking a few nails through a few bits of wood and seeing it all 3D like in real-reality.</p>\n<p>Today, they’ve upscaled to a bunny des rez in the shed.  These are large hutches, one stacked on the other. They each have connecting tunnels to the outside, the bottom one leading, via a section of tube, to a run in the garden. The top to a ramp-box which allows a rab to descend into another run.</p>\n<p>{% include gallery.html class=”pull-both” set=”building” %}</p>\n<p>Of course they still get a bounce around the garden when we’re around to watch them, but it’s nice knowing they have access to some outside space and a few toys while we’re out at work. </p>\n<p>With the summer coming up I had the idea to fit a warm-air extraction system in the shed — powered by a 12V battery, charged by a solar panel — but we’ll wait and see about that one…</p>\n","html_snippet":{"s":"<p>It must be something many newly married couples do; Put off the children in favour of a pet. As it was with us, 3 years ago, when we arrived home with a cardboard box containing two small, very frightened...</p>","orig":"<p>It must be something many newly married couples do; Put off the children in favour of a pet. As it was with us, 3 years ago, when we arrived home with a cardboard box containing two small, very frightened...</p>","length":214}},{"attributes":{"date":"2013-09-22T00:00:00.000Z","title":"European Adventure Week Three","images":[{"image":"boat-on-lake-magorie.jpg","caption":"Beautiful Lake Magorie, Switzerland","set":"lake-magorie"},{"image":"lacarno-square-20150724101128.jpg","caption":"Lacarno Square","set":"lacarno-square"},{"image":"verzasca-20150724101526.jpg","caption":"The dizzying heights at Verzasca Dam","set":"verzasca"},{"image":"trendcamping-20150724101706.jpg","caption":"Archie at Trendcamping, Germany","set":"trendcamping"},{"image":"wolfach-2-20150724101906.jpg","caption":"Wolfach","set":"wolfach"},{"image":"wolfach-20150724101934.jpg","caption":"Wolfach","set":"wolfach"},{"image":"iledefaigneul-20150724102041.jpg","caption":"Camping Ile de Faigneul","set":"faigneul"},{"image":"calais-20150724102134.jpg","caption":"Katie at Calais Eurotunnel on our last day","set":"calis"}],"cover":"/assets/blog/covers/boat-on-lake-magorie.jpg","introduction":"Our final week, a last hurrah, and a dash across Switzerland, Germany, Belgium and France.","tags":["holiday","europe","campervan"],"related_gallery":["/gallery/europe-2013-switzerland-germany-and-belgium"],"id":"43","type":"diary"},"body":"Our final week, a last hurrah, and a dash across Switzerland, Germany, Belgium and France.\n\nIt was the briefest of interludes into Switzerland, still, in this country at least we managed to abide by the law and buy a Vignette at the border. \n\nOur destination was a campsite not far from the northern lake town of [Lacarno](http://en.wikipedia.org/wiki/Locarno). After the damp squib that was our final day in Italy, the well-appointed campsite [Lido Mappo](http://www.lidomappo.ch) was most welcome. And, what luck! A break in the weather which allowed Katie and I to get our tent up and once again double our living space. That evening we paid a brief (but expensive) visit to the campsite bar, then cooked-up a pasta-storm back at chez-Roobottom.\n\nWe awoke on Tuesday to beautiful sunshine. Using a combination of extremely poor Italian and much better English (on the part of the campsite staff) we'd established the the thing to do 'round these parts was to take the air with a brisk walk into Lacarno. \n\nBeing near the border Lacarno has brilliant mixture of Italian Joie de vivre and Swiss preciseness, that for us *slightly* obsessive compulsive types, is infinitely appearing. We ate pizza in the square before hiking up the many almost vertical side-streets to explore. \n\n{% include figure.html class=\"pull-both\" set=\"lacarno-square\" %}\n\nI think the most abiding memory of this place is the view over the lake. I don't really think there's anything to separate this place from Lake Garda, it's just different, but equally beautiful. I managed to get some pictures that *almost* capture some small part of it's beauty. I imagine it's hard to communicate the feeling you associate with a place through pictures or words alone. It's probably why those that do are few and far between. I'm certainly not counting myself there, if you were wondering.\n\n{% include figure.html class=\"pull-both\" set=\"lake-magorie\" %}\n\nIn the afternoon we took the camper up the mountain to the Verzasca Dam where apparently, if you're so inclined, you can do a [220m bungee jump](http://www.trekking.ch/en/bungy/007-bungy-jumping-verzasca-like-james-bond) just like James Bond in Goldeneye. As we weren't feeling *that* adventurous we made do with scaring ourselves by gawping over the fence at the dizzying drop. Why, after seeing that, you'd want to tie a piece of elastic around your legs and jump off I really couldn't guess. \n\n{% include figure.html class=\"pull-both\" set=\"verzasca\" %}\n\nOn Wednesday we moved on to Germany, exited for our next adventure, but with the glimpse of the heavy heart that always accompanies a return to reality after a spectacular holiday. And spectacular this holiday has certainly been. It seems surreal at this point we've already driven nearly 2,000 miles. Pat on the head, van, for not letting us down — Thank goodness we didn't buy a VW.\n\nIt's a sign of how far north we now were that we saw the first British numberplate for almost two weeks. Then another, and another. By the time we arrived at [Trend Camping](http://www.trendcamping.de) we were surrounded by the buggers. \n\n{% include figure.html class=\"pull-both\" set=\"trendcamping\" %}\t\n\nThe campsite had a rather nice bar which severed traditional German fare and local ales. So, despite the mud, it got the thumbs up from us. Especially when we discovered the huge power-showers, with massaging side-jets and everything. Luxury.\n\nOn Thursday we used the free bus and train pass that the campsite provided to visit the nearby [Wolfach](http://en.wikipedia.org/wiki/Wolfach), a jolly little place that was once the hub of log-rafting and home to the pom-pom hat.\t\n\nThe center of the town is lovely, with cobbled streets and shops full of delicious looking things. It's surrounded by glorious grassy hills and meadows, the kind you might imagine yourself running through into the arms of a Bavarian maiden. If you were so inclined. \n\n{% include gallery.html class=\"pull-both\" set=\"wolfach\" %}\n\nAnd then it was Friday. Only two days left of our holiday. How did that happen? Oh well, we thought, nothing for it but to spend some time in Belgium.\n\nWhat an amazing find for our last night. [Camping Ile de Faigneul](http://www.iledefaigneul.com) is a site on it's own island in the middle of a river. We'd have loved to spend more time in this tranquil place, but alas this was just an overnight stop on our way to Calais, the tunnel and home.\n\n{% include figure.html class=\"pull-both\" set=\"faigneul\" %}\n\t\nWe spent that last night as we did some many others, eating pasta, playing cards and watching Mad Men. \n\nSo it was with heavy hearts that we made our way thorough France to the Eurotunnel. We just had time to shop in the insanely large supermarket complex in Calais before boarding our train back to normality.\n\n{% include figure.html class=\"pull-both\" set=\"calis\" %}\n\nThat was it then. The end of a fantastic adventure that was entirely too short. It got dark at some point while were under the sea. Emerging onto cold, damp British soil we felt ready for a bed that wasn't *slightly* too short. Home then. We'll see you next time Europe, next time.","html_body":"<p>Our final week, a last hurrah, and a dash across Switzerland, Germany, Belgium and France.</p>\n<p>It was the briefest of interludes into Switzerland, still, in this country at least we managed to abide by the law and buy a Vignette at the border. </p>\n<p>Our destination was a campsite not far from the northern lake town of <a href=\"http://en.wikipedia.org/wiki/Locarno\">Lacarno</a>. After the damp squib that was our final day in Italy, the well-appointed campsite <a href=\"http://www.lidomappo.ch\">Lido Mappo</a> was most welcome. And, what luck! A break in the weather which allowed Katie and I to get our tent up and once again double our living space. That evening we paid a brief (but expensive) visit to the campsite bar, then cooked-up a pasta-storm back at chez-Roobottom.</p>\n<p>We awoke on Tuesday to beautiful sunshine. Using a combination of extremely poor Italian and much better English (on the part of the campsite staff) we’d established the the thing to do ‘round these parts was to take the air with a brisk walk into Lacarno. </p>\n<p>Being near the border Lacarno has brilliant mixture of Italian Joie de vivre and Swiss preciseness, that for us <em>slightly</em> obsessive compulsive types, is infinitely appearing. We ate pizza in the square before hiking up the many almost vertical side-streets to explore. </p>\n<p>{% include figure.html class=”pull-both” set=”lacarno-square” %}</p>\n<p>I think the most abiding memory of this place is the view over the lake. I don’t really think there’s anything to separate this place from Lake Garda, it’s just different, but equally beautiful. I managed to get some pictures that <em>almost</em> capture some small part of it’s beauty. I imagine it’s hard to communicate the feeling you associate with a place through pictures or words alone. It’s probably why those that do are few and far between. I’m certainly not counting myself there, if you were wondering.</p>\n<p>{% include figure.html class=”pull-both” set=”lake-magorie” %}</p>\n<p>In the afternoon we took the camper up the mountain to the Verzasca Dam where apparently, if you’re so inclined, you can do a <a href=\"http://www.trekking.ch/en/bungy/007-bungy-jumping-verzasca-like-james-bond\">220m bungee jump</a> just like James Bond in Goldeneye. As we weren’t feeling <em>that</em> adventurous we made do with scaring ourselves by gawping over the fence at the dizzying drop. Why, after seeing that, you’d want to tie a piece of elastic around your legs and jump off I really couldn’t guess. </p>\n<p>{% include figure.html class=”pull-both” set=”verzasca” %}</p>\n<p>On Wednesday we moved on to Germany, exited for our next adventure, but with the glimpse of the heavy heart that always accompanies a return to reality after a spectacular holiday. And spectacular this holiday has certainly been. It seems surreal at this point we’ve already driven nearly 2,000 miles. Pat on the head, van, for not letting us down — Thank goodness we didn’t buy a VW.</p>\n<p>It’s a sign of how far north we now were that we saw the first British numberplate for almost two weeks. Then another, and another. By the time we arrived at <a href=\"http://www.trendcamping.de\">Trend Camping</a> we were surrounded by the buggers. </p>\n<p>{% include figure.html class=”pull-both” set=”trendcamping” %}    </p>\n<p>The campsite had a rather nice bar which severed traditional German fare and local ales. So, despite the mud, it got the thumbs up from us. Especially when we discovered the huge power-showers, with massaging side-jets and everything. Luxury.</p>\n<p>On Thursday we used the free bus and train pass that the campsite provided to visit the nearby <a href=\"http://en.wikipedia.org/wiki/Wolfach\">Wolfach</a>, a jolly little place that was once the hub of log-rafting and home to the pom-pom hat.    </p>\n<p>The center of the town is lovely, with cobbled streets and shops full of delicious looking things. It’s surrounded by glorious grassy hills and meadows, the kind you might imagine yourself running through into the arms of a Bavarian maiden. If you were so inclined. </p>\n<p>{% include gallery.html class=”pull-both” set=”wolfach” %}</p>\n<p>And then it was Friday. Only two days left of our holiday. How did that happen? Oh well, we thought, nothing for it but to spend some time in Belgium.</p>\n<p>What an amazing find for our last night. <a href=\"http://www.iledefaigneul.com\">Camping Ile de Faigneul</a> is a site on it’s own island in the middle of a river. We’d have loved to spend more time in this tranquil place, but alas this was just an overnight stop on our way to Calais, the tunnel and home.</p>\n<p>{% include figure.html class=”pull-both” set=”faigneul” %}</p>\n<p>We spent that last night as we did some many others, eating pasta, playing cards and watching Mad Men. </p>\n<p>So it was with heavy hearts that we made our way thorough France to the Eurotunnel. We just had time to shop in the insanely large supermarket complex in Calais before boarding our train back to normality.</p>\n<p>{% include figure.html class=”pull-both” set=”calis” %}</p>\n<p>That was it then. The end of a fantastic adventure that was entirely too short. It got dark at some point while were under the sea. Emerging onto cold, damp British soil we felt ready for a bed that wasn’t <em>slightly</em> too short. Home then. We’ll see you next time Europe, next time.</p>\n","html_snippet":{"s":"<p>Our final week, a last hurrah, and a dash across Switzerland, Germany, Belgium and France.</p><p>It was the briefest of interludes into Switzerland, still, in this country at least we managed to abide by the...</p>","orig":"<p>Our final week, a last hurrah, and a dash across Switzerland, Germany, Belgium and France.</p><p>It was the briefest of interludes into Switzerland, still, in this country at least we managed to abide by the...</p>","length":217}},{"attributes":{"date":"2013-09-15T00:00:00.000Z","title":"European Adventure Week Two","section":"diary","cover":"/assets/blog/covers/sunset.jpg","images":[{"image":"02.jpg","caption":"Torbole","set":"torbole"},{"image":"pool.jpg","caption":"Katie in the hotel pool","set":"hotel"},{"image":"hotel.jpg","caption":"Our Hotel","set":"hotel"},{"image":"sunset-20150103120523.jpg","caption":"Sunset in Sirmione","set":"sirmione"},{"image":"lazise-site.jpg","caption":"Hi-de-hi campers","set":"lazisesite"}],"introduction":"Our journey continued this week as we ventured across the Alps into Italy.","tags":["campervan","holiday"],"related_gallery":["/gallery/europe-2013-italy"],"id":"42","type":"diary"},"body":"Our journey continued this week as we ventured across the Alps into Italy.\n\nI'm sitting in the shade of a tree, providing some protection from the blazing mid-afternoon sun. Headphones in, I'm listening to Fink's “Sort of Revolution” extremely loud and enjoying an ice-cold beer. I lean my head back, and close my eyes against the sun as it dapples through the leaves above me. In the distance are the mountains that circle Lake Garda. Sparse clouds are suspended, seemingly motionless over the azure blue waters. Fuelled by the warmth of the sun, the melodic beat of the music and the haze from the alcohol I feel an almost zen-like sense of well-being. \"This is perfect\" I thought. \n\nIn contrast to week one, when we'd travelled through five countries, we decided to slow the pace a little. After an epic drive our first stop was the Northern lake town of [Torbole](http://en.wikipedia.org/wiki/Nago–Torbole), the windsurfers paradise, and [Camping Al Porto](http://www.campingalporto.it/camp/). It felt Newquay-esq where board-shorts seemed to be the must-have fashion item of the season. The campsite was rather busier than those we’d been used to, but we managed to fit our van and awning on a shaded pitch thirty-seconds walk from the lake.\n\n{% include figure.html class=\"pull-both\" set=\"torbole\" %}\n\nOn the occasion of our first night in Italy, we did what we have the last two trips here: Find the most touristy looking restaurant and order the biggest pizza they have and a glass of the local beer. In this case it was [Forst](http://www.forst.it/eng), brewed “just up the road” we were told. \n\nThe next day we had ideas of taking windsurfing lesson but the wind didn't seem to want to blow. It was probably too hot, so like us it decided to spend the day sunbathing and exploring the town. We also finally got the BBQ to work despite the crappy “just light the bag” charcoal, thanks to some German firelighters that almost took my face off. \n\nIt was at this point we cheated a little by spending a few nights in a hotel south of the lake in [Desenzano del Garda](http://en.wikipedia.org/wiki/Desenzano_del_Garda). \"You know\" said Katie \"I'm loving being able to get out of the shower and being able to keep my feet dry.\" I knew what she meant. I'm not proud to admit it but we really did wallow in the luxurious of it all. \n\n{% include gallery.html class=\"pull-both\" set=\"hotel\" %}\n\nPeeling ourselves away from the hotel pool we ventured down the road to [Sirmione](http://en.wikipedia.org/wiki/Sirmione). Navigating the spit of land that forms a sort of natural pier into the centre of the southern bank of the lake — we parked and ventured over the bridge into down-town Sirmione. Here we indulged our inner tourist once again by eating gelato and watching the sunset. \n\n{% include figure.html class=\"pull-both\" set=\"sirmione\" %}\n\nHaving made a large dent in our holiday funds we checked out of the hotel and moved north around the lake to [Lazise](http://en.wikipedia.org/wiki/Lazise). Here we encountered the full glory of the Italian campsite. When you're a good few kilometres from the centre on the main road you start to notice the signs. At first a just few, then more with increasing ferocity until they line the bank of the lake one after the other. You're not, as we discovered, just expected to pick one and check-in. We spent an interesting couple of hours driving from site to site inspecting toilet blocks, pools, children's entertainment and on-site bars before we finally gave in and just picked one.\n\n{% include figure.html class=\"pull-both\" set=\"lazisesite\" %}\n\nHere we stayed and for four glorious days enjoyed the private beach and exploring the beautiful town. We swam, snorkelled and sunbathed. Ate gelato, pizza and even brought a fridge-magnet. No messing about, this was a proper holiday.\n\nAlas, it was time to move on. Switzerland and our final week beaconed. We have a week left and just over two-thousand kilometres back to the Euro-tunnel at Calais.\n\nTo be continued…","html_body":"<p>Our journey continued this week as we ventured across the Alps into Italy.</p>\n<p>I’m sitting in the shade of a tree, providing some protection from the blazing mid-afternoon sun. Headphones in, I’m listening to Fink’s “Sort of Revolution” extremely loud and enjoying an ice-cold beer. I lean my head back, and close my eyes against the sun as it dapples through the leaves above me. In the distance are the mountains that circle Lake Garda. Sparse clouds are suspended, seemingly motionless over the azure blue waters. Fuelled by the warmth of the sun, the melodic beat of the music and the haze from the alcohol I feel an almost zen-like sense of well-being. “This is perfect” I thought. </p>\n<p>In contrast to week one, when we’d travelled through five countries, we decided to slow the pace a little. After an epic drive our first stop was the Northern lake town of <a href=\"http://en.wikipedia.org/wiki/Nago–Torbole\">Torbole</a>, the windsurfers paradise, and <a href=\"http://www.campingalporto.it/camp/\">Camping Al Porto</a>. It felt Newquay-esq where board-shorts seemed to be the must-have fashion item of the season. The campsite was rather busier than those we’d been used to, but we managed to fit our van and awning on a shaded pitch thirty-seconds walk from the lake.</p>\n<p>{% include figure.html class=”pull-both” set=”torbole” %}</p>\n<p>On the occasion of our first night in Italy, we did what we have the last two trips here: Find the most touristy looking restaurant and order the biggest pizza they have and a glass of the local beer. In this case it was <a href=\"http://www.forst.it/eng\">Forst</a>, brewed “just up the road” we were told. </p>\n<p>The next day we had ideas of taking windsurfing lesson but the wind didn’t seem to want to blow. It was probably too hot, so like us it decided to spend the day sunbathing and exploring the town. We also finally got the BBQ to work despite the crappy “just light the bag” charcoal, thanks to some German firelighters that almost took my face off. </p>\n<p>It was at this point we cheated a little by spending a few nights in a hotel south of the lake in <a href=\"http://en.wikipedia.org/wiki/Desenzano_del_Garda\">Desenzano del Garda</a>. “You know” said Katie “I’m loving being able to get out of the shower and being able to keep my feet dry.” I knew what she meant. I’m not proud to admit it but we really did wallow in the luxurious of it all. </p>\n<p>{% include gallery.html class=”pull-both” set=”hotel” %}</p>\n<p>Peeling ourselves away from the hotel pool we ventured down the road to <a href=\"http://en.wikipedia.org/wiki/Sirmione\">Sirmione</a>. Navigating the spit of land that forms a sort of natural pier into the centre of the southern bank of the lake — we parked and ventured over the bridge into down-town Sirmione. Here we indulged our inner tourist once again by eating gelato and watching the sunset. </p>\n<p>{% include figure.html class=”pull-both” set=”sirmione” %}</p>\n<p>Having made a large dent in our holiday funds we checked out of the hotel and moved north around the lake to <a href=\"http://en.wikipedia.org/wiki/Lazise\">Lazise</a>. Here we encountered the full glory of the Italian campsite. When you’re a good few kilometres from the centre on the main road you start to notice the signs. At first a just few, then more with increasing ferocity until they line the bank of the lake one after the other. You’re not, as we discovered, just expected to pick one and check-in. We spent an interesting couple of hours driving from site to site inspecting toilet blocks, pools, children’s entertainment and on-site bars before we finally gave in and just picked one.</p>\n<p>{% include figure.html class=”pull-both” set=”lazisesite” %}</p>\n<p>Here we stayed and for four glorious days enjoyed the private beach and exploring the beautiful town. We swam, snorkelled and sunbathed. Ate gelato, pizza and even brought a fridge-magnet. No messing about, this was a proper holiday.</p>\n<p>Alas, it was time to move on. Switzerland and our final week beaconed. We have a week left and just over two-thousand kilometres back to the Euro-tunnel at Calais.</p>\n<p>To be continued…</p>\n","html_snippet":{"s":"<p>Our journey continued this week as we ventured across the Alps into Italy.</p><p>I’m sitting in the shade of a tree, providing some protection from the blazing mid-afternoon sun. Headphones in, I’m listening...</p>","orig":"<p>Our journey continued this week as we ventured across the Alps into Italy.</p><p>I’m sitting in the shade of a tree, providing some protection from the blazing mid-afternoon sun. Headphones in, I’m listening...</p>","length":217}},{"attributes":{"date":"2013-09-07T00:00:00.000Z","title":"European Adventure Week One","section":"diary","introduction":"Being of noble birth Katie and I are taking in the sights of Europe on a three week grand tour","tags":["campervan","holiday"],"cover":"/assets/blog/covers/01-20150102233740.jpg","images":[{"image":"01-20150102233753.jpg","caption":"Driving over the Alps","set":"alps"},{"image":"france.jpg","caption":"Our first night at Camping des Bruyeres","set":"france"},{"image":"adam-night.jpg","caption":"The view from our van at Campingplatz Adam","set":"adam"},{"image":"baden_lunch.jpg","caption":"Lunch in Baden-Baden","set":"baden"},{"image":"salzburg.jpg","caption":"Downtown Salzburg","set":"salzburg"},{"image":"pavilion.jpg","caption":"Katie outside the \"Sixteen Going on Seventeen\" pavilion","set":"pavilion"}],"id":"41","type":"diary"},"body":"Being of noble birth Katie and I are taking in the sights of Europe on a three week grand tour.\n\nHowever, having a chequebook that is of more moderate means we decided to conduct our trip in our campervan. \n\nAs I write this, we are driving from Salzburg to Lake Garda through the Alps. The scenery is breathtaking and a road sign tells me it's  27 degrees, perfect driving weather, if our air con still worked.  \n\n{% include figure.html class=\"pull-both\" set=\"alps\" %}\n\nAt this point we've covered 1,703 km and aside from a little smoke up some of the steeper sections of motorway our van is performing well. From our home in the south of England we took the tunnel from Dover to Calais, then to an overnight stop in northern France at [Saint-Amanda-les-eaux](http://www.campingmontdesbruyeres.com/english/).\n\n{% include figure.html class=\"pull-both\" set=\"france\" %}\n\nTo be honest, it wasn't the most spectacular campsite, but it was clean and spent a very pleasant evening drinking beer and watching some men playing boules, one of whom looked suspiciously like Paul Whitehouse. \n\nFeeling bolstered by our success driving on the other side of the road, we decided to head for Baden-Baden and [Camplingplatz Adam](http://www.campingplatz-adam.de/) the next day; a distance of just over 600km. Actually, the drive turned out to be pretty straight-forward aside from one incident when we somehow missed the road closed signs and found ourselves driving over freshly prepared gravel, workmen shaking their heads in disbelief as we passed. \n\n{% include figure.html class=\"pull-both\" set=\"adam\" %}\n\nWe stayed in the beautiful campgrounds for three days, swimming in the lake and generally not doing much of anything. On the second day we managed to peel ourselves away and drove into Baden-Baden, where we partook of some very European things like eating outside and strolling along the promenade. Our Britishness didn't like that very much and forced us onto the Dotto train so we'd feel more like tourists again. Phew. \n\n{% include figure.html class=\"pull-both\" set=\"baden\" %}\n\nSad as we were to leave, Salzburg beckoned, so we packed up the van and set off. This was another sweaty drive along Euro-route 52. Six hours later we were lost in the city. In situations like this Katie stays calm and I tend to overreact (a little). Ahem. Anyway, luckily on this occasion Katie was behind the wheel and did a sterling job of navigating the 5pm traffic until we _finally_ reached [Panorama Camping](http://www.panorama-camping.at/cms/index.php?lang=en). \n\nWow, what a site! Brilliant views and with WC and show blocks that wouldn't have been out of place in a five-star hotel. It's also here that I first discovered the local brew, Stiegl. \n\nThe next day (despite *really* enjoying the beer) we made an early start into Salzburg. I'd once been here on a school trip but the only thing I remember with any clarity was the McDonalds. Katie kept insisting that the hills were alive with the sound of music, but I wasn't sure what she meant by this. \n\nArriving by bus into Mozartsteg we made our way through the square, past the stalls selling Bavarian hats and up the hill to the fortress Hohensalzburg. After exploring for a bit we sat, pretzel and beer in hand, admiring the stunning view over the mountains. \n\n{% include figure.html class=\"pull-both\" set=\"salzburg\" %}\n\nNext, I discovered a little more about those musical hills with a Sound of Music themed bus tour of the city. I secretly really enjoyed this ride around the sights of the city made (even more) famous by the film. We ended our day with a plate of Snitzel at the Stiegl brewery restaurant with (yup, you guessed it) a refreshing cold beer.\n\n{% include figure.html class=\"pull-both\" set=\"pavilion\" %}\n\nNext is Lake Garda, it's already hotter than Austria, so onto Italy! \n\nTo be continued...","html_body":"<p>Being of noble birth Katie and I are taking in the sights of Europe on a three week grand tour.</p>\n<p>However, having a chequebook that is of more moderate means we decided to conduct our trip in our campervan. </p>\n<p>As I write this, we are driving from Salzburg to Lake Garda through the Alps. The scenery is breathtaking and a road sign tells me it’s  27 degrees, perfect driving weather, if our air con still worked.  </p>\n<p>{% include figure.html class=”pull-both” set=”alps” %}</p>\n<p>At this point we’ve covered 1,703 km and aside from a little smoke up some of the steeper sections of motorway our van is performing well. From our home in the south of England we took the tunnel from Dover to Calais, then to an overnight stop in northern France at <a href=\"http://www.campingmontdesbruyeres.com/english/\">Saint-Amanda-les-eaux</a>.</p>\n<p>{% include figure.html class=”pull-both” set=”france” %}</p>\n<p>To be honest, it wasn’t the most spectacular campsite, but it was clean and spent a very pleasant evening drinking beer and watching some men playing boules, one of whom looked suspiciously like Paul Whitehouse. </p>\n<p>Feeling bolstered by our success driving on the other side of the road, we decided to head for Baden-Baden and <a href=\"http://www.campingplatz-adam.de/\">Camplingplatz Adam</a> the next day; a distance of just over 600km. Actually, the drive turned out to be pretty straight-forward aside from one incident when we somehow missed the road closed signs and found ourselves driving over freshly prepared gravel, workmen shaking their heads in disbelief as we passed. </p>\n<p>{% include figure.html class=”pull-both” set=”adam” %}</p>\n<p>We stayed in the beautiful campgrounds for three days, swimming in the lake and generally not doing much of anything. On the second day we managed to peel ourselves away and drove into Baden-Baden, where we partook of some very European things like eating outside and strolling along the promenade. Our Britishness didn’t like that very much and forced us onto the Dotto train so we’d feel more like tourists again. Phew. </p>\n<p>{% include figure.html class=”pull-both” set=”baden” %}</p>\n<p>Sad as we were to leave, Salzburg beckoned, so we packed up the van and set off. This was another sweaty drive along Euro-route 52. Six hours later we were lost in the city. In situations like this Katie stays calm and I tend to overreact (a little). Ahem. Anyway, luckily on this occasion Katie was behind the wheel and did a sterling job of navigating the 5pm traffic until we <em>finally</em> reached <a href=\"http://www.panorama-camping.at/cms/index.php?lang=en\">Panorama Camping</a>. </p>\n<p>Wow, what a site! Brilliant views and with WC and show blocks that wouldn’t have been out of place in a five-star hotel. It’s also here that I first discovered the local brew, Stiegl. </p>\n<p>The next day (despite <em>really</em> enjoying the beer) we made an early start into Salzburg. I’d once been here on a school trip but the only thing I remember with any clarity was the McDonalds. Katie kept insisting that the hills were alive with the sound of music, but I wasn’t sure what she meant by this. </p>\n<p>Arriving by bus into Mozartsteg we made our way through the square, past the stalls selling Bavarian hats and up the hill to the fortress Hohensalzburg. After exploring for a bit we sat, pretzel and beer in hand, admiring the stunning view over the mountains. </p>\n<p>{% include figure.html class=”pull-both” set=”salzburg” %}</p>\n<p>Next, I discovered a little more about those musical hills with a Sound of Music themed bus tour of the city. I secretly really enjoyed this ride around the sights of the city made (even more) famous by the film. We ended our day with a plate of Snitzel at the Stiegl brewery restaurant with (yup, you guessed it) a refreshing cold beer.</p>\n<p>{% include figure.html class=”pull-both” set=”pavilion” %}</p>\n<p>Next is Lake Garda, it’s already hotter than Austria, so onto Italy! </p>\n<p>To be continued…</p>\n","html_snippet":{"s":"<p>Being of noble birth Katie and I are taking in the sights of Europe on a three week grand tour.</p><p>However, having a chequebook that is of more moderate means we decided to conduct our trip in our campervan....</p>","orig":"<p>Being of noble birth Katie and I are taking in the sights of Europe on a three week grand tour.</p><p>However, having a chequebook that is of more moderate means we decided to conduct our trip in our campervan....</p>","length":220}},{"attributes":{"date":"2013-07-02T00:00:00.000Z","title":"Sigur Ros at the Eden Project","section":"diary","tags":["music","sigur-ros","campervan"],"cover":"/assets/blog/covers/sigur_ros_1.jpg","images":[{"image":"sigur_ros_1.jpg","caption":"Sigur Ros and their amazing light show","set":"sigur_1"},{"image":"sigur_ros_2.jpg","caption":"Eden's beautiful biomes at night","set":"sigur_2"}],"id":"40","type":"diary"},"body":"Katie and I are just back from a weekend in Cornwall with a few mates where we surfed, drank some [great beer](http://www.tributeale.co.uk/) and enjoyed the amazing Sigur Ros live at the Eden Project.\n\nSigur Ros were one of those bands that had somehow passed me by so when our friend Tim suggested that we book tickets to see them I went more for the promise of surf than interest in the music. \n\n{% include figure.html class=\"pull-both\" set=\"sigur_2\" %}\n\nWe'd been to the [Eden Project](http://www.edenproject.com/) a few years before and I was really exited to go back. It's a brilliant place, especially the rainforest biome which had really grown since our previous visit.\n\nAs a venue it really succeeds. It's a beautiful setting and the unique atmosphere really adds to the music. It's also really well run with helpful stewards a token system for drinks that means there's never a queue at the bar. Someone really know what they're doing.\n\nWe arrived late, just in time to grab a beer and some food and catch the start of [Daughter](http://www.ohdaughter.com/) who were great. They're really melodic and boy she can sing, well worth a watch if you get the chance.\n\nEden is built at the bottom of an old quarry; the walls of which now team with plant life. By the time Sigur Ros took to the stage it was dusk and strings of fairly lights twinkled in the tress. \n\nOn stage, smoke filled the space as the band and their 11-piece orchestra started their set. The full-width monitor displayed a bizarre array of images as we were treated to what I can only describe as a wall-of-sound the band had built in front of the stage. \n\n{% include figure.html class=\"pull-both\" set=\"sigur_1\" %}\n\nIt was perfect. The venue and the atmosphere just worked so well. The light show too was spectacular. Lasers and smoke galore. I don't mean to gush, but it really was one of the best gigs I'd ever been too. I was absolutely blown away by the band, his voice, the weird instruments and that sound. Oh, that brilliant sound.","html_body":"<p>Katie and I are just back from a weekend in Cornwall with a few mates where we surfed, drank some <a href=\"http://www.tributeale.co.uk/\">great beer</a> and enjoyed the amazing Sigur Ros live at the Eden Project.</p>\n<p>Sigur Ros were one of those bands that had somehow passed me by so when our friend Tim suggested that we book tickets to see them I went more for the promise of surf than interest in the music. </p>\n<p>{% include figure.html class=”pull-both” set=”sigur_2” %}</p>\n<p>We’d been to the <a href=\"http://www.edenproject.com/\">Eden Project</a> a few years before and I was really exited to go back. It’s a brilliant place, especially the rainforest biome which had really grown since our previous visit.</p>\n<p>As a venue it really succeeds. It’s a beautiful setting and the unique atmosphere really adds to the music. It’s also really well run with helpful stewards a token system for drinks that means there’s never a queue at the bar. Someone really know what they’re doing.</p>\n<p>We arrived late, just in time to grab a beer and some food and catch the start of <a href=\"http://www.ohdaughter.com/\">Daughter</a> who were great. They’re really melodic and boy she can sing, well worth a watch if you get the chance.</p>\n<p>Eden is built at the bottom of an old quarry; the walls of which now team with plant life. By the time Sigur Ros took to the stage it was dusk and strings of fairly lights twinkled in the tress. </p>\n<p>On stage, smoke filled the space as the band and their 11-piece orchestra started their set. The full-width monitor displayed a bizarre array of images as we were treated to what I can only describe as a wall-of-sound the band had built in front of the stage. </p>\n<p>{% include figure.html class=”pull-both” set=”sigur_1” %}</p>\n<p>It was perfect. The venue and the atmosphere just worked so well. The light show too was spectacular. Lasers and smoke galore. I don’t mean to gush, but it really was one of the best gigs I’d ever been too. I was absolutely blown away by the band, his voice, the weird instruments and that sound. Oh, that brilliant sound.</p>\n","html_snippet":{"s":"<p>Katie and I are just back from a weekend in Cornwall with a few mates where we surfed, drank some <a href=\"http://www.tributeale.co.uk/\">great beer</a> and enjoyed the amazing Sigur Ros live at the Eden Project.</p><p>Sigur Ros were one of those bands...</p>","orig":"<p>Katie and I are just back from a weekend in Cornwall with a few mates where we surfed, drank some <a href=\"http://www.tributeale.co.uk/\">great beer</a> and enjoyed the amazing Sigur Ros live at the Eden Project.</p><p>Sigur Ros were one of those bands...</p>","length":261}},{"attributes":{"date":"2013-06-01T00:00:00.000Z","title":"A New Website","section":"diary","tags":["website"],"images":[{"image":"book.jpg","caption":"Some early concepts for the roo logo ","set":"logo"}],"id":"39","type":"diary"},"body":"Back in 2001, while I was still in midst of a degree that didn't really teach me anything, I built the first version of roobottom.com on a crappy second-hand PC.\n\nOriginally a \"Flash playground\" (oh, weren't _those_ the days) I  redesigned and repurposed it into a blog around 2005. I'd also started freelancing, launching roodesign around the same time.\n\nThat was twelve years ago when I was slightly shorter in the tooth and smaller of belly and working for myself, eventually making the move down south, starting full-time in London. All this rather took up my time and thoughts of a personal web project went the same way as oh-so-many pies.\n\nBut a man can dream, and dream I did: first of a CSS3 wonderland with garish colours and effects galore. Then, deciding that blogs were entirely too much hassle, of a stark Neverland consisting purely of some witty paragraph of text and a few links to social networks I hated.\n\nEventually I went back to basics and fleshed out exactly what I wanted: Somewhere to write the occasional blog post, showcase my work and post my photographs.\n\n##Firm foundations\nI built my first website because it was fun. I then got a job making websites, again because it was enjoyable. I'm lucky that I get paid for what is essentially a hobby. I think that makes me a \"professional\" but the jury is still out on that one.\n\nSo *this* site should be the most fun of all, right? I decided to abandon any highfalutin design ideas and just stick to a few core principals that would allow me to grow this site organically.\n\nFirst was the logo. I'd been sketching some ideas around a typographic \"roo\" for a while. A kangaroo was also an obvious choice. The final result is the emblem you see at the top of this page. Not perfect by any means, but a good starting point. I'll no doubt change it as the site grows.\n\n{% include figure.html class=\"pull-both\" set=\"logo\" %}\n\nSecondly to start with core elements then work out from there. Creating a pleasant and easy-to-use website is key to this idea, but it's more than that. By letting the content do the work and keeping the design as subtle as possible I'm striving for (but probably rarely achieving) a browsing experience that feels effortless.\n\nI've chosen <a href=\"http://getkirby.com/\">Kirby</a> as my <abbr title=\"Content Management System\">CMS</abbr>, this has so far proven to be the perfect fit, allowing me to write content in the fantastic <a href=\"http://www.iawriter.com/\">iA Writer</a> using <a href=\"http://daringfireball.net/projects/markdown/\">Markdown</a> so I always start with uncluttered, unformatted text.\n\nAnd finally, stop procrastination and just launch the bloody thing! I've spent entirely too many late nights debugging css to wait any longer. It's a personal project that'll grow. So here it is, warts and all.","html_body":"<p>Back in 2001, while I was still in midst of a degree that didn’t really teach me anything, I built the first version of roobottom.com on a crappy second-hand PC.</p>\n<p>Originally a “Flash playground” (oh, weren’t <em>those</em> the days) I  redesigned and repurposed it into a blog around 2005. I’d also started freelancing, launching roodesign around the same time.</p>\n<p>That was twelve years ago when I was slightly shorter in the tooth and smaller of belly and working for myself, eventually making the move down south, starting full-time in London. All this rather took up my time and thoughts of a personal web project went the same way as oh-so-many pies.</p>\n<p>But a man can dream, and dream I did: first of a CSS3 wonderland with garish colours and effects galore. Then, deciding that blogs were entirely too much hassle, of a stark Neverland consisting purely of some witty paragraph of text and a few links to social networks I hated.</p>\n<p>Eventually I went back to basics and fleshed out exactly what I wanted: Somewhere to write the occasional blog post, showcase my work and post my photographs.</p>\n<p>##Firm foundations<br>I built my first website because it was fun. I then got a job making websites, again because it was enjoyable. I’m lucky that I get paid for what is essentially a hobby. I think that makes me a “professional” but the jury is still out on that one.</p>\n<p>So <em>this</em> site should be the most fun of all, right? I decided to abandon any highfalutin design ideas and just stick to a few core principals that would allow me to grow this site organically.</p>\n<p>First was the logo. I’d been sketching some ideas around a typographic “roo” for a while. A kangaroo was also an obvious choice. The final result is the emblem you see at the top of this page. Not perfect by any means, but a good starting point. I’ll no doubt change it as the site grows.</p>\n<p>{% include figure.html class=”pull-both” set=”logo” %}</p>\n<p>Secondly to start with core elements then work out from there. Creating a pleasant and easy-to-use website is key to this idea, but it’s more than that. By letting the content do the work and keeping the design as subtle as possible I’m striving for (but probably rarely achieving) a browsing experience that feels effortless.</p>\n<p>I’ve chosen <a href=\"http://getkirby.com/\">Kirby</a> as my <abbr title=\"Content Management System\">CMS</abbr>, this has so far proven to be the perfect fit, allowing me to write content in the fantastic <a href=\"http://www.iawriter.com/\">iA Writer</a> using <a href=\"http://daringfireball.net/projects/markdown/\">Markdown</a> so I always start with uncluttered, unformatted text.</p>\n<p>And finally, stop procrastination and just launch the bloody thing! I’ve spent entirely too many late nights debugging css to wait any longer. It’s a personal project that’ll grow. So here it is, warts and all.</p>\n","html_snippet":{"s":"<p>Back in 2001, while I was still in midst of a degree that didn’t really teach me anything, I built the first version of roobottom.com on a crappy second-hand PC.</p><p>Originally a “Flash playground” (oh, weren’t...</p>","orig":"<p>Back in 2001, while I was still in midst of a degree that didn’t really teach me anything, I built the first version of roobottom.com on a crappy second-hand PC.</p><p>Originally a “Flash playground” (oh, weren’t...</p>","length":222}},{"attributes":{"date":"2013-05-20T00:00:00.000Z","title":"Snowdonia Slateman Triathlon","section":"diary","tags":["triathlon"],"images":[{"image":"slateman_1.jpg","caption":"The very well organised transition","set":"slateman_1"},{"image":"slateman_2.jpg","caption":"Conquering champions","set":"slateman_2"},{"image":"slateman_3.jpg","caption":"The beautiful Llyn Padarn","set":"slateman_3"}],"cover":"","id":"38","type":"diary"},"body":"Yesterday I swam in a freezing-cold lake; rode my bike up a mountain pass; then ran around an old slate mine.\n\nWhen [Raz](http://twitter.com/imrazkhan) and [Matt](http://twitter.com/cleggmatt) suggested it last year it seemed like such a good idea; they'd just seen the 2012 Slateman on TV and were raring to go. After some gental persuasion I reluctantly agreed to the shorter sprint distance of 400m swim, 20km cycle and a 6km run.\n\nIn the end neither Raz or Matt could make the race due to reasons undisclosed. Luckily my friend Christian was entered for the full distance, so we packed up the van, banged on the tunes and made the 6 hour trek up to Wales.\n\n{% include figure.html class=\"pull-both\" set=\"slateman_3\" %}\n\nRace day dawned and we made our weary way from our campsite to the lake ready for the briefing. The sun was just starting to clear away the early-morning clouds as we wheeled our bikes into Transition. I laid out my kit the best I could then, remebering a tip I'd read on a website, walked around mentally tracing my steps from the swim exit to the bike.\n\nI really wasn't sure what to expect, especially when it came to the swim and the water temperature. I'd done a few sea-swims, but the lake was around 12℃, a little colder than I was used to. I needn't have worried though, despited a little bit of cold-shock I managed to complete the swim in 12m26s, surprisingly in the middle of the field. \n\nTransition was a weird experience, I _did_ manage to remove my wetsuit without too much falling over myself but then forgot my race belt and had to embarrassingly run back from the mount line to collect it. \n\nIt was such a relief to get the swim and T1 out of the way that I _may_ have gone out a little too fast on the bike. Still I managed to maintain a decent pace and completed the cycle in 57m30s.\n\nT2 was an altogether more relaxed affair and I was feeling pretty good knowing the end was in sight. I exited transition onto the run corse feeling pretty please with myself.\n\n{% include figure.html class=\"pull-both\" set=\"slateman_1\" %}\n\nThat was until I hit the first climb. I was pleased to see I wasn't the only one walking and as we went higher the views more than made up for the burning calves. With some really fun, fast downhill sections the run finally led me back past transition to the finish line. I felt elated that I'd manage to finish my first triathlon in 1h54m47s.\n\n{% include figure.html class=\"pull-both\" set=\"slateman_2\" %}\n\nThere was a unique atmosphere I've not felt in any run or cycle event I've taken part in. I'm not sure if all Tri events are like this, or whether it was just the Slateman. Kudos to the organisers, it was a fantastic day. I always felt I knew where I should be, what I should be doing and (most importantly) that my kit was safe. \n\nIf you'd like to give it a go [entries for 2014 open on 22nd July](http://snowdoniaslateman.com/). ","html_body":"<p>Yesterday I swam in a freezing-cold lake; rode my bike up a mountain pass; then ran around an old slate mine.</p>\n<p>When <a href=\"http://twitter.com/imrazkhan\">Raz</a> and <a href=\"http://twitter.com/cleggmatt\">Matt</a> suggested it last year it seemed like such a good idea; they’d just seen the 2012 Slateman on TV and were raring to go. After some gental persuasion I reluctantly agreed to the shorter sprint distance of 400m swim, 20km cycle and a 6km run.</p>\n<p>In the end neither Raz or Matt could make the race due to reasons undisclosed. Luckily my friend Christian was entered for the full distance, so we packed up the van, banged on the tunes and made the 6 hour trek up to Wales.</p>\n<p>{% include figure.html class=”pull-both” set=”slateman_3” %}</p>\n<p>Race day dawned and we made our weary way from our campsite to the lake ready for the briefing. The sun was just starting to clear away the early-morning clouds as we wheeled our bikes into Transition. I laid out my kit the best I could then, remebering a tip I’d read on a website, walked around mentally tracing my steps from the swim exit to the bike.</p>\n<p>I really wasn’t sure what to expect, especially when it came to the swim and the water temperature. I’d done a few sea-swims, but the lake was around 12℃, a little colder than I was used to. I needn’t have worried though, despited a little bit of cold-shock I managed to complete the swim in 12m26s, surprisingly in the middle of the field. </p>\n<p>Transition was a weird experience, I <em>did</em> manage to remove my wetsuit without too much falling over myself but then forgot my race belt and had to embarrassingly run back from the mount line to collect it. </p>\n<p>It was such a relief to get the swim and T1 out of the way that I <em>may</em> have gone out a little too fast on the bike. Still I managed to maintain a decent pace and completed the cycle in 57m30s.</p>\n<p>T2 was an altogether more relaxed affair and I was feeling pretty good knowing the end was in sight. I exited transition onto the run corse feeling pretty please with myself.</p>\n<p>{% include figure.html class=”pull-both” set=”slateman_1” %}</p>\n<p>That was until I hit the first climb. I was pleased to see I wasn’t the only one walking and as we went higher the views more than made up for the burning calves. With some really fun, fast downhill sections the run finally led me back past transition to the finish line. I felt elated that I’d manage to finish my first triathlon in 1h54m47s.</p>\n<p>{% include figure.html class=”pull-both” set=”slateman_2” %}</p>\n<p>There was a unique atmosphere I’ve not felt in any run or cycle event I’ve taken part in. I’m not sure if all Tri events are like this, or whether it was just the Slateman. Kudos to the organisers, it was a fantastic day. I always felt I knew where I should be, what I should be doing and (most importantly) that my kit was safe. </p>\n<p>If you’d like to give it a go <a href=\"http://snowdoniaslateman.com/\">entries for 2014 open on 22nd July</a>. </p>\n","html_snippet":{"s":"<p>Yesterday I swam in a freezing-cold lake; rode my bike up a mountain pass; then ran around an old slate mine.</p><p>When <a href=\"http://twitter.com/imrazkhan\">Raz</a> and <a href=\"http://twitter.com/cleggmatt\">Matt</a> suggested it last year it seemed like such a good idea; they’d just seen...</p>","orig":"<p>Yesterday I swam in a freezing-cold lake; rode my bike up a mountain pass; then ran around an old slate mine.</p><p>When <a href=\"http://twitter.com/imrazkhan\">Raz</a> and <a href=\"http://twitter.com/cleggmatt\">Matt</a> suggested it last year it seemed like such a good idea; they’d just seen...</p>","length":302}},{"attributes":{"date":"2009-01-09T00:00:00.000Z","title":"the Silly Old Sods","section":"diary","cover":"/assets/blog/covers/Silly-Old-Sod-travels-around-the-country-on-a-bus-pass-03-04-13.jpg","tags":["family"],"images":[{"image":"Silly-Old-Sod-travels-around-the-country-on-a-bus-pass-03-04-13.jpg","caption":"Uncle Bill and his mate Dave","set":"sos"}],"id":"37","type":"diary"},"body":"**Katie**'s uncle **Bill** is about to embark on a harebrained scheme to raise some cash for the <abbr title=\"Royal National Lifeboats Institution\">RNLI</abbr>. Together with his mate **Dave** (*everyone's got a mate Dave*) they'll be traveling the entire length of the English and Welsh coast using nothing but their free bus passes. \n\n{% include figure.html class=\"pull-both\" set=\"sos\" %}\n\nYou can support the old sods by texting **SAVE** to **84424**, they'll get **£1.50** (but some, very nasty, networks may charge you *slightly* more). Or donate on their [just giving](http://www.justgiving.com/sillyoldsods) page, and that way they'll get ALL your lovely wonga, and if you're a UK TAX payer, they'll get that too. They've set up a website so you can track their progress, checkout [sillyoldsods.co.uk](http://www.sillyoldsods.co.uk) for more information on the trip.","html_body":"<p><strong>Katie</strong>‘s uncle <strong>Bill</strong> is about to embark on a harebrained scheme to raise some cash for the <abbr title=\"Royal National Lifeboats Institution\">RNLI</abbr>. Together with his mate <strong>Dave</strong> (<em>everyone’s got a mate Dave</em>) they’ll be traveling the entire length of the English and Welsh coast using nothing but their free bus passes. </p>\n<p>{% include figure.html class=”pull-both” set=”sos” %}</p>\n<p>You can support the old sods by texting <strong>SAVE</strong> to <strong>84424</strong>, they’ll get <strong>£1.50</strong> (but some, very nasty, networks may charge you <em>slightly</em> more). Or donate on their <a href=\"http://www.justgiving.com/sillyoldsods\">just giving</a> page, and that way they’ll get ALL your lovely wonga, and if you’re a UK TAX payer, they’ll get that too. They’ve set up a website so you can track their progress, checkout <a href=\"http://www.sillyoldsods.co.uk\">sillyoldsods.co.uk</a> for more information on the trip.</p>\n","html_snippet":{"s":"<p><strong>Katie</strong>‘s uncle <strong>Bill</strong> is about to embark on a harebrained scheme to raise some cash for the <abbr title=\"Royal National Lifeboats Institution\">RNLI</abbr>. Together with his mate <strong>Dave</strong> (<em>everyone’s got a mate Dave</em>) they’ll be traveling the entire length of the English...</p>","orig":"<p><strong>Katie</strong>‘s uncle <strong>Bill</strong> is about to embark on a harebrained scheme to raise some cash for the <abbr title=\"Royal National Lifeboats Institution\">RNLI</abbr>. Together with his mate <strong>Dave</strong> (<em>everyone’s got a mate Dave</em>) they’ll be traveling the entire length of the English...</p>","length":333}},{"attributes":{"date":"2009-01-04T00:00:00.000Z","title":"2008, in Review","section":"diary","introduction":"2008 was a year of BIG changes for me: I left my full time position at [Glaxstar](http://glaxstar.com) for the wonderful (and most-times stressful) world of freelancing; I moved 200 miles south from a shared house 'Cherrytree' in Walsall, West Midlands to Littlehampton, West Sussex on the south coast; And I proposed to my lovely girlfriend **Katie**, to which, she said yes.","cover":"/assets/blog/covers/2225980060_a7be8f79e7_b.jpg","images":[{"image":"2225980060_a7be8f79e7_b.jpg","caption":"The old men of Coniston","set":"coniston"},{"image":"2327109329_b2065e2dbc_b.jpg","caption":"Clegg Pie","set":"cleggpie"},{"image":"2343810920_5a6697f039_o.jpg","caption":"His & Her's","set":"party"},{"image":"2413271178_ea1b5d8d9c_b.jpg","caption":"Waa","set":"waa"},{"image":"2908969007_eefc4da86a_b.jpg","caption":"Mum, Dad & Cake Oil","set":"dadsbday"},{"image":"2909815444_68e323b146_b.jpg","caption":"Levelling the Land","set":"levellers"},{"image":"2909818578_0c24f17d3f_b.jpg","caption":"The 6 hour service","set":"service"},{"image":"2909817406_5c6543ed38_b.jpg","caption":"Calm down, it's only a candle!","set":"cathbap"},{"image":"2908972951_fc2c157e72_b.jpg","caption":"Big Ben","set":"bigben"},{"image":"3016068255_acacf95d72_b.jpg","caption":"The Lazy Toads","set":"toads"},{"image":"3116966434_4a4ca594ac_o.jpg","caption":"The ring","set":"ring"}],"id":"36","type":"diary"},"body":"2008 was a year of BIG changes for me: I left my full time position at [Glaxstar](http://glaxstar.com) for the wonderful (and most-times stressful) world of freelancing; I moved 200 miles south from a shared house 'Cherrytree' in Walsall, West Midlands to Littlehampton, West Sussex on the south coast; And I proposed to my lovely girlfriend **Katie**, to which, she said yes. \n\nI had some very good times in 2008, but it's the people that made my year. I've tried to name each and every one of you who made 2008 such an amazing year.\n\n## January\n\nBrr, January - There was [snow](http://flickr.com/photos/roobottommobile/2209064397), My car reached [111,111 miles](http://flickr.com/photos/roobottommobile/2209860514), and I finally got to see **Rob & Bekki Cotton** on [their barge](http://flickr.com/photos/roobottommobile/2209861688)! One thing that does standout was the trip that **Matt Clegg**, **Ben Marklew**, **John McNally** and I took to the lakes to climb [The Old Man of Coniston](http://en.wikipedia.org/wiki/Coniston_Old_Man). A top weekend that, thinking back, makes me want to do more outdoor related stuff this year. You know, like the BIG outdoors rather than the tiny stuff you get in your local high street after stepping out of the kabab shop at 3am.\n\n{% include figure.html class=\"pull-both\" set=\"coniston\" %}\n\nOn January 15th it was a year since Katie's dad passed away. **Tony Sellwood** was an amazing man... I tried to write something fitting about him shortly after he died, but couldn't find the words. Similarly now, I'm struggling, but as the second year anniversary approaches in 2009 I remember him fondly as a joker with more time for people than anyone else I've ever met. I know he's with God.\n\n## February\n\nFebruary was a bit of a mixture. At work, Glubble Family Edition was launched to a somewhat mixed reception. My abiding memory of this time was spending late nights at my parents (when our net connection was down) till 3am chatting with **Ian Hayward**, pushing pixels around interface designs. \n\nElsewhere, **Katie** and I took a long weekend to Bath. I dunno why we did, but I'm sure that we did, as I have [photographic evidence](http://www.flickr.com/photos/roobottom/2327119659). Life at Cherrytree was fun, as always, and **Matt Clegg** managed to bake a pie with the edibility of mild steel. \n\n{% include figure.html class=\"pull-both\" set=\"cleggpie\" %}\n\n## March\n\n As I write this review, it's now that I wish I'd blogged more and taken a whole heap of photos. What did you achieve in March 2008 Jon? Oh, well, Katie and I dressed up like knobs and went to a party.\n\n{% include figure.html class=\"pull-both\" set=\"party\" %}\n\n## April\n\nApril is my birthday month (just in-case you were thinking of buying me a present) and in 2008 I experienced my first ever [Coke Float](http://www.flickr.com/photos/roobottom/2431709662/in/datetaken/) thanks (mainly) to the fine work of **Richard Kemp**. I have yet to find a way to repay him for bringing such joy into my life. By this point of 2008 I was spending more and more of my time in Littlehampton (something to do with this random girl I met) and in [April \"LA\" got snow](http://www.flickr.com/photos/roobottom/sets/72157604532486601/)! Ah snow on the beach, **Mark Wilson**, **Kamran & Ellie Khan**, **Katie** and I very much enjoyed pelting each other with snowballs. \n\nBut by far the best thing about April was going to the [Scilly Isles](http://en.wikipedia.org/wiki/Isles_of_Scilly). It was hard to believe that just over a week before we'd had snow as, when we got there, it was hot hot hot! **Sea Legs** (heretofore know as **Cath Hyslop**), **Katie**, **Katie's Mum** and I all spent a week in Sea Leg's Mum's cottage. Katie and Cath had years of family holiday history on the tiny islands, and had spent 6 months living and working on Scilly before traveling Australia for a year - So they knew most of the locals, but best of all knew all the best pubs. \n\n{% include figure.html class=\"pull-both\" set=\"waa\" %}\n\n## May\n\nThe start of *some* warm weather prompted me to take the plunge and invest in some running shoes. And, needless to say, I was less than delighted when my first efforts yielded a total distance of 100 yards and a collapsed lung. Over the coming months though I did get *slightly* better, and having run an impressive _slightly further_ I took the decision to enter a half marathon in February 2009. Which, actually, now I come to think about it is not very far off at all...Oh dear. \n\nMeanwhile, our lovely (and by this I mean not at all a bunch of money-grabbing jobs-worths) letting agents had informed us that the landlord wanted to sell Cherrytree and we had to move out at the end of July. The hunt was on to find a new place where I, **Matt Heaton**, **Matt Clegg** and **Steve Clark** could live. Not too much effort went into this initially, after all how hard could it be to find a four bedroom house for let in [Walsall](http://en.wikipedia.org/wiki/Walsall)? To four, very, _very_ clean living young gentlemen... \n\n## June\n\n June went by in a blur. We still weren't putting in too much effort on the house front, it was hot and not a time for sitting in writing blog posts. So consequentially I can't recall anything that happened. Maybe the best solution for June would be a sign saying: \"scene deleted\". \n\n## July\n\n July was a month of big decisions. We still couldn't find a place to live, and the time was quickly drawing near when we'd have to say goodbye to our beloved Cherrytree. A place in a shared house became available in [Littlehampton](http://en.wikipedia.org/wiki/Littlehampton) (aka LA), and it seemed to be a no-brainer. It was certainly a lot closer to Katie than Walsall. But in typical Jon Roobottom style I couldn't decide what to do for the best. This was it, if I moved it meant I really liked this girl. \n\nThanks to the sterling efforts of **Dan Mayley**, and praying more than ever before, I finally saw the light and took the plunge. It was around this time that Glaxstar offered me a deal whereby I'd go freelance, but they'd guarantee me hours for a considerable block of time. How could I not? I'd been itching to get my teeth into some freelance stuff for months - I bit their arm off. God is good. \n\nA week before I left I went camping in [Coed y Brenin](http://en.wikipedia.org/wiki/Coed-y-Brenin), Wales with some old mates; **Paul Lloyd**, **Kris Benbow**, **Jon Ford**, **Lewis Burden**, **Lee Nash**, **Dave Handley**, **Mark Gosling** and **Jon Macey**. Awesome is all I can say, it came at just the right time. Let's hope we can do it again in 2009. \n\nThe day before I left **Hannah Kemp** threw me a party at chez-kemp. Having spent the last 4 years in Walsall Community Church, this was above and beyond the best send off I could have asked for. Guys, each and every one of you has made Walsall special, and I really can't express what it meant to me to have you all there for the party. Chatting, drinking, relaxing and eating part cooked bbq spare ribs with each one of you is an absolute pleasure. \n\n**Matt H**, **Matt C**, **Adam**, **Steve**, **AJ**,** Kemp**, **Hannah**, **Minnie**, **Esther**, **Sarah**, **Dan & Erin**, **Andy & Sue**, **Raz**, **Paul**, **Lee**, **Kirsty**, **Katy & Ben**, **Lou** and **Paul & Esta**... Thanks for turning up to say goodbye... or maybe just making sure I leave. So on Saturday 26th July 2008 **Kemp**, **AJ**, **Steve** and I packed up a big van and moved my stuff into my new house.\n\n## August\n\nI love the summer, and August didn't disappoint for once - or it may have done, depending on how reliable my memory is. But I recall August as hot. Katie and I travelled back to my **Mum & Dad**'s place in Walsall for his 60th birthday. I think he ended up paying for the meal, so, thanks dad. \n\n{% include figure.html class=\"pull-both\" set=\"dadsbday\" %}\n\nIt was also the big fruits' birthday, so we celebrated **Angie Tuffill** being another year older in style with an American themed party. I think prizes went to **Kamran Khan** for the best costume as [Uncle Fester](http://www.flickr.com/photos/roobottom/2908969397), although he's not a million miles away from that normally. \n\nI also got to relive my youth by finally getting to see [The Levellers](http://en.wikipedia.org/wiki/The_Levellers) live at [Arundel Castle](http://en.wikipedia.org/wiki/Arundel_Castle). By the looks of some of the older gentlemen in the crowd, they'd been reliving their youth from just after lunch and by 8pm they'd relived so much they were probably going to regret that one in the office on Monday morning. \n\n{% include figure.html class=\"pull-both\" set=\"levellers\" %}\n\n## September\n\nSeptember saw **Annie & Christian Powell** get hitched, which was good news for all of us as we knew they'd throw a decent party. And they didn't disappoint, with not one wedding party but two. Apparently the rave on Sunday night went on till 3am. I'm sure the 3 huge barrels of ale that Christian had invested in helped there. \n\n**Kamran Khan** and I decided to service my car, I mean, how hard could it be? We got all the stuff and set about the task. 6 hours later we'd changed the air filter, just about managed to swap the spark-plugs and put a hole in the drivers side floor. Well, I say \"we\", but the hole was mainly my fault. Still, my car seemed to run all the sweeter for our efforts.\n\n{% include figure.html class=\"pull-both\" set=\"service\" %}\n\n**Cath Hyslop** got baptised! Admittedly I was supposed to get dunked too, but I'm not all that great at making decisions. \n\n{% include figure.html class=\"pull-both\" set=\"cathbap\" %}\n\n## October\n\nOctober is **Katie**'s birthday month, and in true southern style we and a *few* others went for an all you can eat Chinese. I feel we really didn't take full advantage of the 'all you can eat-ness' of the thing, especially Katie who powered her way through starters only... Well, OK she had about 2 tonnes of fried seaweed, but that's not the point. \n\nThe month was also memorable for a day trip Katie and I took to London. I'd been to London so much for work related stuff over the last few months, it was really nice to spend some time (and LOTS of money) exploring the city. \n\n{% include figure.html class=\"pull-both\" set=\"bigben\" %}\n\nOctober was also the month when our new [cell](http://en.wikipedia.org/wiki/Cell_group) really took off. I'd arrived in LA at a point where the cell-group was in flux, **Claire Jones** had decided to take a well earned break from her leadership role and we were waiting for a someone to step into the breach. But in October we decided that we'd take our cell in a new direction, each week we'd take it in turns to lead with whatever God had put on our hearts to share. So far it's worked extraordinarily well.\n\n## November\n\nNovember was awesome because of the [WCC](http://www.walsallcommunitychurch.org/) men's weekend away at Standlake Ranch in Oxfordshire. Like the weekend away in 2007 it was an amazing time with God, and He did so much in my life that weekend, perfectly building on the previous year with perfect timing for everything that was going on in my life. \n\n{% include figure.html class=\"pull-both\" set=\"toads\" %}\n\n**Flix & Maryanne Gillett** got hitched too! Gotta say guys the bangers and mash was inspired, and Flix's speech is possibly one of the best I've ever heard. \n\n## December\n\nThe early part of December saw **Katie** and **Cath** jetting off to Hong Kong \"Hongers\" for a few days. Was I jealous? Yeah, a little, but I flippin' hate flying with a passion so avoiding the 12 hour flight was some small consolation. \n\nLater in the month **Katie** and I took a week's holiday in Scotland. I'd told her that I'd booked a B&B and found a suitably crappy looking random guest house on the internet to fool her with. I'd actually booked a private cottage with a hot tub as I'd hatched a bit of a plan. When we got there, the post code on the cottage website took us to some random housing estate. Not to worry I thought, it can't be far, I'll just drive around til we happen upon it. An hour later I was getting a little stressed as all my plans for a surprise were rapidly going down the toilet. In the end I had to confess all and Katie knocked doors until we found someone who'd heard of the place. \n\nWhen we eventually arrived at the cottage I thought I'd booked (as there we're two on the website, a one bedroom place and a three bedroom place) the lights were on, and we could here voices in the garden. \"Hello?\" I shouted as I walked around to the rear of the cottage. I was really fuming now, over an hour to find the place and the owners had double booked it! \n\nI was greeted with sight of a naked couple in the hot tub, she quickly moved, but he just sat there, and I couldn't help but glance at the thing that was floating in the crystal clear, illuminated, water. \"Erm...\" I said, \"Have you booked this place, cos I think I have\". He was actually quite polite, and as we made a quick exit we noticed that the driveway continued on to a larger property just around the corner. In my haste and annoyance I hadn't realised that the place I'd booked was actually the three bedroom cottage. Oh well, you live and learn. \n\nThat night, Katie and I relaxed with a bottle of wine and the promise of the hot tub bubbling away outside. I couldn't wait any longer, she was clearly impressed with the way I'd handled the naked man and the iron was hot to strike. I sat her down, got on one knee and asked her if she'd be my wife. \"Waaaaaaaaaaaaaaaaaaaaaaaa.... really?!\" she said. And then just kept on saying it. Eventually I had to ask her if that was a 'yes'. The ring didn't fit, we'd seen too much nakedness, and all we had for dinner was fish fingers and chips. But it didn't matter, the place was brilliant, and she'd said yes. I couldn't be happier. \n\n{% include figure.html class=\"pull-both\" set=\"ring\" %}\n\nAs 2008 drew to a close, 17 of us played a murder mystery and then on **Florrie Fuller**'s suggestion we played musical statues to the small hours. Thanks to everyone who made my year so awesome, you know who you are (even if you're not mentioned by name here). Here's to a brilliant 2009, and look out for your wedding invites coming to a post box near you sometime in '09... We promise!","html_body":"<p>2008 was a year of BIG changes for me: I left my full time position at <a href=\"http://glaxstar.com\">Glaxstar</a> for the wonderful (and most-times stressful) world of freelancing; I moved 200 miles south from a shared house ‘Cherrytree’ in Walsall, West Midlands to Littlehampton, West Sussex on the south coast; And I proposed to my lovely girlfriend <strong>Katie</strong>, to which, she said yes. </p>\n<p>I had some very good times in 2008, but it’s the people that made my year. I’ve tried to name each and every one of you who made 2008 such an amazing year.</p>\n<h2 id=\"january\">January</h2>\n<p>Brr, January - There was <a href=\"http://flickr.com/photos/roobottommobile/2209064397\">snow</a>, My car reached <a href=\"http://flickr.com/photos/roobottommobile/2209860514\">111,111 miles</a>, and I finally got to see <strong>Rob &amp; Bekki Cotton</strong> on <a href=\"http://flickr.com/photos/roobottommobile/2209861688\">their barge</a>! One thing that does standout was the trip that <strong>Matt Clegg</strong>, <strong>Ben Marklew</strong>, <strong>John McNally</strong> and I took to the lakes to climb <a href=\"http://en.wikipedia.org/wiki/Coniston_Old_Man\">The Old Man of Coniston</a>. A top weekend that, thinking back, makes me want to do more outdoor related stuff this year. You know, like the BIG outdoors rather than the tiny stuff you get in your local high street after stepping out of the kabab shop at 3am.</p>\n<p>{% include figure.html class=”pull-both” set=”coniston” %}</p>\n<p>On January 15th it was a year since Katie’s dad passed away. <strong>Tony Sellwood</strong> was an amazing man… I tried to write something fitting about him shortly after he died, but couldn’t find the words. Similarly now, I’m struggling, but as the second year anniversary approaches in 2009 I remember him fondly as a joker with more time for people than anyone else I’ve ever met. I know he’s with God.</p>\n<h2 id=\"february\">February</h2>\n<p>February was a bit of a mixture. At work, Glubble Family Edition was launched to a somewhat mixed reception. My abiding memory of this time was spending late nights at my parents (when our net connection was down) till 3am chatting with <strong>Ian Hayward</strong>, pushing pixels around interface designs. </p>\n<p>Elsewhere, <strong>Katie</strong> and I took a long weekend to Bath. I dunno why we did, but I’m sure that we did, as I have <a href=\"http://www.flickr.com/photos/roobottom/2327119659\">photographic evidence</a>. Life at Cherrytree was fun, as always, and <strong>Matt Clegg</strong> managed to bake a pie with the edibility of mild steel. </p>\n<p>{% include figure.html class=”pull-both” set=”cleggpie” %}</p>\n<h2 id=\"march\">March</h2>\n<p> As I write this review, it’s now that I wish I’d blogged more and taken a whole heap of photos. What did you achieve in March 2008 Jon? Oh, well, Katie and I dressed up like knobs and went to a party.</p>\n<p>{% include figure.html class=”pull-both” set=”party” %}</p>\n<h2 id=\"april\">April</h2>\n<p>April is my birthday month (just in-case you were thinking of buying me a present) and in 2008 I experienced my first ever <a href=\"http://www.flickr.com/photos/roobottom/2431709662/in/datetaken/\">Coke Float</a> thanks (mainly) to the fine work of <strong>Richard Kemp</strong>. I have yet to find a way to repay him for bringing such joy into my life. By this point of 2008 I was spending more and more of my time in Littlehampton (something to do with this random girl I met) and in <a href=\"http://www.flickr.com/photos/roobottom/sets/72157604532486601/\">April “LA” got snow</a>! Ah snow on the beach, <strong>Mark Wilson</strong>, <strong>Kamran &amp; Ellie Khan</strong>, <strong>Katie</strong> and I very much enjoyed pelting each other with snowballs. </p>\n<p>But by far the best thing about April was going to the <a href=\"http://en.wikipedia.org/wiki/Isles_of_Scilly\">Scilly Isles</a>. It was hard to believe that just over a week before we’d had snow as, when we got there, it was hot hot hot! <strong>Sea Legs</strong> (heretofore know as <strong>Cath Hyslop</strong>), <strong>Katie</strong>, <strong>Katie’s Mum</strong> and I all spent a week in Sea Leg’s Mum’s cottage. Katie and Cath had years of family holiday history on the tiny islands, and had spent 6 months living and working on Scilly before traveling Australia for a year - So they knew most of the locals, but best of all knew all the best pubs. </p>\n<p>{% include figure.html class=”pull-both” set=”waa” %}</p>\n<h2 id=\"may\">May</h2>\n<p>The start of <em>some</em> warm weather prompted me to take the plunge and invest in some running shoes. And, needless to say, I was less than delighted when my first efforts yielded a total distance of 100 yards and a collapsed lung. Over the coming months though I did get <em>slightly</em> better, and having run an impressive <em>slightly further</em> I took the decision to enter a half marathon in February 2009. Which, actually, now I come to think about it is not very far off at all…Oh dear. </p>\n<p>Meanwhile, our lovely (and by this I mean not at all a bunch of money-grabbing jobs-worths) letting agents had informed us that the landlord wanted to sell Cherrytree and we had to move out at the end of July. The hunt was on to find a new place where I, <strong>Matt Heaton</strong>, <strong>Matt Clegg</strong> and <strong>Steve Clark</strong> could live. Not too much effort went into this initially, after all how hard could it be to find a four bedroom house for let in <a href=\"http://en.wikipedia.org/wiki/Walsall\">Walsall</a>? To four, very, <em>very</em> clean living young gentlemen… </p>\n<h2 id=\"june\">June</h2>\n<p> June went by in a blur. We still weren’t putting in too much effort on the house front, it was hot and not a time for sitting in writing blog posts. So consequentially I can’t recall anything that happened. Maybe the best solution for June would be a sign saying: “scene deleted”. </p>\n<h2 id=\"july\">July</h2>\n<p> July was a month of big decisions. We still couldn’t find a place to live, and the time was quickly drawing near when we’d have to say goodbye to our beloved Cherrytree. A place in a shared house became available in <a href=\"http://en.wikipedia.org/wiki/Littlehampton\">Littlehampton</a> (aka LA), and it seemed to be a no-brainer. It was certainly a lot closer to Katie than Walsall. But in typical Jon Roobottom style I couldn’t decide what to do for the best. This was it, if I moved it meant I really liked this girl. </p>\n<p>Thanks to the sterling efforts of <strong>Dan Mayley</strong>, and praying more than ever before, I finally saw the light and took the plunge. It was around this time that Glaxstar offered me a deal whereby I’d go freelance, but they’d guarantee me hours for a considerable block of time. How could I not? I’d been itching to get my teeth into some freelance stuff for months - I bit their arm off. God is good. </p>\n<p>A week before I left I went camping in <a href=\"http://en.wikipedia.org/wiki/Coed-y-Brenin\">Coed y Brenin</a>, Wales with some old mates; <strong>Paul Lloyd</strong>, <strong>Kris Benbow</strong>, <strong>Jon Ford</strong>, <strong>Lewis Burden</strong>, <strong>Lee Nash</strong>, <strong>Dave Handley</strong>, <strong>Mark Gosling</strong> and <strong>Jon Macey</strong>. Awesome is all I can say, it came at just the right time. Let’s hope we can do it again in 2009. </p>\n<p>The day before I left <strong>Hannah Kemp</strong> threw me a party at chez-kemp. Having spent the last 4 years in Walsall Community Church, this was above and beyond the best send off I could have asked for. Guys, each and every one of you has made Walsall special, and I really can’t express what it meant to me to have you all there for the party. Chatting, drinking, relaxing and eating part cooked bbq spare ribs with each one of you is an absolute pleasure. </p>\n<p><strong>Matt H</strong>, <strong>Matt C</strong>, <strong>Adam</strong>, <strong>Steve</strong>, <strong>AJ</strong>,<strong> Kemp</strong>, <strong>Hannah</strong>, <strong>Minnie</strong>, <strong>Esther</strong>, <strong>Sarah</strong>, <strong>Dan &amp; Erin</strong>, <strong>Andy &amp; Sue</strong>, <strong>Raz</strong>, <strong>Paul</strong>, <strong>Lee</strong>, <strong>Kirsty</strong>, <strong>Katy &amp; Ben</strong>, <strong>Lou</strong> and <strong>Paul &amp; Esta</strong>… Thanks for turning up to say goodbye… or maybe just making sure I leave. So on Saturday 26th July 2008 <strong>Kemp</strong>, <strong>AJ</strong>, <strong>Steve</strong> and I packed up a big van and moved my stuff into my new house.</p>\n<h2 id=\"august\">August</h2>\n<p>I love the summer, and August didn’t disappoint for once - or it may have done, depending on how reliable my memory is. But I recall August as hot. Katie and I travelled back to my <strong>Mum &amp; Dad</strong>‘s place in Walsall for his 60th birthday. I think he ended up paying for the meal, so, thanks dad. </p>\n<p>{% include figure.html class=”pull-both” set=”dadsbday” %}</p>\n<p>It was also the big fruits’ birthday, so we celebrated <strong>Angie Tuffill</strong> being another year older in style with an American themed party. I think prizes went to <strong>Kamran Khan</strong> for the best costume as <a href=\"http://www.flickr.com/photos/roobottom/2908969397\">Uncle Fester</a>, although he’s not a million miles away from that normally. </p>\n<p>I also got to relive my youth by finally getting to see <a href=\"http://en.wikipedia.org/wiki/The_Levellers\">The Levellers</a> live at <a href=\"http://en.wikipedia.org/wiki/Arundel_Castle\">Arundel Castle</a>. By the looks of some of the older gentlemen in the crowd, they’d been reliving their youth from just after lunch and by 8pm they’d relived so much they were probably going to regret that one in the office on Monday morning. </p>\n<p>{% include figure.html class=”pull-both” set=”levellers” %}</p>\n<h2 id=\"september\">September</h2>\n<p>September saw <strong>Annie &amp; Christian Powell</strong> get hitched, which was good news for all of us as we knew they’d throw a decent party. And they didn’t disappoint, with not one wedding party but two. Apparently the rave on Sunday night went on till 3am. I’m sure the 3 huge barrels of ale that Christian had invested in helped there. </p>\n<p><strong>Kamran Khan</strong> and I decided to service my car, I mean, how hard could it be? We got all the stuff and set about the task. 6 hours later we’d changed the air filter, just about managed to swap the spark-plugs and put a hole in the drivers side floor. Well, I say “we”, but the hole was mainly my fault. Still, my car seemed to run all the sweeter for our efforts.</p>\n<p>{% include figure.html class=”pull-both” set=”service” %}</p>\n<p><strong>Cath Hyslop</strong> got baptised! Admittedly I was supposed to get dunked too, but I’m not all that great at making decisions. </p>\n<p>{% include figure.html class=”pull-both” set=”cathbap” %}</p>\n<h2 id=\"october\">October</h2>\n<p>October is <strong>Katie</strong>‘s birthday month, and in true southern style we and a <em>few</em> others went for an all you can eat Chinese. I feel we really didn’t take full advantage of the ‘all you can eat-ness’ of the thing, especially Katie who powered her way through starters only… Well, OK she had about 2 tonnes of fried seaweed, but that’s not the point. </p>\n<p>The month was also memorable for a day trip Katie and I took to London. I’d been to London so much for work related stuff over the last few months, it was really nice to spend some time (and LOTS of money) exploring the city. </p>\n<p>{% include figure.html class=”pull-both” set=”bigben” %}</p>\n<p>October was also the month when our new <a href=\"http://en.wikipedia.org/wiki/Cell_group\">cell</a> really took off. I’d arrived in LA at a point where the cell-group was in flux, <strong>Claire Jones</strong> had decided to take a well earned break from her leadership role and we were waiting for a someone to step into the breach. But in October we decided that we’d take our cell in a new direction, each week we’d take it in turns to lead with whatever God had put on our hearts to share. So far it’s worked extraordinarily well.</p>\n<h2 id=\"november\">November</h2>\n<p>November was awesome because of the <a href=\"http://www.walsallcommunitychurch.org/\">WCC</a> men’s weekend away at Standlake Ranch in Oxfordshire. Like the weekend away in 2007 it was an amazing time with God, and He did so much in my life that weekend, perfectly building on the previous year with perfect timing for everything that was going on in my life. </p>\n<p>{% include figure.html class=”pull-both” set=”toads” %}</p>\n<p><strong>Flix &amp; Maryanne Gillett</strong> got hitched too! Gotta say guys the bangers and mash was inspired, and Flix’s speech is possibly one of the best I’ve ever heard. </p>\n<h2 id=\"december\">December</h2>\n<p>The early part of December saw <strong>Katie</strong> and <strong>Cath</strong> jetting off to Hong Kong “Hongers” for a few days. Was I jealous? Yeah, a little, but I flippin’ hate flying with a passion so avoiding the 12 hour flight was some small consolation. </p>\n<p>Later in the month <strong>Katie</strong> and I took a week’s holiday in Scotland. I’d told her that I’d booked a B&amp;B and found a suitably crappy looking random guest house on the internet to fool her with. I’d actually booked a private cottage with a hot tub as I’d hatched a bit of a plan. When we got there, the post code on the cottage website took us to some random housing estate. Not to worry I thought, it can’t be far, I’ll just drive around til we happen upon it. An hour later I was getting a little stressed as all my plans for a surprise were rapidly going down the toilet. In the end I had to confess all and Katie knocked doors until we found someone who’d heard of the place. </p>\n<p>When we eventually arrived at the cottage I thought I’d booked (as there we’re two on the website, a one bedroom place and a three bedroom place) the lights were on, and we could here voices in the garden. “Hello?” I shouted as I walked around to the rear of the cottage. I was really fuming now, over an hour to find the place and the owners had double booked it! </p>\n<p>I was greeted with sight of a naked couple in the hot tub, she quickly moved, but he just sat there, and I couldn’t help but glance at the thing that was floating in the crystal clear, illuminated, water. “Erm…” I said, “Have you booked this place, cos I think I have”. He was actually quite polite, and as we made a quick exit we noticed that the driveway continued on to a larger property just around the corner. In my haste and annoyance I hadn’t realised that the place I’d booked was actually the three bedroom cottage. Oh well, you live and learn. </p>\n<p>That night, Katie and I relaxed with a bottle of wine and the promise of the hot tub bubbling away outside. I couldn’t wait any longer, she was clearly impressed with the way I’d handled the naked man and the iron was hot to strike. I sat her down, got on one knee and asked her if she’d be my wife. “Waaaaaaaaaaaaaaaaaaaaaaaa…. really?!” she said. And then just kept on saying it. Eventually I had to ask her if that was a ‘yes’. The ring didn’t fit, we’d seen too much nakedness, and all we had for dinner was fish fingers and chips. But it didn’t matter, the place was brilliant, and she’d said yes. I couldn’t be happier. </p>\n<p>{% include figure.html class=”pull-both” set=”ring” %}</p>\n<p>As 2008 drew to a close, 17 of us played a murder mystery and then on <strong>Florrie Fuller</strong>‘s suggestion we played musical statues to the small hours. Thanks to everyone who made my year so awesome, you know who you are (even if you’re not mentioned by name here). Here’s to a brilliant 2009, and look out for your wedding invites coming to a post box near you sometime in ‘09… We promise!</p>\n","html_snippet":{"s":"<p>2008 was a year of BIG changes for me: I left my full time position at <a href=\"http://glaxstar.com\">Glaxstar</a> for the wonderful (and most-times stressful) world of freelancing; I moved 200 miles south from a shared house ‘Cherrytree’...</p>","orig":"<p>2008 was a year of BIG changes for me: I left my full time position at <a href=\"http://glaxstar.com\">Glaxstar</a> for the wonderful (and most-times stressful) world of freelancing; I moved 200 miles south from a shared house ‘Cherrytree’...</p>","length":247}},{"attributes":{"date":"2008-12-17T00:00:00.000Z","title":"She said Yes!","images":[{"image":"3116966434_4a4ca594ac_o.jpg","caption":"ring-ring","set":"ring"}],"id":"35","type":"diary"},"body":"It's been a while coming, but finally I popped the question and for some unknown reason Katie said yes!\n\n\n{% include figure.html class=\"\" set=\"ring\" %}\n\nSo this is it then, I'm off the market. Please ladies, don't weep and don't, for goodness sake, do anything silly. On a serious note, I'd like to say a big BIG thank you to all that have congratulated us over the last couple of weeks. I'm really looking forward to my life with Cake - she's a good 'un... I'm not a big fan of deeply personal emotions on my blog - but screw it, I bloody love her. I couldn't be happier.","html_body":"<p>It’s been a while coming, but finally I popped the question and for some unknown reason Katie said yes!</p>\n<p>{% include figure.html class=”” set=”ring” %}</p>\n<p>So this is it then, I’m off the market. Please ladies, don’t weep and don’t, for goodness sake, do anything silly. On a serious note, I’d like to say a big BIG thank you to all that have congratulated us over the last couple of weeks. I’m really looking forward to my life with Cake - she’s a good ‘un… I’m not a big fan of deeply personal emotions on my blog - but screw it, I bloody love her. I couldn’t be happier.</p>\n","html_snippet":{"s":"<p>It’s been a while coming, but finally I popped the question and for some unknown reason Katie said yes!</p><p>{% include figure.html class=”” set=”ring” %}</p><p>So this is it then, I’m off the market. Please ladies,...</p>","orig":"<p>It’s been a while coming, but finally I popped the question and for some unknown reason Katie said yes!</p><p>{% include figure.html class=”” set=”ring” %}</p><p>So this is it then, I’m off the market. Please ladies,...</p>","length":226}},{"attributes":{"date":"2008-10-20T00:00:00.000Z","title":"When girlfriends become technoweenies","images":[{"image":"1585586113_46a2fc1024_o.jpg","caption":"My girlfriend, the technoweenie","set":"katie"}],"id":"34","type":"diary"},"body":"{% include figure.html class=\"pull-both\" set=\"katie\" %}\n\nHere she is folks, the light of my life. But what happens when girlfriends become [technoweenies](http://www.urbandictionary.com/define.php?term=technoweenie)? I love her, but why on earth does she have to double click on links? And why oh why does she type \"hotmail.com\" into Google rather than just typing it into the address bar!? \n\nWhy? Because she a technoweenie. \n\nI guess the question is - Would I want it any other way? OK, so she does take 10 times as long to search the internet, but could I cope with a fellow geek? I guess the truth is I kinda like being the 'computer-savvy' one in our relationship. So she has a job working with real people. So what? I love my mac, and it's all good... Really... Am I on my own here? Or does everyone else who's in the 'web business' have a 'significant other' whose as power-geek as them? \n\nOh well, she'll learn. No matter how much she hates my iPhone, she'll still use it to watch the iPlayer.","html_body":"<p>{% include figure.html class=”pull-both” set=”katie” %}</p>\n<p>Here she is folks, the light of my life. But what happens when girlfriends become <a href=\"http://www.urbandictionary.com/define.php?term=technoweenie\">technoweenies</a>? I love her, but why on earth does she have to double click on links? And why oh why does she type “hotmail.com” into Google rather than just typing it into the address bar!? </p>\n<p>Why? Because she a technoweenie. </p>\n<p>I guess the question is - Would I want it any other way? OK, so she does take 10 times as long to search the internet, but could I cope with a fellow geek? I guess the truth is I kinda like being the ‘computer-savvy’ one in our relationship. So she has a job working with real people. So what? I love my mac, and it’s all good… Really… Am I on my own here? Or does everyone else who’s in the ‘web business’ have a ‘significant other’ whose as power-geek as them? </p>\n<p>Oh well, she’ll learn. No matter how much she hates my iPhone, she’ll still use it to watch the iPlayer.</p>\n","html_snippet":{"s":"<p>{% include figure.html class=”pull-both” set=”katie” %}</p><p>Here she is folks, the light of my life. But what happens when girlfriends become <a href=\"http://www.urbandictionary.com/define.php?term=technoweenie\">technoweenies</a>? I love her, but why on earth does she have to double...</p>","orig":"<p>{% include figure.html class=”pull-both” set=”katie” %}</p><p>Here she is folks, the light of my life. But what happens when girlfriends become <a href=\"http://www.urbandictionary.com/define.php?term=technoweenie\">technoweenies</a>? I love her, but why on earth does she have to double...</p>","length":295}},{"attributes":{"date":"2008-10-07T00:00:00.000Z","title":"200 Miles Due South","images":[{"image":"123129324_4af7c90440_o.jpg","caption":"200 miles due South","set":"beach"}],"id":"33","type":"diary"},"body":"As close friends will know I made a big move in August, one that saw me packing up my life in [Walsall](http://en.wikipedia.org/wiki/Walsall) and moving 200 miles to the South-coast.\n\n{% include figure.html set=\"beach\" %} \n\nThe last two-and-a-bit months in [Littlehampton](http://en.wikipedia.org/wiki/Littlehampton) have been fun to be sure, but *very* different to my life in Walsall. I just want to say a BIG thanks to all the people who've made me feel so welcome, and an equally big thanks to friends in Walsall for being so supportive of me moving away. \n\nIt's great to have joined a [new church](http://www.aruncommunitychurch.com/), where I've been made to feel very at home, but sad to have left behind such a [great community](http://www.walsallcommunitychurch.org/). ","html_body":"<p>As close friends will know I made a big move in August, one that saw me packing up my life in <a href=\"http://en.wikipedia.org/wiki/Walsall\">Walsall</a> and moving 200 miles to the South-coast.</p>\n<p>{% include figure.html set=”beach” %} </p>\n<p>The last two-and-a-bit months in <a href=\"http://en.wikipedia.org/wiki/Littlehampton\">Littlehampton</a> have been fun to be sure, but <em>very</em> different to my life in Walsall. I just want to say a BIG thanks to all the people who’ve made me feel so welcome, and an equally big thanks to friends in Walsall for being so supportive of me moving away. </p>\n<p>It’s great to have joined a <a href=\"http://www.aruncommunitychurch.com/\">new church</a>, where I’ve been made to feel very at home, but sad to have left behind such a <a href=\"http://www.walsallcommunitychurch.org/\">great community</a>. </p>\n","html_snippet":{"s":"<p>As close friends will know I made a big move in August, one that saw me packing up my life in <a href=\"http://en.wikipedia.org/wiki/Walsall\">Walsall</a> and moving 200 miles to the South-coast.</p><p>{% include figure.html set=”beach” %} </p><p>The last two-and-a-bit...</p>","orig":"<p>As close friends will know I made a big move in August, one that saw me packing up my life in <a href=\"http://en.wikipedia.org/wiki/Walsall\">Walsall</a> and moving 200 miles to the South-coast.</p><p>{% include figure.html set=”beach” %} </p><p>The last two-and-a-bit...</p>","length":277}},{"attributes":{"date":"2008-07-22T00:00:00.000Z","title":"My love hate relationship with O2","id":"32","type":"diary"},"body":"That's the old joke right, they hate to love me and I love to hate them? Well, as Confucius say: Lot of truth come from crap Jokes. \n\nBy now I'm sure anyone whose called me or spoken to me in the last few days has heard me say \"Yar, oh hi, yar, I'm speaking to you from my iPhone... *snort*\", and thought \"T***\"! But nevertheless I have it in my grubby mitts and I LOVE it! Yeah, OK, so the battery life isn't great and it *still* doesn't do voice dialling - but it's mine... My precious! Alas there is one big, terrible, steaming, huge, pile of festering turd - the O2 website.\n\nNever have I come across a web service so inept and terrible at every turn as the dog-shite that O2 are serving up. My first encounter with the webshite was when I tried to track my order. I clicked on the link from the email they sent me, only to discover that as I was already logged in - my session had expired. So I was given the link to log in, which I did, but then it takes me back to the O2 homepage. From here there's no links to order tracking, so you have to go back to the email and re-click the link. Which then tells you your session has expired! In the end, the only way to access your order is to log out, click the link, copy the link, log back in, and paste the link... Nightmare. \n\nThe next was MMS. Everyone knows that picture messaging is Soooo last year, and that's why Apple haven't added this feature, but some freak still send me one. No problem though, you get a text with a web link and a code to type in. (Which could be better - like having the code in the url) but still... But, uh-oh, the link is dead! An Apache error occurs. I even emailed O2 \"Support\" about this - to which their answer was \"we know, we're working on it, but don't ask us how long to sort it 'cos our web team is clearly rubbish!\" \n\nI could go on, but suffice to say that for a company who is as big as O2 you think they could afford to spend a few bob on some decent systems and developers. The monkeys they've got working there now should be sacked, and they should get some actual monkeys in. They'd do a better job.","html_body":"<p>That’s the old joke right, they hate to love me and I love to hate them? Well, as Confucius say: Lot of truth come from crap Jokes. </p>\n<p>By now I’m sure anyone whose called me or spoken to me in the last few days has heard me say “Yar, oh hi, yar, I’m speaking to you from my iPhone… <em>snort</em>“, and thought “T<em>**”! But nevertheless I have it in my grubby mitts and I LOVE it! Yeah, OK, so the battery life isn’t great and it </em>still* doesn’t do voice dialling - but it’s mine… My precious! Alas there is one big, terrible, steaming, huge, pile of festering turd - the O2 website.</p>\n<p>Never have I come across a web service so inept and terrible at every turn as the dog-shite that O2 are serving up. My first encounter with the webshite was when I tried to track my order. I clicked on the link from the email they sent me, only to discover that as I was already logged in - my session had expired. So I was given the link to log in, which I did, but then it takes me back to the O2 homepage. From here there’s no links to order tracking, so you have to go back to the email and re-click the link. Which then tells you your session has expired! In the end, the only way to access your order is to log out, click the link, copy the link, log back in, and paste the link… Nightmare. </p>\n<p>The next was MMS. Everyone knows that picture messaging is Soooo last year, and that’s why Apple haven’t added this feature, but some freak still send me one. No problem though, you get a text with a web link and a code to type in. (Which could be better - like having the code in the url) but still… But, uh-oh, the link is dead! An Apache error occurs. I even emailed O2 “Support” about this - to which their answer was “we know, we’re working on it, but don’t ask us how long to sort it ‘cos our web team is clearly rubbish!” </p>\n<p>I could go on, but suffice to say that for a company who is as big as O2 you think they could afford to spend a few bob on some decent systems and developers. The monkeys they’ve got working there now should be sacked, and they should get some actual monkeys in. They’d do a better job.</p>\n","html_snippet":{"s":"<p>That’s the old joke right, they hate to love me and I love to hate them? Well, as Confucius say: Lot of truth come from crap Jokes. </p><p>By now I’m sure anyone whose called me or spoken to me in the last few...</p>","orig":"<p>That’s the old joke right, they hate to love me and I love to hate them? Well, as Confucius say: Lot of truth come from crap Jokes. </p><p>By now I’m sure anyone whose called me or spoken to me in the last few...</p>","length":219}},{"attributes":{"date":"2008-05-30T00:00:00.000Z","title":"The Love of Jesus","id":"31","type":"diary"},"body":"For too long I have put off writing this post, and for too long I have stagnated in my Christian faith. The Bible says...\n\n> If you confess with your mouth, \"Jesus is Lord,\" and believe in your heart that God raised him from the dead, you will be saved.\n\nWell, as a basic statement of faith I believe that Jesus Christ is the way, the truth and the life of all humanity. He has given me abundant life, and given me new hope. When I returned from University in 2003, I was not a believer. In fact I cringed in embarrassment the one and only time I did make it to church. 'What are these nutters doing?' I thought, as all around me people we're raising their arm and singing at the top of their voices in praise to their King. \n\nAnd then I went along again to church, for a friends wedding blessing. Again, at first, I was an awkward affair. I didn't feel comfortable around these people making fools of themselves. But, right there in the middle of the midst of my embarrassment and endless questioning, God met me. I can describe this experience as nothing less than an amazing filling of God, the Holy Spirit. Things that I'd pushed right down, things I didn't want to think about burst into my mind. The deep black endless pit of depression that I'd suffered with the previous five years was suddenly at the forefront of my mind. But there was something else, something much bigger than that; an overwhelming Joy. \n\nTears streamed down my face as I too now worshiped God who'd given me this wonderful gift. It was a lightbulb moment, a sudden realisation that where I once thought there was nothing, there was indeed something. From that day I went looking for God. It wasn't like I had that experience and that was it, I had to actively seek him out, read the Bible and spend time with Him. ","html_body":"<p>For too long I have put off writing this post, and for too long I have stagnated in my Christian faith. The Bible says…</p>\n<blockquote>\n<p>If you confess with your mouth, “Jesus is Lord,” and believe in your heart that God raised him from the dead, you will be saved.</p>\n</blockquote>\n<p>Well, as a basic statement of faith I believe that Jesus Christ is the way, the truth and the life of all humanity. He has given me abundant life, and given me new hope. When I returned from University in 2003, I was not a believer. In fact I cringed in embarrassment the one and only time I did make it to church. ‘What are these nutters doing?’ I thought, as all around me people we’re raising their arm and singing at the top of their voices in praise to their King. </p>\n<p>And then I went along again to church, for a friends wedding blessing. Again, at first, I was an awkward affair. I didn’t feel comfortable around these people making fools of themselves. But, right there in the middle of the midst of my embarrassment and endless questioning, God met me. I can describe this experience as nothing less than an amazing filling of God, the Holy Spirit. Things that I’d pushed right down, things I didn’t want to think about burst into my mind. The deep black endless pit of depression that I’d suffered with the previous five years was suddenly at the forefront of my mind. But there was something else, something much bigger than that; an overwhelming Joy. </p>\n<p>Tears streamed down my face as I too now worshiped God who’d given me this wonderful gift. It was a lightbulb moment, a sudden realisation that where I once thought there was nothing, there was indeed something. From that day I went looking for God. It wasn’t like I had that experience and that was it, I had to actively seek him out, read the Bible and spend time with Him. </p>\n","html_snippet":{"s":"<p>For too long I have put off writing this post, and for too long I have stagnated in my Christian faith. The Bible says…</p><blockquote><p>If you confess with your mouth, “Jesus is Lord,” and believe in your heart that God...</p></blockquote>","orig":"<p>For too long I have put off writing this post, and for too long I have stagnated in my Christian faith. The Bible says…</p><blockquote><p>If you confess with your mouth, “Jesus is Lord,” and believe in your heart that God...</p></blockquote>","length":244}},{"attributes":{"date":"2008-05-28T00:00:00.000Z","title":"You know you're living in a shared house when...","id":"30","type":"diary"},"body":"Ah, the joys of living with a bunch of lads. The fridge full of beer and old milk, the unfulfilled cleaning rota, the 10.3 tonnes of Pizza boxes. But I digress, here then for your reading pleasure are those moments of realisation when you think \"Man, i'm living in a shared house.\" \n\n##There's toast in the washing powder. \nHaving the toaster positioned on the counter just above the open box of washing powder isn't always as good as it sounds, especially when you're clean pants chafe your ass cos they're full of toast crumbs.\n\n\n##You're never out of beer.\nThe combination of parties and birthdays recently has meant that our fridge has been looking like the stock room at Oddbins. This is made worse by the fact that none of us really drink a lot. People just bring it and it fills the fridge. It's a hard life.\n\n##You have more recycling than the local Tesco. \nIt's not so much the cans or bottles - It's the cardboard. Tonnes and tonnes of it. Walsall council doesn't come and pick it up. \n\n##You own a Spacehopper.\nMatt and I dedicate at least 15 mins of our working day to bouncing around our living-room.\n\n\n##You could hide a small camel in the long grass out back. \nWe really should cut it. Matt did it about 3 weeks ago, but MAN grass grows fast. We're getting kicked out of here in 5 weeks so the challenge is on to see how long we can get it before we have to fulfil our \"maintenance contract\".","html_body":"<p>Ah, the joys of living with a bunch of lads. The fridge full of beer and old milk, the unfulfilled cleaning rota, the 10.3 tonnes of Pizza boxes. But I digress, here then for your reading pleasure are those moments of realisation when you think “Man, i’m living in a shared house.” </p>\n<p>##There’s toast in the washing powder.<br>Having the toaster positioned on the counter just above the open box of washing powder isn’t always as good as it sounds, especially when you’re clean pants chafe your ass cos they’re full of toast crumbs.</p>\n<p>##You’re never out of beer.<br>The combination of parties and birthdays recently has meant that our fridge has been looking like the stock room at Oddbins. This is made worse by the fact that none of us really drink a lot. People just bring it and it fills the fridge. It’s a hard life.</p>\n<p>##You have more recycling than the local Tesco.<br>It’s not so much the cans or bottles - It’s the cardboard. Tonnes and tonnes of it. Walsall council doesn’t come and pick it up. </p>\n<p>##You own a Spacehopper.<br>Matt and I dedicate at least 15 mins of our working day to bouncing around our living-room.</p>\n<p>##You could hide a small camel in the long grass out back.<br>We really should cut it. Matt did it about 3 weeks ago, but MAN grass grows fast. We’re getting kicked out of here in 5 weeks so the challenge is on to see how long we can get it before we have to fulfil our “maintenance contract”.</p>\n","html_snippet":{"s":"<p>Ah, the joys of living with a bunch of lads. The fridge full of beer and old milk, the unfulfilled cleaning rota, the 10.3 tonnes of Pizza boxes. But I digress, here then for your reading pleasure are...</p>","orig":"<p>Ah, the joys of living with a bunch of lads. The fridge full of beer and old milk, the unfulfilled cleaning rota, the 10.3 tonnes of Pizza boxes. But I digress, here then for your reading pleasure are...</p>","length":210}},{"attributes":{"date":"2008-02-07T00:00:00.000Z","title":"Glubble Family Edition","images":[{"image":"glubbleui.png","caption":"The Glubble UI","set":"glubble"}],"id":"29","type":"diary"},"body":"\n{% include figure.html set=\"glubble\" class=\"pull-both\" %}\n\nSince the beta launch last June the Glubble team have worked non-stop to create version 1.0 of the Glubble add-on for Firefox. If you detect a little touch of pride in my tone it's because I think the new version is nothing short of an internet revolution. When [Ian Hayward](http://www.ianhayward.com/) contacted me last April about doing some freelance stuff for [Glaxstar](http://www.glaxstar.com) he gave me an impassioned speech about how he had a vision about protecting young kids on the web. Well, not only has he done that, but Glubble also makes it easy for parents to give their kids some really cool content. \n\n## So? What's new?\nWell, pretty much everything's changed but the concept - So I'll give you the top five coolest features. \n\n1. **Usertabs** - These little suckers make it so easy to log into your Glubble user account. Simply click your tab and (if you're a helper, kids don't need passwords) enter your password to unlock Firefox. Oh, and the ability to auto-disable the browser lock has been added to.\n2. **Family Homepage** - This is cool. You get your own family center where you can check out what your family's been up to online and send each other little messages on your family wall.\n3. **The Glubble Library** - The new Glubble Add-on comes with a whole load of \"content bubbles\" or Glubbles for your kids. These are basically groups of links that have been checked by our experts and are certified safe and fun for kids. The ability to create your own Glubbles and share them with family and friends is coming soon.\n4. **My Secret Homepage** - Each child gets their own secret homepage containing all their most used content. They can also write on the family wall from here and pretty soon they'll be other cool, customizable stuff they can do!\n5. **Visual Favorites** - When a child adds a page to their Favorites (bookmarks) Glubble automagically creates a thumbnail of that page and puts it in their Bookmarks Bar for easy access. I want this Add-on for Firefox myself! It's so much easier to remember what a site is from a screen shot rather than just a title.\n\n## Try Glubble\nIf you've got young kids and you'd like to give Glubble Add-on for [Firefox](http://www.mozilla.com) a go. Then [get yourself a copy now](http://www.glubble.com). It's free! (maybe that should have been the top feature) ;-)","html_body":"<p>{% include figure.html set=”glubble” class=”pull-both” %}</p>\n<p>Since the beta launch last June the Glubble team have worked non-stop to create version 1.0 of the Glubble add-on for Firefox. If you detect a little touch of pride in my tone it’s because I think the new version is nothing short of an internet revolution. When <a href=\"http://www.ianhayward.com/\">Ian Hayward</a> contacted me last April about doing some freelance stuff for <a href=\"http://www.glaxstar.com\">Glaxstar</a> he gave me an impassioned speech about how he had a vision about protecting young kids on the web. Well, not only has he done that, but Glubble also makes it easy for parents to give their kids some really cool content. </p>\n<h2 id=\"so-what-s-new-\">So? What’s new?</h2>\n<p>Well, pretty much everything’s changed but the concept - So I’ll give you the top five coolest features. </p>\n<ol>\n<li><strong>Usertabs</strong> - These little suckers make it so easy to log into your Glubble user account. Simply click your tab and (if you’re a helper, kids don’t need passwords) enter your password to unlock Firefox. Oh, and the ability to auto-disable the browser lock has been added to.</li>\n<li><strong>Family Homepage</strong> - This is cool. You get your own family center where you can check out what your family’s been up to online and send each other little messages on your family wall.</li>\n<li><strong>The Glubble Library</strong> - The new Glubble Add-on comes with a whole load of “content bubbles” or Glubbles for your kids. These are basically groups of links that have been checked by our experts and are certified safe and fun for kids. The ability to create your own Glubbles and share them with family and friends is coming soon.</li>\n<li><strong>My Secret Homepage</strong> - Each child gets their own secret homepage containing all their most used content. They can also write on the family wall from here and pretty soon they’ll be other cool, customizable stuff they can do!</li>\n<li><strong>Visual Favorites</strong> - When a child adds a page to their Favorites (bookmarks) Glubble automagically creates a thumbnail of that page and puts it in their Bookmarks Bar for easy access. I want this Add-on for Firefox myself! It’s so much easier to remember what a site is from a screen shot rather than just a title.</li>\n</ol>\n<h2 id=\"try-glubble\">Try Glubble</h2>\n<p>If you’ve got young kids and you’d like to give Glubble Add-on for <a href=\"http://www.mozilla.com\">Firefox</a> a go. Then <a href=\"http://www.glubble.com\">get yourself a copy now</a>. It’s free! (maybe that should have been the top feature) ;-)</p>\n","html_snippet":{"s":"<p>{% include figure.html set=”glubble” class=”pull-both” %}</p><p>Since the beta launch last June the Glubble team have worked non-stop to create version 1.0 of the Glubble add-on for Firefox. If you detect a...</p>","orig":"<p>{% include figure.html set=”glubble” class=”pull-both” %}</p><p>Since the beta launch last June the Glubble team have worked non-stop to create version 1.0 of the Glubble add-on for Firefox. If you detect a...</p>","length":216}},{"attributes":{"date":"2007-11-06T00:00:00.000Z","title":"An Inappropriate Gift","section":"diary","introduction":"Recently my good friend's Paul and Esta popped their first sprog (well, Esta did most of the work I'm told) - And in traditional fashion I brought them a gift to celebrate. ","cover":"/assets/blog/covers/1890223951_b96fd56980_o.jpg","images":[{"image":"1890223951_b96fd56980_o.jpg","caption":"Smoking Baby","set":"baby"},{"image":"1798830018_93c0be6e2b_o.jpg","caption":"The day I met Amelie","set":"Amelie"}],"id":"28","type":"diary"},"body":"Recently my good friend's Paul and Esta popped their first sprog (well, Esta did most of the work I'm told) - And in traditional fashion I brought them a gift to celebrate. \n\n{% include figure.html class=\"pull-both\" set=\"baby\" %}\n\nIt's called 'Smoking Baby' and I'm sure if you want you can get one from somewhere on the net, but I got mine in Brighton. As you may imagine, I was chuffed to bits to [meet little Amelie](http://flickr.com/photos/roobottom/1798830018/) - she's gorgeous and despite myself I think I actually said \"Awwww\". I quickly had to talk about football to regain some equilibrium (not that I like football - it was just the first manly thing that came to mind). \n\n{% include figure.html class=\"pull-both\" set=\"Amelie\" %}\n\nBut seriously, she is amazing - even if she is making Katie broodier than ever. I was not so pleased to be asked to take back my gift though! I mean, come on, what self-respecting parent wouldn't want Baby smokes-a-lot around to teach their kid at an early age that smoking is not only sociably acceptable, but also makes you look cool. I'm surprised this little guy hasn't got a pair of gnarly shades or far out tattered jeans - Just look how cool he looks puffing away on that big tab. \n\nWell done proud parents - I bet you can't wait to see what I get her for Christmas!","html_body":"<p>Recently my good friend’s Paul and Esta popped their first sprog (well, Esta did most of the work I’m told) - And in traditional fashion I brought them a gift to celebrate. </p>\n<p>{% include figure.html class=”pull-both” set=”baby” %}</p>\n<p>It’s called ‘Smoking Baby’ and I’m sure if you want you can get one from somewhere on the net, but I got mine in Brighton. As you may imagine, I was chuffed to bits to <a href=\"http://flickr.com/photos/roobottom/1798830018/\">meet little Amelie</a> - she’s gorgeous and despite myself I think I actually said “Awwww”. I quickly had to talk about football to regain some equilibrium (not that I like football - it was just the first manly thing that came to mind). </p>\n<p>{% include figure.html class=”pull-both” set=”Amelie” %}</p>\n<p>But seriously, she is amazing - even if she is making Katie broodier than ever. I was not so pleased to be asked to take back my gift though! I mean, come on, what self-respecting parent wouldn’t want Baby smokes-a-lot around to teach their kid at an early age that smoking is not only sociably acceptable, but also makes you look cool. I’m surprised this little guy hasn’t got a pair of gnarly shades or far out tattered jeans - Just look how cool he looks puffing away on that big tab. </p>\n<p>Well done proud parents - I bet you can’t wait to see what I get her for Christmas!</p>\n","html_snippet":{"s":"<p>Recently my good friend’s Paul and Esta popped their first sprog (well, Esta did most of the work I’m told) - And in traditional fashion I brought them a gift to celebrate. </p><p>{% include figure.html class=”pull-both”...</p>","orig":"<p>Recently my good friend’s Paul and Esta popped their first sprog (well, Esta did most of the work I’m told) - And in traditional fashion I brought them a gift to celebrate. </p><p>{% include figure.html class=”pull-both”...</p>","length":230}},{"attributes":{"date":"2007-10-16T00:00:00.000Z","title":"Lake Garda, Italy","images":[{"image":"1586607502_2ae186c936_o.jpg","set":"lake","caption":"Me and her by the lake"},{"image":"1586170404_39ede07bdb_o.jpg","set":"lake2","caption":"Sirmione"},{"image":"1585611537_e540e1204f_o.jpg","set":"gondola","caption":"Gondola"}],"id":"27","type":"diary"},"body":"\nThe weather was warm, the food was amazing and the wine was cheep. After 7 nights in Italy drifting around Lake Garda, being awed (and a little romantic) in Verona and getting (very) lost in Venice the reality of being back to work has hit like a tonne of bricks. \n\n{% include figure.html set=\"lake\" class=\"pull-both\" %}\n\nBut I prefer to think of the amazing time we had. As we landed at the tiny Besica airport we realised that the turbulence we had just endured was in fact heavy rain that drenched us as we ran from the plane to the cover of the arrivals lounge. From there we found ourselves sitting in the hire car, rain pounding on the windscreen, trying to get used to the uneasy feeling of sitting in the passenger side with a steering wheel in front of me. By the time we reached [our hotel](http://www.mistralhotels.it/admiral.htm) we'd driven on three motorways and had a tiny disagreement with a barrier. \n\nThankfully the wing-mirror was unharmed and the rain had stopped to reveal blue sky. Things got even better when we got into our room - it was clean, big and had a balcony from which you could see the lake (sort of) through the trees. We spent the week exploring Lake Garda's small towns and excellent restaurants, and venturing out to Verona and eventually Venice after planning to go on Wednesday and finally getting there on Friday - Due to a couple of days missing the train. Whoops! \n\n{% include figure.html set=\"lake2\" class=\"pull-both\" %}\n\n\nMy favourite place by far was Sirmione which was at the end of an tiny outcrop of land that juts into the south end of the lake. We spent an evening at the naturally heated [spa](http://www.termedisirmione.it/tds/en/homepage.html) followed by dinner at [L'Archimboldo](http://www.ristorantearcimboldo.com/) run by a really friendly guy who's English was better than ours. If you're going to Lake Garda Sirmione is a must. \n\n{% include figure.html set=\"gondola\" class=\"pull-both\" %} \n\nVenice was amazing. Stepping out of the station, you're immediately greeted with throngs of people walking up and down the banks of the Grand Canal. Wow! We took a water taxi up to St. Marks Square and stopped for lunch and some shelter from the hot-hot sun before we ventured into St Mark's Basilica and mooched around the Square, avoiding the millions of pigeons that randomly landed on anyone they fancied, whether they had food or not. \n\nWe then set off around the labyrinth-like city on foot, exploring the seemingly unending passageways and tiny bridges. Needless to say we got horribly lost, and only just made our train back to the hotel. But I loved Venice, a day was just not enough. In usual style, I took nearly 700 photos - and you can [see some of them over at flickr](http://www.flickr.com/photos/roobottom/sets/72157602449502521/). \n\nOh well, back to reality I suppose.","html_body":"<p>The weather was warm, the food was amazing and the wine was cheep. After 7 nights in Italy drifting around Lake Garda, being awed (and a little romantic) in Verona and getting (very) lost in Venice the reality of being back to work has hit like a tonne of bricks. </p>\n<p>{% include figure.html set=”lake” class=”pull-both” %}</p>\n<p>But I prefer to think of the amazing time we had. As we landed at the tiny Besica airport we realised that the turbulence we had just endured was in fact heavy rain that drenched us as we ran from the plane to the cover of the arrivals lounge. From there we found ourselves sitting in the hire car, rain pounding on the windscreen, trying to get used to the uneasy feeling of sitting in the passenger side with a steering wheel in front of me. By the time we reached <a href=\"http://www.mistralhotels.it/admiral.htm\">our hotel</a> we’d driven on three motorways and had a tiny disagreement with a barrier. </p>\n<p>Thankfully the wing-mirror was unharmed and the rain had stopped to reveal blue sky. Things got even better when we got into our room - it was clean, big and had a balcony from which you could see the lake (sort of) through the trees. We spent the week exploring Lake Garda’s small towns and excellent restaurants, and venturing out to Verona and eventually Venice after planning to go on Wednesday and finally getting there on Friday - Due to a couple of days missing the train. Whoops! </p>\n<p>{% include figure.html set=”lake2” class=”pull-both” %}</p>\n<p>My favourite place by far was Sirmione which was at the end of an tiny outcrop of land that juts into the south end of the lake. We spent an evening at the naturally heated <a href=\"http://www.termedisirmione.it/tds/en/homepage.html\">spa</a> followed by dinner at <a href=\"http://www.ristorantearcimboldo.com/\">L’Archimboldo</a> run by a really friendly guy who’s English was better than ours. If you’re going to Lake Garda Sirmione is a must. </p>\n<p>{% include figure.html set=”gondola” class=”pull-both” %} </p>\n<p>Venice was amazing. Stepping out of the station, you’re immediately greeted with throngs of people walking up and down the banks of the Grand Canal. Wow! We took a water taxi up to St. Marks Square and stopped for lunch and some shelter from the hot-hot sun before we ventured into St Mark’s Basilica and mooched around the Square, avoiding the millions of pigeons that randomly landed on anyone they fancied, whether they had food or not. </p>\n<p>We then set off around the labyrinth-like city on foot, exploring the seemingly unending passageways and tiny bridges. Needless to say we got horribly lost, and only just made our train back to the hotel. But I loved Venice, a day was just not enough. In usual style, I took nearly 700 photos - and you can <a href=\"http://www.flickr.com/photos/roobottom/sets/72157602449502521/\">see some of them over at flickr</a>. </p>\n<p>Oh well, back to reality I suppose.</p>\n","html_snippet":{"s":"<p>The weather was warm, the food was amazing and the wine was cheep. After 7 nights in Italy drifting around Lake Garda, being awed (and a little romantic) in Verona and getting (very) lost in Venice the...</p>","orig":"<p>The weather was warm, the food was amazing and the wine was cheep. After 7 nights in Italy drifting around Lake Garda, being awed (and a little romantic) in Verona and getting (very) lost in Venice the...</p>","length":211}},{"attributes":{"date":"2007-09-11T00:00:00.000Z","title":"Pimp My Attitude","id":"26","type":"diary"},"body":"Last week I received a random e-mail from a lady calling herself \"Yummy Mummy\" that simply said...\n\n> I have written about you, I hope you like it. x.\n\nSo with trepidation, I clicked on [the link](http://pimpmydaughter.wordpress.com/2007/09/04/jon-roobottom-the-churchgoing-hunk/). At this point, it's worth pointing out that I don't know this person, or had never had any contact with her before in my life. And yes, I'm aware how much you guys are going to take the p**s. \n\nIt took me a while to work out what the hell was going on here. Apparently this woman, writing under the pseudonym of Yummy Mummy writes about \"Amelia\" her 18 year old daughter and how she needs to basically be more wise in the way of men. Its pretty weird stuff and morally questionable to say the least, but after a few emails to \"Yummy\" (staring with me asking 'are you for real?') I was assured that this wasn't real, and was just to provoke interest in her blog.\n\n\nSo needless to say, I don't agree with what this woman is doing, but she has a much right to write what she thinks as the next guy.. um, gal. I saw absolutely no point in sending her a message judging her for her actions. Then I received an email from Rose DesRochers who writes quite a [nice little blog](http://rosedesrochers.todays-woman.net/) and also runs [Today's Womans Writing Community](http://www.todays-woman.net/). She was trying to get me to force \"Yummy\" to take my photo off her blog. She seems to have quite a lot of anger about Pimp My Daughter, which I guess I can understand. However she did rather go off on one about how she thought that all MEN (yes, capitals) just saw a joke in this. \n\nI did rather feel caught in the middle, forced to take sides on an issue that I'd never really considered before. And I suspect that far from farming her daughter out \"Yummy\" is actually just massively taking the p**s.","html_body":"<p>Last week I received a random e-mail from a lady calling herself “Yummy Mummy” that simply said…</p>\n<blockquote>\n<p>I have written about you, I hope you like it. x.</p>\n</blockquote>\n<p>So with trepidation, I clicked on <a href=\"http://pimpmydaughter.wordpress.com/2007/09/04/jon-roobottom-the-churchgoing-hunk/\">the link</a>. At this point, it’s worth pointing out that I don’t know this person, or had never had any contact with her before in my life. And yes, I’m aware how much you guys are going to take the p**s. </p>\n<p>It took me a while to work out what the hell was going on here. Apparently this woman, writing under the pseudonym of Yummy Mummy writes about “Amelia” her 18 year old daughter and how she needs to basically be more wise in the way of men. Its pretty weird stuff and morally questionable to say the least, but after a few emails to “Yummy” (staring with me asking ‘are you for real?’) I was assured that this wasn’t real, and was just to provoke interest in her blog.</p>\n<p>So needless to say, I don’t agree with what this woman is doing, but she has a much right to write what she thinks as the next guy.. um, gal. I saw absolutely no point in sending her a message judging her for her actions. Then I received an email from Rose DesRochers who writes quite a <a href=\"http://rosedesrochers.todays-woman.net/\">nice little blog</a> and also runs <a href=\"http://www.todays-woman.net/\">Today’s Womans Writing Community</a>. She was trying to get me to force “Yummy” to take my photo off her blog. She seems to have quite a lot of anger about Pimp My Daughter, which I guess I can understand. However she did rather go off on one about how she thought that all MEN (yes, capitals) just saw a joke in this. </p>\n<p>I did rather feel caught in the middle, forced to take sides on an issue that I’d never really considered before. And I suspect that far from farming her daughter out “Yummy” is actually just massively taking the p**s.</p>\n","html_snippet":{"s":"<p>Last week I received a random e-mail from a lady calling herself “Yummy Mummy” that simply said…</p><blockquote><p>I have written about you, I hope you like it. x.</p></blockquote><p>So with trepidation, I clicked on <a href=\"http://pimpmydaughter.wordpress.com/2007/09/04/jon-roobottom-the-churchgoing-hunk/\">the link</a>. At this point,...</p>","orig":"<p>Last week I received a random e-mail from a lady calling herself “Yummy Mummy” that simply said…</p><blockquote><p>I have written about you, I hope you like it. x.</p></blockquote><p>So with trepidation, I clicked on <a href=\"http://pimpmydaughter.wordpress.com/2007/09/04/jon-roobottom-the-churchgoing-hunk/\">the link</a>. At this point,...</p>","length":348}},{"attributes":{"date":"2007-04-26T00:00:00.000Z","title":"Kidz Klub Coalpool","images":[{"image":"473616523_54bbc19737_o.jpg","set":"hannah","caption":"Hannah painting the boards"}],"id":"25","type":"diary"},"body":"I've been involved in Kidz Klub (admittedly on and off) in [Coalpool](http://en.wikipedia.org/wiki/Coalpool) for a while now, and this year I got to design the boards we use as a backdrop to the games we play with the local kids. \n\nI've loved working with the whole team over the last couple of years, and all credit to Esther, Sarah and the guys for the sterling work they do. Unfortunately, we're up against it as Walsall Council in their wisdom have decided to stop charging us the £20 per week rent we used to pay and increase it to £100! How nice of them. Obviously the KK needs to keep going, so any fundraising ideas (or indeed donations) are gratefully received. \n\n{% include figure.html class=\"pull-both\" set=\"hannah\" %}\n\nI put together the original design in good old Fireworks, the design was then transferred onto the boards using a combination of bits of string, pencils and one massive ruler. Hannah then got to work painting.\n\nThe finished thing (although not quite the same as the original) turned out alright. Dee provided some laminate stickers for the [4 points](http://www.the4points.com/) (which looked awesome, thanks Dee). \n\nPhotos of the whole process are [this way...](http://www.flickr.com/photos/roobottom/sets/72157600133942448/)","html_body":"<p>I’ve been involved in Kidz Klub (admittedly on and off) in <a href=\"http://en.wikipedia.org/wiki/Coalpool\">Coalpool</a> for a while now, and this year I got to design the boards we use as a backdrop to the games we play with the local kids. </p>\n<p>I’ve loved working with the whole team over the last couple of years, and all credit to Esther, Sarah and the guys for the sterling work they do. Unfortunately, we’re up against it as Walsall Council in their wisdom have decided to stop charging us the £20 per week rent we used to pay and increase it to £100! How nice of them. Obviously the KK needs to keep going, so any fundraising ideas (or indeed donations) are gratefully received. </p>\n<p>{% include figure.html class=”pull-both” set=”hannah” %}</p>\n<p>I put together the original design in good old Fireworks, the design was then transferred onto the boards using a combination of bits of string, pencils and one massive ruler. Hannah then got to work painting.</p>\n<p>The finished thing (although not quite the same as the original) turned out alright. Dee provided some laminate stickers for the <a href=\"http://www.the4points.com/\">4 points</a> (which looked awesome, thanks Dee). </p>\n<p>Photos of the whole process are <a href=\"http://www.flickr.com/photos/roobottom/sets/72157600133942448/\">this way…</a></p>\n","html_snippet":{"s":"<p>I’ve been involved in Kidz Klub (admittedly on and off) in <a href=\"http://en.wikipedia.org/wiki/Coalpool\">Coalpool</a> for a while now, and this year I got to design the boards we use as a backdrop to the games we play with the local kids. </p><p>I’ve loved...</p>","orig":"<p>I’ve been involved in Kidz Klub (admittedly on and off) in <a href=\"http://en.wikipedia.org/wiki/Coalpool\">Coalpool</a> for a while now, and this year I got to design the boards we use as a backdrop to the games we play with the local kids. </p><p>I’ve loved...</p>","length":268}},{"attributes":{"date":"2007-04-11T00:00:00.000Z","title":"Glaxstar","id":"24","type":"diary"},"body":"I'm making a career move! After three happy years at [Trinity Design](http://www.trinitydesign.co.uk) I'm joining [Glaxstar](http://www.glaxstar.com) as thier web designer / interface person / possible tea maker, and I can't flippin wait! While this sees me not making my much anticipated move down south, it is the sort of opportunity I've been waiting for after Paul's had his [Ning Thing](http://lloydyweb.com/blog/2006/02/that_ning_thing.php) now it's time for a bit of Glaxstar action. There's some pretty big things in the pipeline so keep your eye on the website for the next few months as Glaxstar unleash their new \"big thing\" on the world. ;-)","html_body":"<p>I’m making a career move! After three happy years at <a href=\"http://www.trinitydesign.co.uk\">Trinity Design</a> I’m joining <a href=\"http://www.glaxstar.com\">Glaxstar</a> as thier web designer / interface person / possible tea maker, and I can’t flippin wait! While this sees me not making my much anticipated move down south, it is the sort of opportunity I’ve been waiting for after Paul’s had his <a href=\"http://lloydyweb.com/blog/2006/02/that_ning_thing.php\">Ning Thing</a> now it’s time for a bit of Glaxstar action. There’s some pretty big things in the pipeline so keep your eye on the website for the next few months as Glaxstar unleash their new “big thing” on the world. ;-)</p>\n","html_snippet":{"s":"<p>I’m making a career move! After three happy years at <a href=\"http://www.trinitydesign.co.uk\">Trinity Design</a> I’m joining <a href=\"http://www.glaxstar.com\">Glaxstar</a> as thier web designer / interface person / possible tea maker, and I can’t flippin wait! While this sees me not...</p>","orig":"<p>I’m making a career move! After three happy years at <a href=\"http://www.trinitydesign.co.uk\">Trinity Design</a> I’m joining <a href=\"http://www.glaxstar.com\">Glaxstar</a> as thier web designer / interface person / possible tea maker, and I can’t flippin wait! While this sees me not...</p>","length":293}},{"attributes":{"date":"2006-10-23T00:00:00.000Z","title":"The Little Chef breakfast in review","images":[{"image":"277140443_f94c7417a6_o.jpg","set":"photo","caption":"Eggs? Are you sure?"}],"id":"23","type":"diary"},"body":"The place? Little Chef, Oxford Peartree Services, A34, England. \n\nThe breakfast? A sausage, a rasher of bacon, a hash brown, baked beans and scrambled \"eggs\". \n\n{% include figure.html set=\"photo\" class=\"pull-both\" %}\n\nIn an attempt to bring you wholly interesting and original content, here is a review of a breakfast I ate while visiting the very fine and historical town of Oxford. Traditionally the Little Chef was something that filled my heart with dread, the childhood memories of long car journeys and sweaty pancakes are still all to clear in my mind. \n\nIt was with a sense of trepidation that I boldly ordered a \"early starter\" (it was 12 noon) breakfast. To be fair it was mainly yum, and the hash brown (an old Roobottom family favourite) went down a treat.\n\nIt was only when I came to consume what I could only presume to be scrambled eggs that things started to look down. As you may be able to see from the photograph, the eggs were very skilfully avoided while the rest of the breakfast was polished off with aplomb. So, there you have it, another exciting incite to the wonderful world of Roobottom.","html_body":"<p>The place? Little Chef, Oxford Peartree Services, A34, England. </p>\n<p>The breakfast? A sausage, a rasher of bacon, a hash brown, baked beans and scrambled “eggs”. </p>\n<p>{% include figure.html set=”photo” class=”pull-both” %}</p>\n<p>In an attempt to bring you wholly interesting and original content, here is a review of a breakfast I ate while visiting the very fine and historical town of Oxford. Traditionally the Little Chef was something that filled my heart with dread, the childhood memories of long car journeys and sweaty pancakes are still all to clear in my mind. </p>\n<p>It was with a sense of trepidation that I boldly ordered a “early starter” (it was 12 noon) breakfast. To be fair it was mainly yum, and the hash brown (an old Roobottom family favourite) went down a treat.</p>\n<p>It was only when I came to consume what I could only presume to be scrambled eggs that things started to look down. As you may be able to see from the photograph, the eggs were very skilfully avoided while the rest of the breakfast was polished off with aplomb. So, there you have it, another exciting incite to the wonderful world of Roobottom.</p>\n","html_snippet":{"s":"<p>The place? Little Chef, Oxford Peartree Services, A34, England. </p><p>The breakfast? A sausage, a rasher of bacon, a hash brown, baked beans and scrambled “eggs”. </p><p>{% include figure.html set=”photo” class=”pull-both”...</p>","orig":"<p>The place? Little Chef, Oxford Peartree Services, A34, England. </p><p>The breakfast? A sausage, a rasher of bacon, a hash brown, baked beans and scrambled “eggs”. </p><p>{% include figure.html set=”photo” class=”pull-both”...</p>","length":233}},{"attributes":{"date":"2006-10-09T00:00:00.000Z","title":"Where Will I Be?","id":"22","type":"diary"},"body":"Next month sees a popular [sxsw](http://2007.sxsw.com/) event get it's UK premier in London. [20x2](http://www.20x2.org/) is 20 people given two minutes each to answer the same question, and I've taken the plunge and agreed to speak. \n\nThe title of this months 20x2 is: \"where am I?\". To be honest I haven't got the first idea of what to say (or even if they'll understand the Brummy dribble that will fall from my mouth). I'm excited, but know it could be brown trousers time on the night. \n\nMaybe that's where i'll be... on the loo. If you're free on Sunday, 19th November and in the London area, come along to [Madame JoJo's at 7pm, should be a good night (at least the other guy's will be entertaining).","html_body":"<p>Next month sees a popular <a href=\"http://2007.sxsw.com/\">sxsw</a> event get it’s UK premier in London. <a href=\"http://www.20x2.org/\">20x2</a> is 20 people given two minutes each to answer the same question, and I’ve taken the plunge and agreed to speak. </p>\n<p>The title of this months 20x2 is: “where am I?”. To be honest I haven’t got the first idea of what to say (or even if they’ll understand the Brummy dribble that will fall from my mouth). I’m excited, but know it could be brown trousers time on the night. </p>\n<p>Maybe that’s where i’ll be… on the loo. If you’re free on Sunday, 19th November and in the London area, come along to [Madame JoJo’s at 7pm, should be a good night (at least the other guy’s will be entertaining).</p>\n","html_snippet":{"s":"<p>Next month sees a popular <a href=\"http://2007.sxsw.com/\">sxsw</a> event get it’s UK premier in London. <a href=\"http://www.20x2.org/\">20x2</a> is 20 people given two minutes each to answer the same question, and I’ve taken the plunge and agreed to speak. </p><p>The title of this...</p>","orig":"<p>Next month sees a popular <a href=\"http://2007.sxsw.com/\">sxsw</a> event get it’s UK premier in London. <a href=\"http://www.20x2.org/\">20x2</a> is 20 people given two minutes each to answer the same question, and I’ve taken the plunge and agreed to speak. </p><p>The title of this...</p>","length":290}},{"attributes":{"date":"2006-09-21T00:00:00.000Z","title":"A Pound For The Mound","id":"21","type":"diary"},"body":"Sunday saw me and Katie meeting half-way between our two home towns in Oxford (yeah, long distance relationships are a bitch). And man, the weather for late September was amazing! So off we trottled on the open top bus, and had a day of touristy-magic. Including a trip to the [Turf Tavern](http://www.theturftavern.co.uk/), a pub which was unsurprisingly full of American tourists and Oxford students *not* having the kind of conversations that I remember from University. \n\nBut not _just_ that, oh no, not me and Katie! We went all out crazy-go-nuts on the tourist trail stopping off at the [Oxford Story](http://www.oxfordstory.co.uk) a trip back 900 years into Oxford history, and then (much to [Katie's delight](http://www.flickr.com/photos/roobottom/248933596/)) a bit of shopping at [Alice's Shop](http://www.sheepshop.com). But, I think the pinnacle of the day was [Oxford Castle Mound](http://www.flickr.com/photos/roobottom/246535043/). \n\nNot that the mound itself was that amazing, just a lot of dirt, but the security system for keeping people who'd not paid the one pound entry fee was pretty much state of the art. To get on the mound you first have to go in the shop and buy yourself a ticket. Upon exiting the shop you then make your way to the mound itself. Before ye can pass, ye must buzz the buzzer on the 5 foot (possibly electrified) gate. Then, when your identification has been verified using a series of voice and DNA checks, the gate is opened electronically. \n\nAs we came down the mound we passed a guy who'd obviously missed the sign that said: \"This mound costs a pound\" and was chased down by the huge guy who worked in the shop. I wouldn't have liked to get on the wrong side of him! \n\nSo was the mound worth a pound? Well, we damn well made sure we got our money's worth! A whole 30 minutes we sat on the mound. It was quite a moving experience.","html_body":"<p>Sunday saw me and Katie meeting half-way between our two home towns in Oxford (yeah, long distance relationships are a bitch). And man, the weather for late September was amazing! So off we trottled on the open top bus, and had a day of touristy-magic. Including a trip to the <a href=\"http://www.theturftavern.co.uk/\">Turf Tavern</a>, a pub which was unsurprisingly full of American tourists and Oxford students <em>not</em> having the kind of conversations that I remember from University. </p>\n<p>But not <em>just</em> that, oh no, not me and Katie! We went all out crazy-go-nuts on the tourist trail stopping off at the <a href=\"http://www.oxfordstory.co.uk\">Oxford Story</a> a trip back 900 years into Oxford history, and then (much to <a href=\"http://www.flickr.com/photos/roobottom/248933596/\">Katie’s delight</a>) a bit of shopping at <a href=\"http://www.sheepshop.com\">Alice’s Shop</a>. But, I think the pinnacle of the day was <a href=\"http://www.flickr.com/photos/roobottom/246535043/\">Oxford Castle Mound</a>. </p>\n<p>Not that the mound itself was that amazing, just a lot of dirt, but the security system for keeping people who’d not paid the one pound entry fee was pretty much state of the art. To get on the mound you first have to go in the shop and buy yourself a ticket. Upon exiting the shop you then make your way to the mound itself. Before ye can pass, ye must buzz the buzzer on the 5 foot (possibly electrified) gate. Then, when your identification has been verified using a series of voice and DNA checks, the gate is opened electronically. </p>\n<p>As we came down the mound we passed a guy who’d obviously missed the sign that said: “This mound costs a pound” and was chased down by the huge guy who worked in the shop. I wouldn’t have liked to get on the wrong side of him! </p>\n<p>So was the mound worth a pound? Well, we damn well made sure we got our money’s worth! A whole 30 minutes we sat on the mound. It was quite a moving experience.</p>\n","html_snippet":{"s":"<p>Sunday saw me and Katie meeting half-way between our two home towns in Oxford (yeah, long distance relationships are a bitch). And man, the weather for late September was amazing! So off we trottled on...</p>","orig":"<p>Sunday saw me and Katie meeting half-way between our two home towns in Oxford (yeah, long distance relationships are a bitch). And man, the weather for late September was amazing! So off we trottled on...</p>","length":211}},{"attributes":{"date":"2006-07-24T00:00:00.000Z","title":"Bakewell Weekender","images":[{"image":"bakewell-weekend.jpg","set":"photo"}],"id":"20","type":"diary"},"body":"{% include figure.html set=\"photo\" class=\"pull-both\" %}\n\nHas it really been over 12 months since I last went camping? But it was certainly worth the wait! Last week we'd had some of the hottest temperatures on record, and looking forward to a camp weekend was just the thing I needed to get me through the work week. As the weekend approached, it got hotter and hotter and as temperatures soared to the mid 30s the good old BBC weather told me there was torrential rain forecast for Saturday in Derbyshire. \n\nWell, the weather didn't disappoint! Amazing lightening and the welcome refreshment the rain brought just added to the fun of the weekend. So as the rain set in we decided to visit some caves called the [Devil's Arse](http://www.peakcavern.co.uk/), so called because of the wet farting noises the river makes when it's draining away post-flood. Unfortunately we didn't get to hear the cave's flatulence, but we did have a very interesting cave guide. She was magnificent to say the least! Anyway, we got some [cool](http://www.flickr.com/photos/roobottom/sets/72157594209815542/) [photos](http://www.flickr.com/photos/magic_dan/sets/72157594210415711/), so if you're interested have yourself a look.","html_body":"<p>{% include figure.html set=”photo” class=”pull-both” %}</p>\n<p>Has it really been over 12 months since I last went camping? But it was certainly worth the wait! Last week we’d had some of the hottest temperatures on record, and looking forward to a camp weekend was just the thing I needed to get me through the work week. As the weekend approached, it got hotter and hotter and as temperatures soared to the mid 30s the good old BBC weather told me there was torrential rain forecast for Saturday in Derbyshire. </p>\n<p>Well, the weather didn’t disappoint! Amazing lightening and the welcome refreshment the rain brought just added to the fun of the weekend. So as the rain set in we decided to visit some caves called the <a href=\"http://www.peakcavern.co.uk/\">Devil’s Arse</a>, so called because of the wet farting noises the river makes when it’s draining away post-flood. Unfortunately we didn’t get to hear the cave’s flatulence, but we did have a very interesting cave guide. She was magnificent to say the least! Anyway, we got some <a href=\"http://www.flickr.com/photos/roobottom/sets/72157594209815542/\">cool</a> <a href=\"http://www.flickr.com/photos/magic_dan/sets/72157594210415711/\">photos</a>, so if you’re interested have yourself a look.</p>\n","html_snippet":{"s":"<p>{% include figure.html set=”photo” class=”pull-both” %}</p><p>Has it really been over 12 months since I last went camping? But it was certainly worth the wait! Last week we’d had some of the hottest temperatures...</p>","orig":"<p>{% include figure.html set=”photo” class=”pull-both” %}</p><p>Has it really been over 12 months since I last went camping? But it was certainly worth the wait! Last week we’d had some of the hottest temperatures...</p>","length":221}},{"attributes":{"date":"2006-07-18T00:00:00.000Z","title":"Kings Bromley's Burning","images":[{"image":"bromley-fire-1.jpg","set":"fire1"},{"image":"bromley-fire-2.jpg","set":"fire2"}],"id":"19","type":"diary"},"body":"I work in a little village just outside of Lichfield called Kings Bromley. Usually it's a sleepy little place, the local pub only opens 4 days a week. But yesterday afternoon, I looked up from my desk to see this... \n\n{% include figure.html set=\"fire1\" class=\"pull-both\" %}\n\nWithin minutes our usually quiet little lane had become packed with cars and people all clammering to get a look at what apparently was a major event for Kings Bromley. By now the fire had spread beyond what you can see in the photo, but I decided that if I didn't get out now, I may never leave. Not because of the fire (although it was massive, and the noise it made was awesome) but just the shear volume of people. When I (eventually) pulled on to the main road, and made my way back along past the fire there was about 20 cars stopped trying to get a glimpse of what was going on. \n\nBy now there were about 6 fire engines, plus some guy with a vat of water on a trailer (I dunno what he thought he could do with that). This morning there was no sign of the festival like atmosphere of last night, just a sad smouldering mess in the top field. Still, I guess the ground will be mega fertile now... \n\n{% include figure.html set=\"fire2\" class=\"pull-both\" %}\n\n**Update:** As the fire damaged the power-lines, I got the afternoon off!","html_body":"<p>I work in a little village just outside of Lichfield called Kings Bromley. Usually it’s a sleepy little place, the local pub only opens 4 days a week. But yesterday afternoon, I looked up from my desk to see this… </p>\n<p>{% include figure.html set=”fire1” class=”pull-both” %}</p>\n<p>Within minutes our usually quiet little lane had become packed with cars and people all clammering to get a look at what apparently was a major event for Kings Bromley. By now the fire had spread beyond what you can see in the photo, but I decided that if I didn’t get out now, I may never leave. Not because of the fire (although it was massive, and the noise it made was awesome) but just the shear volume of people. When I (eventually) pulled on to the main road, and made my way back along past the fire there was about 20 cars stopped trying to get a glimpse of what was going on. </p>\n<p>By now there were about 6 fire engines, plus some guy with a vat of water on a trailer (I dunno what he thought he could do with that). This morning there was no sign of the festival like atmosphere of last night, just a sad smouldering mess in the top field. Still, I guess the ground will be mega fertile now… </p>\n<p>{% include figure.html set=”fire2” class=”pull-both” %}</p>\n<p><strong>Update:</strong> As the fire damaged the power-lines, I got the afternoon off!</p>\n","html_snippet":{"s":"<p>I work in a little village just outside of Lichfield called Kings Bromley. Usually it’s a sleepy little place, the local pub only opens 4 days a week. But yesterday afternoon, I looked up from my desk...</p>","orig":"<p>I work in a little village just outside of Lichfield called Kings Bromley. Usually it’s a sleepy little place, the local pub only opens 4 days a week. But yesterday afternoon, I looked up from my desk...</p>","length":210}},{"attributes":{"date":"2006-04-10T00:00:00.000Z","title":"Genius","images":[{"image":"corona.jpg","set":"game"}],"id":"18","type":"diary"},"body":"One of the last things we did in our first year at University was to create some \"kick ass\" flash games. I'd almost forgotten the genius that was Ross' \"Corona Fighting\" until he e-mailed it to me the other day.\n\n{% include figure.html set=\"game\" class=\"u-boxout pull-left\" image_size=\"small\" %}\n\nEverything about this game out classed the rest of our efforts (except maybe Huggies Coconut Stall - that thing was class). The sights, the sounds! The thrills, the spills! This is the ultimate panda fighting game, forget your Street Fighters, the future is here. \n\nYou can [play the game](http://www.roobottom.com/downloads/ross_game/game1.html) (you may have to click on the actual game window before you fight) or [watch the introduction](http://www.roobottom.com/downloads/ross_game/introduction.html). The keys you say? Well, simply use the arrow keys to move left and right and jump, and to kick some ass use Q and A. Old skool. I'm expecting to be inundated with comments with this one. It's amazing!","html_body":"<p>One of the last things we did in our first year at University was to create some “kick ass” flash games. I’d almost forgotten the genius that was Ross’ “Corona Fighting” until he e-mailed it to me the other day.</p>\n<p>{% include figure.html set=”game” class=”u-boxout pull-left” image_size=”small” %}</p>\n<p>Everything about this game out classed the rest of our efforts (except maybe Huggies Coconut Stall - that thing was class). The sights, the sounds! The thrills, the spills! This is the ultimate panda fighting game, forget your Street Fighters, the future is here. </p>\n<p>You can <a href=\"http://www.roobottom.com/downloads/ross_game/game1.html\">play the game</a> (you may have to click on the actual game window before you fight) or <a href=\"http://www.roobottom.com/downloads/ross_game/introduction.html\">watch the introduction</a>. The keys you say? Well, simply use the arrow keys to move left and right and jump, and to kick some ass use Q and A. Old skool. I’m expecting to be inundated with comments with this one. It’s amazing!</p>\n","html_snippet":{"s":"<p>One of the last things we did in our first year at University was to create some “kick ass” flash games. I’d almost forgotten the genius that was Ross’ “Corona Fighting” until he e-mailed it to me the...</p>","orig":"<p>One of the last things we did in our first year at University was to create some “kick ass” flash games. I’d almost forgotten the genius that was Ross’ “Corona Fighting” until he e-mailed it to me the...</p>","length":210}},{"attributes":{"date":"2006-04-05T00:00:00.000Z","title":"These Things, I'm Thankful For","id":"17","type":"diary"},"body":"We watched the [Constant Gardener](http://www.imdb.com/title/tt0387131/) last Tuesday night, which Paul told me was called the Uphill Gardener so really didn't want to watch it. For those who haven't seen it, I really would recommend giving it a go, I'm not going to bother explaining the plot (you can read about it on imdb if you're really that interested) but suffice to say its set in Africa, and shows in no uncertain terms the sometimes brutal existence that people live. \n\nThe film catalysed me into writing about something I've been thinking about for the last few weeks: How privileged I am. When McClegg got back from India, he had lots of stories about the absolute poverty that people find themselves in. I can't even begin to imagine living that life, the gulf between my luxury existence and the hand-to-mouth living that many of this world's inhabitants endure is almost insurmountable. As the old saying goes...\n\n> It could be worse\n\n ...and yes indeed it could be a lot worse. So this got me thinking about \"accident\" of birth. Is it pure chance that you are born into the family and circumstances you have? Does God control it? If so, it may seem a little unfair that I'm enjoying my decadent life while there are people suffering all over the world from a variety of different evils. I guess we could look at the \"big\" picture and say that everyone is dying, and the only purpose of this life is to drive us closer to our maker / the answers / any other generic thing that we as a species seek on a day-to-day basis. I'll admit, I don't have the first idea.","html_body":"<p>We watched the <a href=\"http://www.imdb.com/title/tt0387131/\">Constant Gardener</a> last Tuesday night, which Paul told me was called the Uphill Gardener so really didn’t want to watch it. For those who haven’t seen it, I really would recommend giving it a go, I’m not going to bother explaining the plot (you can read about it on imdb if you’re really that interested) but suffice to say its set in Africa, and shows in no uncertain terms the sometimes brutal existence that people live. </p>\n<p>The film catalysed me into writing about something I’ve been thinking about for the last few weeks: How privileged I am. When McClegg got back from India, he had lots of stories about the absolute poverty that people find themselves in. I can’t even begin to imagine living that life, the gulf between my luxury existence and the hand-to-mouth living that many of this world’s inhabitants endure is almost insurmountable. As the old saying goes…</p>\n<blockquote>\n<p>It could be worse</p>\n</blockquote>\n<p> …and yes indeed it could be a lot worse. So this got me thinking about “accident” of birth. Is it pure chance that you are born into the family and circumstances you have? Does God control it? If so, it may seem a little unfair that I’m enjoying my decadent life while there are people suffering all over the world from a variety of different evils. I guess we could look at the “big” picture and say that everyone is dying, and the only purpose of this life is to drive us closer to our maker / the answers / any other generic thing that we as a species seek on a day-to-day basis. I’ll admit, I don’t have the first idea.</p>\n","html_snippet":{"s":"<p>We watched the <a href=\"http://www.imdb.com/title/tt0387131/\">Constant Gardener</a> last Tuesday night, which Paul told me was called the Uphill Gardener so really didn’t want to watch it. For those who haven’t seen it, I really would recommend giving...</p>","orig":"<p>We watched the <a href=\"http://www.imdb.com/title/tt0387131/\">Constant Gardener</a> last Tuesday night, which Paul told me was called the Uphill Gardener so really didn’t want to watch it. For those who haven’t seen it, I really would recommend giving...</p>","length":261}},{"attributes":{"date":"2006-03-22T00:00:00.000Z","title":"Jon's School Days","id":"16","type":"diary"},"body":"I had such an awesome day yesterday as Josie very kindly let me shadow her teach. Yeah, I was a bit nervous but also dead excited to be out of the office and having fun with a bunch of kids all day. \n\nSome of you will know that it's crossed my mind to go do teacher training in September, so wanted to see what it was all about before I signed up to anything. It's weird seeing one of your friends tech a bunch of 8 and 9 year old, to me it doesn't seem all that long ago that I was their age. I was really impressed with the way she controlled the class, and the obvious affection the kids had for her. \n\nI've got to say, teachers work damn hard. They work their collective asses off. Which is a bit of a sticking point for me. It's not that I'm adverse to a bit of hard work (ahem) but quite a lot of the paperwork seems so unnecessary. I can't imagine anyone becoming a teacher unless they had a passion for working with kids, and the government seems to be squashing this by putting undue pressure on hard working school staff. I'm not really ruling out teaching as a possibility, but I've spoken to entirely too many people in the profession that are bitter about the workload. \n\nI dunno, we'll see. It'd be good to check out a few more schools (and years) first I think. The best bit of the day for me was thirty-five manic kids singing me the bumblebee song. Awesome!","html_body":"<p>I had such an awesome day yesterday as Josie very kindly let me shadow her teach. Yeah, I was a bit nervous but also dead excited to be out of the office and having fun with a bunch of kids all day. </p>\n<p>Some of you will know that it’s crossed my mind to go do teacher training in September, so wanted to see what it was all about before I signed up to anything. It’s weird seeing one of your friends tech a bunch of 8 and 9 year old, to me it doesn’t seem all that long ago that I was their age. I was really impressed with the way she controlled the class, and the obvious affection the kids had for her. </p>\n<p>I’ve got to say, teachers work damn hard. They work their collective asses off. Which is a bit of a sticking point for me. It’s not that I’m adverse to a bit of hard work (ahem) but quite a lot of the paperwork seems so unnecessary. I can’t imagine anyone becoming a teacher unless they had a passion for working with kids, and the government seems to be squashing this by putting undue pressure on hard working school staff. I’m not really ruling out teaching as a possibility, but I’ve spoken to entirely too many people in the profession that are bitter about the workload. </p>\n<p>I dunno, we’ll see. It’d be good to check out a few more schools (and years) first I think. The best bit of the day for me was thirty-five manic kids singing me the bumblebee song. Awesome!</p>\n","html_snippet":{"s":"<p>I had such an awesome day yesterday as Josie very kindly let me shadow her teach. Yeah, I was a bit nervous but also dead excited to be out of the office and having fun with a bunch of kids all day. </p><p>Some...</p>","orig":"<p>I had such an awesome day yesterday as Josie very kindly let me shadow her teach. Yeah, I was a bit nervous but also dead excited to be out of the office and having fun with a bunch of kids all day. </p><p>Some...</p>","length":220}},{"attributes":{"date":"2006-03-10T00:00:00.000Z","title":"The Boosh!","id":"15","type":"diary"},"body":"The Mighty Boosh? Wolverhampton Civic Hall? 9th March 2006? 7 O'clock? Yes, we'll have a bit of that.\n\n\nAlthough I've only even seen one episode of the [tv series](http://www.themightyboosh.com/) I had already realised the genius of the Boosh. One time is enough you see, one time only to drink in the sweet sweet nipple-nectar from the Boosh's comedy teat. \n\nIn review I can only say brilliant brilliant brilliant! It made me laugh, it made me cry, it made me spit my beer over the guy in front. Sorry. \n\nI'd recommend that you all go, but I'm pretty sure it's all sold out. (I guess some simple checking would have confirmed this, but I really can't be bothered). Anyway, you can always look at some [fine photos](http://www.flickr.com/photos/tags/mightyboosh/) of the event.","html_body":"<p>The Mighty Boosh? Wolverhampton Civic Hall? 9th March 2006? 7 O’clock? Yes, we’ll have a bit of that.</p>\n<p>Although I’ve only even seen one episode of the <a href=\"http://www.themightyboosh.com/\">tv series</a> I had already realised the genius of the Boosh. One time is enough you see, one time only to drink in the sweet sweet nipple-nectar from the Boosh’s comedy teat. </p>\n<p>In review I can only say brilliant brilliant brilliant! It made me laugh, it made me cry, it made me spit my beer over the guy in front. Sorry. </p>\n<p>I’d recommend that you all go, but I’m pretty sure it’s all sold out. (I guess some simple checking would have confirmed this, but I really can’t be bothered). Anyway, you can always look at some <a href=\"http://www.flickr.com/photos/tags/mightyboosh/\">fine photos</a> of the event.</p>\n","html_snippet":{"s":"<p>The Mighty Boosh? Wolverhampton Civic Hall? 9th March 2006? 7 O’clock? Yes, we’ll have a bit of that.</p><p>Although I’ve only even seen one episode of the <a href=\"http://www.themightyboosh.com/\">tv series</a> I had already realised the genius of the...</p>","orig":"<p>The Mighty Boosh? Wolverhampton Civic Hall? 9th March 2006? 7 O’clock? Yes, we’ll have a bit of that.</p><p>Although I’ve only even seen one episode of the <a href=\"http://www.themightyboosh.com/\">tv series</a> I had already realised the genius of the...</p>","length":261}},{"attributes":{"date":"2006-01-30T00:00:00.000Z","title":"My Black Dog","id":"14","type":"diary"},"body":"Churchill used to call his bouts with depression his \"Black Dog\". A huge shaggy dog that would visit him for a while.\n\nI really didn't know what depression meant, I always thought it was something people said when they were a bit sad about something. It wasn't until my first year at University that I felt the crushing grip of depression.\n\nFor those of you that don't know; depression isn't feeling a little sad. It's a deep dark pit of despair, it grips you like a vice, squeezing your stomach sending poison round your body. That first time at University was exactly this. I couldn't face doing anything. I didn't care what I looked like, I couldn't interact with people anymore, something had broken inside me and I didn't know what it was or how to make it better.  Slowly, so slowly I came out of it. I floundered there for a while, but it did get better. \n\nThat was eight years ago. I remember for the longest time afterwards I was scared that It would come back, that the very act of being scared of it was going to cause it. Fear of fear itself.  I've had other bouts of it, mostly at University, but always come out the other side, perhaps a bit stronger for the experience. \n\nThat brings me to today. And I'm feeling low again. I wouldn't say that I was depressed because I can remember that feeling, and that was a *lot* worse. This is sporadic, occasionally punching me in the stomach when I'm least expecting it. I do know I'll get better. Past experience teaches me that I _probably_ wont feel like this forever. I've just got to keep telling myself that.","html_body":"<p>Churchill used to call his bouts with depression his “Black Dog”. A huge shaggy dog that would visit him for a while.</p>\n<p>I really didn’t know what depression meant, I always thought it was something people said when they were a bit sad about something. It wasn’t until my first year at University that I felt the crushing grip of depression.</p>\n<p>For those of you that don’t know; depression isn’t feeling a little sad. It’s a deep dark pit of despair, it grips you like a vice, squeezing your stomach sending poison round your body. That first time at University was exactly this. I couldn’t face doing anything. I didn’t care what I looked like, I couldn’t interact with people anymore, something had broken inside me and I didn’t know what it was or how to make it better.  Slowly, so slowly I came out of it. I floundered there for a while, but it did get better. </p>\n<p>That was eight years ago. I remember for the longest time afterwards I was scared that It would come back, that the very act of being scared of it was going to cause it. Fear of fear itself.  I’ve had other bouts of it, mostly at University, but always come out the other side, perhaps a bit stronger for the experience. </p>\n<p>That brings me to today. And I’m feeling low again. I wouldn’t say that I was depressed because I can remember that feeling, and that was a <em>lot</em> worse. This is sporadic, occasionally punching me in the stomach when I’m least expecting it. I do know I’ll get better. Past experience teaches me that I <em>probably</em> wont feel like this forever. I’ve just got to keep telling myself that.</p>\n","html_snippet":{"s":"<p>Churchill used to call his bouts with depression his “Black Dog”. A huge shaggy dog that would visit him for a while.</p><p>I really didn’t know what depression meant, I always thought it was something people...</p>","orig":"<p>Churchill used to call his bouts with depression his “Black Dog”. A huge shaggy dog that would visit him for a while.</p><p>I really didn’t know what depression meant, I always thought it was something people...</p>","length":218}},{"attributes":{"date":"2006-01-27T00:00:00.000Z","title":"Four Things","id":"13","type":"diary"},"body":"Paul: You have a reprieve from me writing about last night's debacle to join in the four things geekary... I've been [tagged](http://www.lloydyweb.org/blog/2006/01/four_things.php) by [Lloydy](http://www.lloydyweb.org) so it would seam I have to do the same, kind of like a blog chain letter, but without the threat of spiritual violence. Hang on your collective asses cos here we go... \n\n### Four jobs i've had in my life\n\n- Petrol Station Attendant\n- [Working at The Terrace Restaurant](http://brownhillsbob.com/2014/02/12/the-terrace-restaurant-closes-down/)\n- Working in a box factory, sweeping floors\n- Web designer\n\n### Four films I can watch over and over\n\n- [Star Wars: Episode VI - Return of the Jedi](http://www.imdb.com/title/tt0086190/)\n- [Contact](http://www.imdb.com/title/tt0118884/)\n- [Big Fish](http://www.imdb.com/title/tt0319061/)\n- [The Man with Two Brains](http://www.imdb.com/title/tt0085894/)\n\n### Four places I have lived\n\n- Walsall\n- Huddersfield\n- Thats pretty much it...\n\n### Four TV shows I love to watch\n\n- The Simpson's\n- Futurama\n- Family Guy (is there a pattern emerging here?)\n- The News (on the BBC naturally)\n\n### Four places I have been on holiday\n\n- Austria\n- Spain\n- USA\n- France\n\n### Four of my favourite foods\n\n- Mum's Sunday lunch\n- Spag. Bol.\n- Curry mate\n- Sausages!\n\n### Four Websites I visit Daily\n\n- [Flickr](http://www.flickr.com)\n- [BBC](http://www.bbc.co.uk)\n- [Homestarrunner](http://www.homestarrunner.com)\n- [Google](http://www.google.co.uk)\n\n### Four places I would rather be right now\n\n- With friends\n- Travelling\n- Travelling some more\n- Settled (guess this one is more an emotional place)\n\n### Four Bloggers I am tagging\n\n- Paul (back at ya)\n- [Steve Smith](http://orderedlist.com/)\n- [Benedict Eastaugh](http://www.ionfish.co.uk/)\n- Other friends who I know have blogs, but I can't remember the address! Consider yourself tagged.\n\n### Additional: Four recent books I'd recommend...\n\n- The Bible (No great surprise there)\n- Wild At Heart\n- The Screwtape Letters\n- Thud!","html_body":"<p>Paul: You have a reprieve from me writing about last night’s debacle to join in the four things geekary… I’ve been <a href=\"http://www.lloydyweb.org/blog/2006/01/four_things.php\">tagged</a> by <a href=\"http://www.lloydyweb.org\">Lloydy</a> so it would seam I have to do the same, kind of like a blog chain letter, but without the threat of spiritual violence. Hang on your collective asses cos here we go… </p>\n<h3 id=\"four-jobs-i-ve-had-in-my-life\">Four jobs i’ve had in my life</h3>\n<ul>\n<li>Petrol Station Attendant</li>\n<li><a href=\"http://brownhillsbob.com/2014/02/12/the-terrace-restaurant-closes-down/\">Working at The Terrace Restaurant</a></li>\n<li>Working in a box factory, sweeping floors</li>\n<li>Web designer</li>\n</ul>\n<h3 id=\"four-films-i-can-watch-over-and-over\">Four films I can watch over and over</h3>\n<ul>\n<li><a href=\"http://www.imdb.com/title/tt0086190/\">Star Wars: Episode VI - Return of the Jedi</a></li>\n<li><a href=\"http://www.imdb.com/title/tt0118884/\">Contact</a></li>\n<li><a href=\"http://www.imdb.com/title/tt0319061/\">Big Fish</a></li>\n<li><a href=\"http://www.imdb.com/title/tt0085894/\">The Man with Two Brains</a></li>\n</ul>\n<h3 id=\"four-places-i-have-lived\">Four places I have lived</h3>\n<ul>\n<li>Walsall</li>\n<li>Huddersfield</li>\n<li>Thats pretty much it…</li>\n</ul>\n<h3 id=\"four-tv-shows-i-love-to-watch\">Four TV shows I love to watch</h3>\n<ul>\n<li>The Simpson’s</li>\n<li>Futurama</li>\n<li>Family Guy (is there a pattern emerging here?)</li>\n<li>The News (on the BBC naturally)</li>\n</ul>\n<h3 id=\"four-places-i-have-been-on-holiday\">Four places I have been on holiday</h3>\n<ul>\n<li>Austria</li>\n<li>Spain</li>\n<li>USA</li>\n<li>France</li>\n</ul>\n<h3 id=\"four-of-my-favourite-foods\">Four of my favourite foods</h3>\n<ul>\n<li>Mum’s Sunday lunch</li>\n<li>Spag. Bol.</li>\n<li>Curry mate</li>\n<li>Sausages!</li>\n</ul>\n<h3 id=\"four-websites-i-visit-daily\">Four Websites I visit Daily</h3>\n<ul>\n<li><a href=\"http://www.flickr.com\">Flickr</a></li>\n<li><a href=\"http://www.bbc.co.uk\">BBC</a></li>\n<li><a href=\"http://www.homestarrunner.com\">Homestarrunner</a></li>\n<li><a href=\"http://www.google.co.uk\">Google</a></li>\n</ul>\n<h3 id=\"four-places-i-would-rather-be-right-now\">Four places I would rather be right now</h3>\n<ul>\n<li>With friends</li>\n<li>Travelling</li>\n<li>Travelling some more</li>\n<li>Settled (guess this one is more an emotional place)</li>\n</ul>\n<h3 id=\"four-bloggers-i-am-tagging\">Four Bloggers I am tagging</h3>\n<ul>\n<li>Paul (back at ya)</li>\n<li><a href=\"http://orderedlist.com/\">Steve Smith</a></li>\n<li><a href=\"http://www.ionfish.co.uk/\">Benedict Eastaugh</a></li>\n<li>Other friends who I know have blogs, but I can’t remember the address! Consider yourself tagged.</li>\n</ul>\n<h3 id=\"additional-four-recent-books-i-d-recommend-\">Additional: Four recent books I’d recommend…</h3>\n<ul>\n<li>The Bible (No great surprise there)</li>\n<li>Wild At Heart</li>\n<li>The Screwtape Letters</li>\n<li>Thud!</li>\n</ul>\n","html_snippet":{"s":"<p>Paul: You have a reprieve from me writing about last night’s debacle to join in the four things geekary… I’ve been <a href=\"http://www.lloydyweb.org/blog/2006/01/four_things.php\">tagged</a> by <a href=\"http://www.lloydyweb.org\">Lloydy</a> so it would seam I have to do the same, kind of like a blog chain letter,...</p>","orig":"<p>Paul: You have a reprieve from me writing about last night’s debacle to join in the four things geekary… I’ve been <a href=\"http://www.lloydyweb.org/blog/2006/01/four_things.php\">tagged</a> by <a href=\"http://www.lloydyweb.org\">Lloydy</a> so it would seam I have to do the same, kind of like a blog chain letter,...</p>","length":322}},{"attributes":{"date":"2006-01-13T00:00:00.000Z","title":"A Quick Post About Tea","id":"12","type":"diary"},"body":"[![Earl Grey Sir?](http://static.flickr.com/6/86147107_394076ec74.jpg)](http://www.flickr.com/photos/roobottom/86147107/ \"Photo Sharing\") \n\nOoo, I love tea me. So I thought after the stir caused by the last post I'd write about something else that's quite close to my heart. Yesterday lunchtime I had a wonder over the local supermarket, my mission was clear: To get some new tea bags to replace the 3 year old bumper pack of \"20 million bags\" we have lying around in the work kitchen. \n\nSo imagine my displeasure when after 5 minuets drawing fresh water and boiling the slower-than-average kettle I came to get an Earl Grey bag for my cup only to discover i'd brought loose leaves! It's some indication of the lengths I'll goto to amuse myself at work that I was **this** gutted about the lack of decent tea. And then to spend another 10 minuets taking a picture of the tea, uploading it, then writing about it as-well... Anyway, in conclusion, I like tea. A lot.","html_body":"<p><a href=\"http://www.flickr.com/photos/roobottom/86147107/\" title=\"Photo Sharing\"><img src=\"http://static.flickr.com/6/86147107_394076ec74.jpg\" alt=\"Earl Grey Sir?\"></a> </p>\n<p>Ooo, I love tea me. So I thought after the stir caused by the last post I’d write about something else that’s quite close to my heart. Yesterday lunchtime I had a wonder over the local supermarket, my mission was clear: To get some new tea bags to replace the 3 year old bumper pack of “20 million bags” we have lying around in the work kitchen. </p>\n<p>So imagine my displeasure when after 5 minuets drawing fresh water and boiling the slower-than-average kettle I came to get an Earl Grey bag for my cup only to discover i’d brought loose leaves! It’s some indication of the lengths I’ll goto to amuse myself at work that I was <strong>this</strong> gutted about the lack of decent tea. And then to spend another 10 minuets taking a picture of the tea, uploading it, then writing about it as-well… Anyway, in conclusion, I like tea. A lot.</p>\n","html_snippet":{"s":"<p><a href=\"http://www.flickr.com/photos/roobottom/86147107/\" title=\"Photo Sharing\"></a> </p><p>Ooo, I love tea me. So I thought after the stir caused by the last post I’d write about something else that’s quite close to my heart. Yesterday lunchtime I had a wonder over the local supermarket, my...</p>","orig":"<p><a href=\"http://www.flickr.com/photos/roobottom/86147107/\" title=\"Photo Sharing\"></a> </p><p>Ooo, I love tea me. So I thought after the stir caused by the last post I’d write about something else that’s quite close to my heart. Yesterday lunchtime I had a wonder over the local supermarket, my...</p>","length":303}},{"attributes":{"date":"2006-01-08T00:00:00.000Z","title":"My Spritual Home?","id":"11","type":"diary"},"body":"[![Beautiful Walsall](http://static.flickr.com/40/83574635_4b4c110770.jpg)](http://www.flickr.com/photos/roobottom/83574635/ \"Photo Sharing\") \n\nBeing a Walsall boy by birth, I'm very much inclined to do put-down my home town. Walsall admittedly could be accurately described as a shit hole, having been done down by such literacy geniuses as [chav towns](http://www.chavtowns.co.uk/modules.php?name=News&file=article&sid=816 \"Walsall on chavtowns.co.uk\") and even [Google](http://answers.google.com/answers/threadview?id=97428 \"What's Walsall Like?\"). But I would like to offer a different point of view. \n\nWalsall isn't what he buildings look like, or the amount of money spent on some new statue in the middle of town - It's the people. I'm sure this is true of anywhere you live... In the words of [Vic](http://www.walsallcommunitychurch.org \"Walsall Community Church\")\n\n> People Are Important\n\nSo I'd like to stand against all the crap spoken about Walsall, and say if we are to improve our town we should be proud of it! It's a diverse miss-mash of people who for the most part are brilliant. Yeah, we have our problems and our rough areas, but where doesn't? Thank God for Walsall, and the people in it. We really could be great!","html_body":"<p><a href=\"http://www.flickr.com/photos/roobottom/83574635/\" title=\"Photo Sharing\"><img src=\"http://static.flickr.com/40/83574635_4b4c110770.jpg\" alt=\"Beautiful Walsall\"></a> </p>\n<p>Being a Walsall boy by birth, I’m very much inclined to do put-down my home town. Walsall admittedly could be accurately described as a shit hole, having been done down by such literacy geniuses as <a href=\"http://www.chavtowns.co.uk/modules.php?name=News&amp;file=article&amp;sid=816\" title=\"Walsall on chavtowns.co.uk\">chav towns</a> and even <a href=\"http://answers.google.com/answers/threadview?id=97428\" title=\"What&#39;s Walsall Like?\">Google</a>. But I would like to offer a different point of view. </p>\n<p>Walsall isn’t what he buildings look like, or the amount of money spent on some new statue in the middle of town - It’s the people. I’m sure this is true of anywhere you live… In the words of <a href=\"http://www.walsallcommunitychurch.org\" title=\"Walsall Community Church\">Vic</a></p>\n<blockquote>\n<p>People Are Important</p>\n</blockquote>\n<p>So I’d like to stand against all the crap spoken about Walsall, and say if we are to improve our town we should be proud of it! It’s a diverse miss-mash of people who for the most part are brilliant. Yeah, we have our problems and our rough areas, but where doesn’t? Thank God for Walsall, and the people in it. We really could be great!</p>\n","html_snippet":{"s":"<p><a href=\"http://www.flickr.com/photos/roobottom/83574635/\" title=\"Photo Sharing\"></a> </p><p>Being a Walsall boy by birth, I’m very much inclined to do put-down my home town. Walsall admittedly could be accurately described as a shit hole, having been done down by such literacy geniuses as <a href=\"http://www.chavtowns.co.uk/modules.php?name=News&amp;file=article&amp;sid=816\" title=\"Walsall on chavtowns.co.uk\">chav...</a></p>","orig":"<p><a href=\"http://www.flickr.com/photos/roobottom/83574635/\" title=\"Photo Sharing\"></a> </p><p>Being a Walsall boy by birth, I’m very much inclined to do put-down my home town. Walsall admittedly could be accurately described as a shit hole, having been done down by such literacy geniuses as <a href=\"http://www.chavtowns.co.uk/modules.php?name=News&amp;file=article&amp;sid=816\" title=\"Walsall on chavtowns.co.uk\">chav...</a></p>","length":432}},{"attributes":{"date":"2005-12-17T00:00:00.000Z","title":"An Arresting Situation","id":"10","type":"diary"},"body":"It's ten to one on Saturday morning, and I've just spent a pleasant hour being arrested for drink driving, getting fingerprint ink all over my coat and blowing into this big machine all to find out that I'm so far under the drink drive limit it barely registered on the machine. \n\nIt all started out as a good night out bowling with some mates from church, and then for a quick drink in the local. Which meant I had one small bottle of larger. Apparently on the journey home I failed to indicate at an island, so was merrily pulled over, blue light's-a-flashing. To be fair the two officers were very nice about the whole thing, and I kinda felt sorry for them wasting their time on me and a mountain of paperwork, still not the most pleasant way to end your night. Guess it's taught me a lesson though... Don't drink and drive. At all. Not a drop.","html_body":"<p>It’s ten to one on Saturday morning, and I’ve just spent a pleasant hour being arrested for drink driving, getting fingerprint ink all over my coat and blowing into this big machine all to find out that I’m so far under the drink drive limit it barely registered on the machine. </p>\n<p>It all started out as a good night out bowling with some mates from church, and then for a quick drink in the local. Which meant I had one small bottle of larger. Apparently on the journey home I failed to indicate at an island, so was merrily pulled over, blue light’s-a-flashing. To be fair the two officers were very nice about the whole thing, and I kinda felt sorry for them wasting their time on me and a mountain of paperwork, still not the most pleasant way to end your night. Guess it’s taught me a lesson though… Don’t drink and drive. At all. Not a drop.</p>\n","html_snippet":{"s":"<p>It’s ten to one on Saturday morning, and I’ve just spent a pleasant hour being arrested for drink driving, getting fingerprint ink all over my coat and blowing into this big machine all to find out that...</p>","orig":"<p>It’s ten to one on Saturday morning, and I’ve just spent a pleasant hour being arrested for drink driving, getting fingerprint ink all over my coat and blowing into this big machine all to find out that...</p>","length":212}},{"attributes":{"date":"2005-12-15T00:00:00.000Z","title":"The Rain in Spain","id":"9","type":"diary"},"body":"[![The Metro ~ Plaza de Espana](http://static.flickr.com/20/71852561_baaba7d583.jpg)](http://www.flickr.com/photos/roobottom/71852561/ \"Photo Sharing\") \n\nIsn't it funny how you meet new people? Let's say for example that you commented on someones [Flickr](http://www.flickr.com) photos, and six months later you fly out to Spain to visit them. Well, funnily enough (cue sincere laughter) that's exactly what happened to me.\n\nMadrid was awesome, and a good time was had by all. We saw castles, bars, mountains, bars, shops, bars, trains, planes and automobiles. Oh, and bars. But all this got me thinking up until I'd actually spent more than one afternoon with Liz I'd been feeling a little... seedy about meeting someone over the internet. Maybe that's not the right word, but my limited vocabulary doesn't allow me to be any more descriptive. \n\nI'm sure you know what I mean, 'meeting' people via the internet does have a certain stigma attached to it. I'm very happy to say in this case my new friend (who I've firmly move up from 'flickr friend' status) turned out to be awesome.","html_body":"<p><a href=\"http://www.flickr.com/photos/roobottom/71852561/\" title=\"Photo Sharing\"><img src=\"http://static.flickr.com/20/71852561_baaba7d583.jpg\" alt=\"The Metro ~ Plaza de Espana\"></a> </p>\n<p>Isn’t it funny how you meet new people? Let’s say for example that you commented on someones <a href=\"http://www.flickr.com\">Flickr</a> photos, and six months later you fly out to Spain to visit them. Well, funnily enough (cue sincere laughter) that’s exactly what happened to me.</p>\n<p>Madrid was awesome, and a good time was had by all. We saw castles, bars, mountains, bars, shops, bars, trains, planes and automobiles. Oh, and bars. But all this got me thinking up until I’d actually spent more than one afternoon with Liz I’d been feeling a little… seedy about meeting someone over the internet. Maybe that’s not the right word, but my limited vocabulary doesn’t allow me to be any more descriptive. </p>\n<p>I’m sure you know what I mean, ‘meeting’ people via the internet does have a certain stigma attached to it. I’m very happy to say in this case my new friend (who I’ve firmly move up from ‘flickr friend’ status) turned out to be awesome.</p>\n","html_snippet":{"s":"<p><a href=\"http://www.flickr.com/photos/roobottom/71852561/\" title=\"Photo Sharing\"></a> </p><p>Isn’t it funny how you meet new people? Let’s say for example that you commented on someones <a href=\"http://www.flickr.com\">Flickr</a> photos, and six months later you fly out to Spain to visit them. Well, funnily enough (cue sincere...</p>","orig":"<p><a href=\"http://www.flickr.com/photos/roobottom/71852561/\" title=\"Photo Sharing\"></a> </p><p>Isn’t it funny how you meet new people? Let’s say for example that you commented on someones <a href=\"http://www.flickr.com\">Flickr</a> photos, and six months later you fly out to Spain to visit them. Well, funnily enough (cue sincere...</p>","length":337}},{"attributes":{"date":"2005-09-14T00:00:00.000Z","title":"Cow Assassins","id":"8","type":"diary"},"body":"[![Cow Assassins](http://static.flickr.com/31/43119462_37122142e6.jpg)](http://www.flickr.com/photos/roobottom/43119462/ \"Photo Sharing\") \n\nNever let it be said that life in the country is boring, danger lurks around every corner. There I was taking a gentle stroll, just chilling out at lunchtime, when I \"herd\" it. A sound which sent a chill up my spine. The sound of a thousand bovine hooves thundering along in the field next to the path on which I was walking. My view was obscured by a large bush, but every now and again I caught a flash of black and white. As I reached the end of the lane, a gate to my left was all that separated to from the now huge throng of cows amassing before me. \n\nLuckily I had my camera, and just managed to take this snap before the maddened crowd, who were now threatening to burst through onto the path, got too leery! As I left, I was treated to a chorus of MOOO's, and I knew I had witnessed something spectacular. These truly were [Cow Assassins](http://www.flickr.com/groups/cowassassins/)","html_body":"<p><a href=\"http://www.flickr.com/photos/roobottom/43119462/\" title=\"Photo Sharing\"><img src=\"http://static.flickr.com/31/43119462_37122142e6.jpg\" alt=\"Cow Assassins\"></a> </p>\n<p>Never let it be said that life in the country is boring, danger lurks around every corner. There I was taking a gentle stroll, just chilling out at lunchtime, when I “herd” it. A sound which sent a chill up my spine. The sound of a thousand bovine hooves thundering along in the field next to the path on which I was walking. My view was obscured by a large bush, but every now and again I caught a flash of black and white. As I reached the end of the lane, a gate to my left was all that separated to from the now huge throng of cows amassing before me. </p>\n<p>Luckily I had my camera, and just managed to take this snap before the maddened crowd, who were now threatening to burst through onto the path, got too leery! As I left, I was treated to a chorus of MOOO’s, and I knew I had witnessed something spectacular. These truly were <a href=\"http://www.flickr.com/groups/cowassassins/\">Cow Assassins</a></p>\n","html_snippet":{"s":"<p><a href=\"http://www.flickr.com/photos/roobottom/43119462/\" title=\"Photo Sharing\"></a> </p><p>Never let it be said that life in the country is boring, danger lurks around every corner. There I was taking a gentle stroll, just chilling out at lunchtime, when I “herd” it. A sound which sent a chill...</p>","orig":"<p><a href=\"http://www.flickr.com/photos/roobottom/43119462/\" title=\"Photo Sharing\"></a> </p><p>Never let it be said that life in the country is boring, danger lurks around every corner. There I was taking a gentle stroll, just chilling out at lunchtime, when I “herd” it. A sound which sent a chill...</p>","length":306}},{"attributes":{"date":"2005-09-12T00:00:00.000Z","title":"Birmingham, its bostin' mate","id":"7","type":"diary"},"body":"[![Candy Coloured Bars](http://static.flickr.com/25/42465802_5f4b1f0f74.jpg)](http://www.flickr.com/photos/roobottom/42465802/ \"Photo Sharing\") \n\nMany people who hear my accent presume I'm from Birmingham, but I definitely have a Walsall accent, and \"we'me from the Black Country\", and proud of it! Anyway, this post is all about Birmingham in a good way, which is quite unusual if you've ever spoken to anyone who lives locally about the \"capital of the Midlands\". Usually Birmingham gets a bit of a bad wrap. Let's face it, people think its crap, (feel free to correct me on this). But I'm happy to say that Birmingham is undergoing a bit of a renaissance period at the moment. \n\nOver the last 5 or so years the city council (and no doubt a medley of other investors) have pumped a shed load of money into re-vamping the city centre. It's the new things that make the old things look better. Okay, I know this is an ambiguous sentence, but when you offset some of the older building and features in Birmingham (such as the candy coloured fence, which is in Bridge Street by the way) against the clean lines of the new building, you get something spectacular. Birmingham has come a long way since it's massive decline in the 80's and early 90's, and I know it's still got a log way to go, but it's showing a lot of promise! \n\nDon't be put off by the stories of old, come and visit Birmingham. It's bostin' mate.","html_body":"<p><a href=\"http://www.flickr.com/photos/roobottom/42465802/\" title=\"Photo Sharing\"><img src=\"http://static.flickr.com/25/42465802_5f4b1f0f74.jpg\" alt=\"Candy Coloured Bars\"></a> </p>\n<p>Many people who hear my accent presume I’m from Birmingham, but I definitely have a Walsall accent, and “we’me from the Black Country”, and proud of it! Anyway, this post is all about Birmingham in a good way, which is quite unusual if you’ve ever spoken to anyone who lives locally about the “capital of the Midlands”. Usually Birmingham gets a bit of a bad wrap. Let’s face it, people think its crap, (feel free to correct me on this). But I’m happy to say that Birmingham is undergoing a bit of a renaissance period at the moment. </p>\n<p>Over the last 5 or so years the city council (and no doubt a medley of other investors) have pumped a shed load of money into re-vamping the city centre. It’s the new things that make the old things look better. Okay, I know this is an ambiguous sentence, but when you offset some of the older building and features in Birmingham (such as the candy coloured fence, which is in Bridge Street by the way) against the clean lines of the new building, you get something spectacular. Birmingham has come a long way since it’s massive decline in the 80’s and early 90’s, and I know it’s still got a log way to go, but it’s showing a lot of promise! </p>\n<p>Don’t be put off by the stories of old, come and visit Birmingham. It’s bostin’ mate.</p>\n","html_snippet":{"s":"<p><a href=\"http://www.flickr.com/photos/roobottom/42465802/\" title=\"Photo Sharing\"></a> </p><p>Many people who hear my accent presume I’m from Birmingham, but I definitely have a Walsall accent, and “we’me from the Black Country”, and proud of it! Anyway, this post is all about Birmingham in a...</p>","orig":"<p><a href=\"http://www.flickr.com/photos/roobottom/42465802/\" title=\"Photo Sharing\"></a> </p><p>Many people who hear my accent presume I’m from Birmingham, but I definitely have a Walsall accent, and “we’me from the Black Country”, and proud of it! Anyway, this post is all about Birmingham in a...</p>","length":302}},{"attributes":{"date":"2005-07-07T00:00:00.000Z","title":"London","id":"6","type":"diary"},"body":"I'm lost for words as events unfold in London. Listening to the BBC news is surreal, it's only just sinking in just what's happened in our capital. Earlier Tony Blair confirmed that this looks like terrorist attacks timed to coincide with the G8 which starts in Scotland today. \n\nOne thing that stood out for me was the solidarity shown by other governments around the world. The French Prime Minister said that the Olympic defeat pales into the insignificance. Today, he said, we all stand as Londoners. \n\nThe Muslim council of Great Britain have condemned the attacks and called for calm. I think this is a very good point to remember, it would be a real tragedy for more innocent people to get hurt by unthinking individuals out for revenge. I just pray that no more people will be hurt, and all our thoughts are with the families who have lost loved ones this terrible morning.","html_body":"<p>I’m lost for words as events unfold in London. Listening to the BBC news is surreal, it’s only just sinking in just what’s happened in our capital. Earlier Tony Blair confirmed that this looks like terrorist attacks timed to coincide with the G8 which starts in Scotland today. </p>\n<p>One thing that stood out for me was the solidarity shown by other governments around the world. The French Prime Minister said that the Olympic defeat pales into the insignificance. Today, he said, we all stand as Londoners. </p>\n<p>The Muslim council of Great Britain have condemned the attacks and called for calm. I think this is a very good point to remember, it would be a real tragedy for more innocent people to get hurt by unthinking individuals out for revenge. I just pray that no more people will be hurt, and all our thoughts are with the families who have lost loved ones this terrible morning.</p>\n","html_snippet":{"s":"<p>I’m lost for words as events unfold in London. Listening to the BBC news is surreal, it’s only just sinking in just what’s happened in our capital. Earlier Tony Blair confirmed that this looks like terrorist...</p>","orig":"<p>I’m lost for words as events unfold in London. Listening to the BBC news is surreal, it’s only just sinking in just what’s happened in our capital. Earlier Tony Blair confirmed that this looks like terrorist...</p>","length":217}},{"attributes":{"date":"2005-07-06T00:00:00.000Z","title":"The Great Tea Debate","id":"5","type":"diary"},"body":"[Paul](http://www.lloydyweb.org) says I should write about things that affect the world at large, that have a global impact. So that got me thinking about the tea situation here at work.\n\nPaul (the other one, at work) brought in some PG Tips tea granules, that are basically the same as coffee granules, but in tea-format. These are supposedly the pinnacle of tea technology, forced into the barren wasteland left by the pyramid bag. But unfortunately it tastes like crap.  \n\nMy point being this; traditional stuff is the best. Real tea, coffee, rice, fruit juice, chocolate and wines are well worth spending an extra few pence. But even better, spend your money on products that bear the [fair-trade](http://www.fairtrade.org.uk) logo. \n\nIn a week where we've had Live8 and the G8 summit, the massive gulf between the rich and poor is in the forefront of everyone's minds. This is just one more little thing you can do to help. It does make a difference.","html_body":"<p><a href=\"http://www.lloydyweb.org\">Paul</a> says I should write about things that affect the world at large, that have a global impact. So that got me thinking about the tea situation here at work.</p>\n<p>Paul (the other one, at work) brought in some PG Tips tea granules, that are basically the same as coffee granules, but in tea-format. These are supposedly the pinnacle of tea technology, forced into the barren wasteland left by the pyramid bag. But unfortunately it tastes like crap.  </p>\n<p>My point being this; traditional stuff is the best. Real tea, coffee, rice, fruit juice, chocolate and wines are well worth spending an extra few pence. But even better, spend your money on products that bear the <a href=\"http://www.fairtrade.org.uk\">fair-trade</a> logo. </p>\n<p>In a week where we’ve had Live8 and the G8 summit, the massive gulf between the rich and poor is in the forefront of everyone’s minds. This is just one more little thing you can do to help. It does make a difference.</p>\n","html_snippet":{"s":"<p><a href=\"http://www.lloydyweb.org\">Paul</a> says I should write about things that affect the world at large, that have a global impact. So that got me thinking about the tea situation here at work.</p><p>Paul (the other one, at work) brought in some...</p>","orig":"<p><a href=\"http://www.lloydyweb.org\">Paul</a> says I should write about things that affect the world at large, that have a global impact. So that got me thinking about the tea situation here at work.</p><p>Paul (the other one, at work) brought in some...</p>","length":259}},{"attributes":{"date":"2005-06-09T00:00:00.000Z","title":"Ouch, and other stories","id":"4","type":"diary"},"body":"Yeah, yeah, yeah. I know it's been a while, but it's built up the expectation, right?\n\nSince the last time I wrote, i've been doing all kinds of stuff (for want of a better word). So here's the rundown of two and a half weeks in the life of me...\n\nA week before [Lee and Lindsay's wedding](http://www.flickr.com/photos/roobottom/sets/395147/) I was raving on about how old I felt. So the couples happy day came, Lee fluffed his lines, Lloydy got VERY drunk, and I suddenly didn't feel as old after all. All in all a good day was had by all. The best bit being the hour rant that someone had in the loo, i'll post the video soon if he (or she, don't want to incriminate anyone... Although that would've meant I was filming in the girls toilet), will let me. \n\nThe bank holiday called for some [biking in the Wyre Valley](http://www.flickr.com/photos/roobottom/sets/394848/) with the lads. What can I say, as usual a top day out, and got me some more footage for the \"rant cam\". \n\nI (and several others from church) took a visit to a mosque in Pleck for one of their open days. It's a really good idea, they open up the whole thing, show you round, feed you (yes, a BIG factor in deciding to go) and give you this talk on Islam. I'm impressed with anything that helps build bridges between communities, so a big thanks to those guys for making us feel so welcome. \n\nAnother biking session brought me [this very nice wound](http://www.flickr.com/photos/roobottom/17616354/) and a couple of bruised ribs (hence the \"ouch\").\n\nWhich I guess brings me up to this week, that has so far conceited of work, a joint cell with the guys from [Eurostreams](http://www.eurostreams.co.uk) (an absolutely awesome night), the Tuesday night pub quiz, and a bit of a Bulti (init mate) with Steve, Paul, Ben and the rest of the guys from WCC. All that, plus the usual pub nights, cinema, the quiz and the odd jamming session here and there have made for a pretty sweet, two (or so) weeks. \n\nInteresting, eh? No... I didn't think so.","html_body":"<p>Yeah, yeah, yeah. I know it’s been a while, but it’s built up the expectation, right?</p>\n<p>Since the last time I wrote, i’ve been doing all kinds of stuff (for want of a better word). So here’s the rundown of two and a half weeks in the life of me…</p>\n<p>A week before <a href=\"http://www.flickr.com/photos/roobottom/sets/395147/\">Lee and Lindsay’s wedding</a> I was raving on about how old I felt. So the couples happy day came, Lee fluffed his lines, Lloydy got VERY drunk, and I suddenly didn’t feel as old after all. All in all a good day was had by all. The best bit being the hour rant that someone had in the loo, i’ll post the video soon if he (or she, don’t want to incriminate anyone… Although that would’ve meant I was filming in the girls toilet), will let me. </p>\n<p>The bank holiday called for some <a href=\"http://www.flickr.com/photos/roobottom/sets/394848/\">biking in the Wyre Valley</a> with the lads. What can I say, as usual a top day out, and got me some more footage for the “rant cam”. </p>\n<p>I (and several others from church) took a visit to a mosque in Pleck for one of their open days. It’s a really good idea, they open up the whole thing, show you round, feed you (yes, a BIG factor in deciding to go) and give you this talk on Islam. I’m impressed with anything that helps build bridges between communities, so a big thanks to those guys for making us feel so welcome. </p>\n<p>Another biking session brought me <a href=\"http://www.flickr.com/photos/roobottom/17616354/\">this very nice wound</a> and a couple of bruised ribs (hence the “ouch”).</p>\n<p>Which I guess brings me up to this week, that has so far conceited of work, a joint cell with the guys from <a href=\"http://www.eurostreams.co.uk\">Eurostreams</a> (an absolutely awesome night), the Tuesday night pub quiz, and a bit of a Bulti (init mate) with Steve, Paul, Ben and the rest of the guys from WCC. All that, plus the usual pub nights, cinema, the quiz and the odd jamming session here and there have made for a pretty sweet, two (or so) weeks. </p>\n<p>Interesting, eh? No… I didn’t think so.</p>\n","html_snippet":{"s":"<p>Yeah, yeah, yeah. I know it’s been a while, but it’s built up the expectation, right?</p><p>Since the last time I wrote, i’ve been doing all kinds of stuff (for want of a better word). So here’s the rundown...</p>","orig":"<p>Yeah, yeah, yeah. I know it’s been a while, but it’s built up the expectation, right?</p><p>Since the last time I wrote, i’ve been doing all kinds of stuff (for want of a better word). So here’s the rundown...</p>","length":216}},{"attributes":{"date":"2005-04-19T00:00:00.000Z","title":"Back to the old school","id":"3","type":"diary"},"body":"It's been a while since my last post so I better make this a good-un (well, relatively speaking). It being the season of University mates birthday's (including mine - which is today by the way, just in case you wanted to send me that spare Ferrari you don't use any more), I headed up to Huddersfield. \n\nThe night started out in traditional style with pizza-pie and vodka then continued the trend with a trip to Session, Vox, Sharkeys and then I'm sure there was more, but I know we did end up in the new noodle bar, which was nice (despite me voting for Lazeez, again). It was awesome to see the lads again, and kinda made me pine for the good old days of finishing work at 4.30 in the afternoon and getting home at 3 in the morning having only stopped off for a \"quick pint\" in Vox. \n\nBut I guess you get older and move on... back to Brownhills... _Damn_. \n\nThe rest of the weekend consisted of sitting around at Riks watching movies and eating yet more junk food. What could be better?","html_body":"<p>It’s been a while since my last post so I better make this a good-un (well, relatively speaking). It being the season of University mates birthday’s (including mine - which is today by the way, just in case you wanted to send me that spare Ferrari you don’t use any more), I headed up to Huddersfield. </p>\n<p>The night started out in traditional style with pizza-pie and vodka then continued the trend with a trip to Session, Vox, Sharkeys and then I’m sure there was more, but I know we did end up in the new noodle bar, which was nice (despite me voting for Lazeez, again). It was awesome to see the lads again, and kinda made me pine for the good old days of finishing work at 4.30 in the afternoon and getting home at 3 in the morning having only stopped off for a “quick pint” in Vox. </p>\n<p>But I guess you get older and move on… back to Brownhills… <em>Damn</em>. </p>\n<p>The rest of the weekend consisted of sitting around at Riks watching movies and eating yet more junk food. What could be better?</p>\n","html_snippet":{"s":"<p>It’s been a while since my last post so I better make this a good-un (well, relatively speaking). It being the season of University mates birthday’s (including mine - which is today by the way, just in...</p>","orig":"<p>It’s been a while since my last post so I better make this a good-un (well, relatively speaking). It being the season of University mates birthday’s (including mine - which is today by the way, just in...</p>","length":211}},{"attributes":{"date":"2005-03-31T00:00:00.000Z","title":"A camp weekend","id":"2","type":"diary"},"body":"There's nothing quite like waking up at 4.30am on a very cold night, desperate for the loo, and then realising you're in a tent on top of a foggy hill in the middle of Derbyshire. \n\nIt'd actually been a really nice sunny Good-Friday, perfect for mountain biking. So we set off: Four blokes, one van and Jayne (Chris' sat-nav lady friend) - Gripped, sorted, we were ready to off-road. The riding was good, nothing too challenging, just easy riding to ease us back in after the long winter. \n\nSo as we left for the pub about 5.30pm the sun was shining and all was right with the world. The meal was awesome, and spirits were high, so we decided that camping would actually be a *really* good idea. I knew of a camp-site, nothing special, but this was camping right? We'd got tents and sleeping bags, what more did we need? We set off, Jayne leading the way, the last of the warm spring sun disappearing behind the rolling hills. \n\nAbout half way to the site, a few spots of gentle rain began to appear on the windscreen. We wiped them away. The closer we got; the rougher the roads became, the rain was now slightly more than a a gentle smattering, and we were starting to think this was a bad idea. \n\nWe finally arrived at [Eric Byne camp-site](http://www.peakdistrict.org/pubs/access4all/byne.htm) it was dark, pissing down, and bloody cold. After trudging up and down the hill several times, even the trip to the pub didn't cheer us up much. All I can say is thank the Lord for Little Chef!","html_body":"<p>There’s nothing quite like waking up at 4.30am on a very cold night, desperate for the loo, and then realising you’re in a tent on top of a foggy hill in the middle of Derbyshire. </p>\n<p>It’d actually been a really nice sunny Good-Friday, perfect for mountain biking. So we set off: Four blokes, one van and Jayne (Chris’ sat-nav lady friend) - Gripped, sorted, we were ready to off-road. The riding was good, nothing too challenging, just easy riding to ease us back in after the long winter. </p>\n<p>So as we left for the pub about 5.30pm the sun was shining and all was right with the world. The meal was awesome, and spirits were high, so we decided that camping would actually be a <em>really</em> good idea. I knew of a camp-site, nothing special, but this was camping right? We’d got tents and sleeping bags, what more did we need? We set off, Jayne leading the way, the last of the warm spring sun disappearing behind the rolling hills. </p>\n<p>About half way to the site, a few spots of gentle rain began to appear on the windscreen. We wiped them away. The closer we got; the rougher the roads became, the rain was now slightly more than a a gentle smattering, and we were starting to think this was a bad idea. </p>\n<p>We finally arrived at <a href=\"http://www.peakdistrict.org/pubs/access4all/byne.htm\">Eric Byne camp-site</a> it was dark, pissing down, and bloody cold. After trudging up and down the hill several times, even the trip to the pub didn’t cheer us up much. All I can say is thank the Lord for Little Chef!</p>\n","html_snippet":{"s":"<p>There’s nothing quite like waking up at 4.30am on a very cold night, desperate for the loo, and then realising you’re in a tent on top of a foggy hill in the middle of Derbyshire. </p><p>It’d actually been a...</p>","orig":"<p>There’s nothing quite like waking up at 4.30am on a very cold night, desperate for the loo, and then realising you’re in a tent on top of a foggy hill in the middle of Derbyshire. </p><p>It’d actually been a...</p>","length":217}},{"attributes":{"date":"2005-03-23T00:00:00.000Z","title":"Top 10","id":"1","type":"diary"},"body":"Ever since our earliest days the Human race has been plagued by questions: Who are we? Why are we here? I've have spent the last few weeks pondering such a question. A question that has taxed my (some say feeble) brain to it's very limits. I've pondered, I've considered, I've wept in despair, and I let out a few little farts of frustration wondering just what are my 10 greatest albums of all time? \n\nI've compiled this list as an answer, I just hope I can get what those shrinks call closure on this issue. How can I decide this? I was thinking maybe _Jazz_ by Queen, or _Baby O'Riley_ by The Who, but what about Bowie? Nah, picking number 1 is just too difficult. \n\n1. Jury's still out\n2. O - Damien Rice \n3. War of the Worlds - Jeff Wayne\n4. Sgt. Pepper's Lonely Hearts Club Band - The Beatles\n5. Make Yourself - Incubus \n6. Dizzy Up The Girl - Goo Goo Dolls\n7. Mercury Falling - Sting\n8. Play - Moby \n9. Canon (adagio) in D - Johann Pachelbel \n10. The Beautiful Letdown - Switchfoot","html_body":"<p>Ever since our earliest days the Human race has been plagued by questions: Who are we? Why are we here? I’ve have spent the last few weeks pondering such a question. A question that has taxed my (some say feeble) brain to it’s very limits. I’ve pondered, I’ve considered, I’ve wept in despair, and I let out a few little farts of frustration wondering just what are my 10 greatest albums of all time? </p>\n<p>I’ve compiled this list as an answer, I just hope I can get what those shrinks call closure on this issue. How can I decide this? I was thinking maybe <em>Jazz</em> by Queen, or <em>Baby O’Riley</em> by The Who, but what about Bowie? Nah, picking number 1 is just too difficult. </p>\n<ol>\n<li>Jury’s still out</li>\n<li>O - Damien Rice </li>\n<li>War of the Worlds - Jeff Wayne</li>\n<li>Sgt. Pepper’s Lonely Hearts Club Band - The Beatles</li>\n<li>Make Yourself - Incubus </li>\n<li>Dizzy Up The Girl - Goo Goo Dolls</li>\n<li>Mercury Falling - Sting</li>\n<li>Play - Moby </li>\n<li>Canon (adagio) in D - Johann Pachelbel </li>\n<li>The Beautiful Letdown - Switchfoot</li>\n</ol>\n","html_snippet":{"s":"<p>Ever since our earliest days the Human race has been plagued by questions: Who are we? Why are we here? I’ve have spent the last few weeks pondering such a question. A question that has taxed my (some...</p>","orig":"<p>Ever since our earliest days the Human race has been plagued by questions: Who are we? Why are we here? I’ve have spent the last few weeks pondering such a question. A question that has taxed my (some...</p>","length":210}}]